// @strict-types

#Область ПрограммныйИнтерфейс

#Область УничтожениеПерсональныхДанных

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных
Процедура ПриЗаполненииСведенийОбУничтожаемыхПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Физические лица
	МетаданныеФизическиеЛица = Метаданные.Справочники.ФизическиеЛица;
	СтандартныеРеквизиты = МетаданныеФизическиеЛица.СтандартныеРеквизиты;
	Реквизиты = МетаданныеФизическиеЛица.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеФизическиеЛица.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.ДатаРождения.ПолноеИмя());
	Поля.Добавить(Реквизиты.ФайлФотографии.ПолноеИмя());
	Поля.Добавить(Реквизиты.ИНН.ПолноеИмя());
	Поля.Добавить(Реквизиты.Пол.ПолноеИмя());
	Поля.Добавить(Реквизиты.СтраховойНомерПФР.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация физических лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеФизическиеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Контрагенты по реквизиту ФизЛицо
	МетаданныеКонтрагенты = Метаданные.Справочники.Контрагенты;
	СтандартныеРеквизиты = МетаданныеКонтрагенты.СтандартныеРеквизиты;
	Реквизиты = МетаданныеКонтрагенты.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеКонтрагенты.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.НаименованиеПолное.Имя);
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация контрагентов
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтрагенты.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеКонтрагенты.Реквизиты.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Организации по реквизиту ИндивидуальныйПредприниматель (это ссылка на справочник физлиц)
	МетаданныеОрганизации = Метаданные.Справочники.Организации;
	СтандартныеРеквизиты = МетаданныеОрганизации.СтандартныеРеквизиты;
	Реквизиты = МетаданныеОрганизации.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеОрганизации.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ИндивидуальныйПредприниматель.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	ЭлементПДн.Поля = Поля;

	// Контактная информация организаций
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеОрганизации.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ИндивидуальныйПредприниматель.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);
	
	
	// Справочник Контактные лица по реквизиту ФизЛицо
	МетаданныеКонтактныеЛица = Метаданные.Справочники.КонтактныеЛица;
	СтандартныеРеквизиты = МетаданныеКонтактныеЛица.СтандартныеРеквизиты;
	Реквизиты = МетаданныеКонтактныеЛица.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	ЭлементПДн.Поля = Поля;

	// Контактная информация контактных лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеКонтактныеЛица.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);


	// Регистр сведений «Документы физических лиц».
	МетаданныеДокументыФизЛиц = Метаданные.РегистрыСведений.ДокументыФизическихЛиц;
	ДокументыФизЛицРесурсы = МетаданныеДокументыФизЛиц.Ресурсы;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеДокументыФизЛиц.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = МетаданныеДокументыФизЛиц.Измерения.Физлицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(ДокументыФизЛицРесурсы.Серия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Номер.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.ДатаВыдачи.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.СрокДействия.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КемВыдан.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.КодПодразделения.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.Представление.Имя);
	Поля.Добавить(ДокументыФизЛицРесурсы.УдалитьВидДокумента.Имя);
	ЭлементПДн.Поля = Поля;
	
	
	// Пользователи по реквизиту «ФизЛицо»
	МетаданныеПользователи = Метаданные.Справочники.Пользователи;
	СтандартныеРеквизиты = МетаданныеПользователи.СтандартныеРеквизиты;
	Реквизиты = МетаданныеПользователи.Реквизиты;
	КонтактнаяИнформацияРеквизиты = МетаданныеПользователи.ТабличныеЧасти.КонтактнаяИнформация.Реквизиты;
	
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = Реквизиты.ФизЛицо.ПолноеИмя();
	
	Поля = Новый Массив; // Массив из Строка
	Поля.Добавить(СтандартныеРеквизиты.Наименование.Имя);
	Поля.Добавить(Реквизиты.ПредставлениеВДокументах.ПолноеИмя());
	Поля.Добавить(Реквизиты.ПредставлениеВПереписке.ПолноеИмя());
	Поля.Добавить(Реквизиты.ПредставлениеВПерепискеСРангом.ПолноеИмя());
	Поля.Добавить(Реквизиты.Фотография.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "ЛичныеДанные";
	
	// Контактная информация физических лиц
	ЭлементПДн = ТаблицаСведений.Добавить();
	ЭлементПДн.Объект = МетаданныеПользователи.ПолноеИмя();
	ЭлементПДн.ПолеСубъект = СтандартныеРеквизиты.Ссылка.Имя;
	ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн);

	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, ОтказОтСкрытия) Экспорт
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередУничтожениемПерсональныхДанных
Процедура ПередУничтожениемПерсональныхДанных(Объект, Субъекты, ВыполнитьЗаписьОбъекта) Экспорт

	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
		Объект.Недействителен = Истина;
	КонецЕсли;

КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПослеУничтоженияПерсональныхДанных
Процедура ПослеУничтоженияПерсональныхДанных(Объект, Субъекты) Экспорт

	// Обновление адресной книги
	ТипыАК = Метаданные.Справочники.АдреснаяКнига.Реквизиты.Объект.Тип;
	Если ТипыАК.СодержитТип(ТипЗнч(Объект.Ссылка)) Тогда
		
		Справочники.АдреснаяКнига.ОбновитьДанныеОтображенияПодчиненногоОбъекта(Объект.Ссылка);
		
		Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
			
			СоставГруппыВсеПользователи = РаботаСПользователями.ПолучитьВсехПользователей();
			Справочники.АдреснаяКнига.РасширитьСписокПользователейРолями(СоставГруппыВсеПользователи, Ложь);
			Справочники.АдреснаяКнига.ОбновитьСписокПодчиненныхОбъектов(
				Справочники.РабочиеГруппы.ВсеПользователи,
				Неопределено,
				СоставГруппыВсеПользователи,
				Справочники.АдреснаяКнига.ПоРабочимГруппам);
				
			РегистрыСведений.ПоискВАдреснойКниге.ОбновитьСловаПоискаПоПользователю(Объект);
		
		КонецЕсли;

		РегистрыСведений.ПоискВАдреснойКниге.ОбновитьДоступностьВПоиске(Объект);
		
	КонецЕсли;
	
	// Приведем пользователя ИБ в соответствие пользователю
	Если ТипЗнч(Объект) = Тип("СправочникОбъект.Пользователи") Тогда
	
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
		Если ПользовательИБ <> Неопределено Тогда
			ПользовательИБ.Имя = Объект.Наименование;
			ПользовательИБ.ПолноеИмя = Объект.Наименование;
			ПользовательИБ.АдресЭлектроннойПочты = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Объект,
				Справочники.ВидыКонтактнойИнформации.EmailПользователя);
			
			ПользовательИБ.АутентификацияOpenID = Ложь;
			ПользовательИБ.АутентификацияOpenIDConnect = Ложь;
			ПользовательИБ.АутентификацияОС = Ложь;
			ПользовательИБ.АутентификацияСтандартная = Ложь;
			ПользовательИБ.АутентификацияТокеномДоступа = Ложь;
			ПользовательИБ.ПоказыватьВСпискеВыбора = Ложь;
			
			ПользовательИБ.Записать();
			
			РегистрыСведений.СведенияОПользователях.ОбновитьДанныеРегистра(Объект.Ссылка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПриРасчетеСроковХраненияПерсональныхДанных
Процедура ПриРасчетеСроковХраненияПерсональныхДанных(ДанныеСубъектов, СрокиХранения) Экспорт

	// Рассчитываем срок хранения ПДн с учетом наличия согласий на обработку
	// Если есть согласие, и в нем указан срок, берем этот срок. Если срок не указан - храним бессрочно.
	// Если после согласия есть отзыв, берем срок из него.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Субъект,
		|	&ДатаНеУничтожать КАК СрокХранения
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласияНаОбработкуПерсональныхДанных.СрезПоследних(, Субъект В (&Субъекты)) КАК
		|			СогласияНаОбработкуПерсональныхДанныхСрезПоследних
		|		ПО (ФизическиеЛица.Ссылка = СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект)
		|ГДЕ
		|	ФизическиеЛица.Ссылка В (&Субъекты)
		|	И СогласияНаОбработкуПерсональныхДанныхСрезПоследних.Субъект ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Субъекты", ДанныеСубъектов.ВыгрузитьКолонку("Субъект"));
	Запрос.УстановитьПараметр("ДатаНеУничтожать", ДатаНеУничтожать());
	
	ФизлицаИСрокиХранения = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ФизлицаИСрокиХранения Цикл
	
		НоваяСтрока = СрокиХранения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКонтактнуюИнформациюВТаблицуУничтожаемыхПДн(КонтактнаяИнформацияРеквизиты, ЭлементПДн)
	
	Поля = Новый Массив; // Массив из Строка 
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.ЗначенияПолей.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Значение.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.Представление.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.АдресЭП.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефона.ПолноеИмя());
	Поля.Добавить(КонтактнаяИнформацияРеквизиты.НомерТелефонаБезКодов.ПолноеИмя());
	ЭлементПДн.Поля = Поля;
	ЭлементПДн.КатегорияДанных = "КонтактнаяИнформация";
	
КонецПроцедуры

// Возвращаемое значение:
//  Дата
Функция ДатаНеУничтожать() Экспорт
	
	Возврат Дата(3999, 12, 31);
	
КонецФункции

#КонецОбласти
