#Область ПрограммныйИнтерфейс

// По части наименования формирует список для выбора ставки НДС.
//
// Параметры:
//  СтрокаПоиска - Строка - введенная с клавиатуры поисковая строка.
//  ДатаОтбор - Дата - дата, по которой отбираются доступные к выбору ставки НДС.
//
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.СтавкиНДС
//
Функция ДанныеВыбораСтавкиНДС(СтрокаПоиска = Неопределено, ДатаОтбор = Неопределено) Экспорт
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("Отбор");
	ПараметрыВыбора.Вставить("СтрокаПоиска", СтрокаПоиска);
	Если ЗначениеЗаполнено(ДатаОтбор) Тогда
		ПараметрыВыбора.Вставить("Дата", ДатаОтбор);
	КонецЕсли;
	
	ДанныеВыбора = Перечисления.СтавкиНДС.ПолучитьДанныеВыбора(ПараметрыВыбора);
	
	Возврат ДанныеВыбора;
	
КонецФункции

#КонецОбласти