#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Делает запись об изменившейся насторойке для текущего пользователя
Процедура ДобавитьЗапись(Пользователь, Настройка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписиИзмененныхНастроек = 
		РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом.СоздатьМенеджерЗаписи();
	МенеджерЗаписиИзмененныхНастроек.Пользователь = Пользователь;
	МенеджерЗаписиИзмененныхНастроек.Настройка = Настройка;
	МенеджерЗаписиИзмененныхНастроек.Граница = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МенеджерЗаписиИзмененныхНастроек.Записать();
	
КонецПроцедуры

#КонецЕсли
