
&НаКлиенте
Процедура РасшДОАМ_ВидДокументаПриИзмененииПосле(Элемент)
	Если Не ЗначениеЗаполнено(Запись.СрокДействия) Тогда
		ЗаполнитьСрокДействия();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокДействия()
	Если Не Запись.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПаспортРФ Тогда 
		Возврат;
	КонецЕсли;
	ДатаРождения = Запись.Физлицо.ДатаРождения;
	Если Не ЗначениеЗаполнено(ДатаРождения) Тогда 
		Возврат;
	КонецЕсли;
	
	Возраст = Год(ТекущаяДата()) - Год(ДатаРождения);
	Если Возраст<20 Тогда 
		СрокДействия = ДобавитьМесяц(ДатаРождения,240);
	ИначеЕсли Возраст>=20 И Возраст<45 Тогда 
		СрокДействия = ДобавитьМесяц(ДатаРождения,540);
	ИначеЕсли Возраст>=45 Тогда
		СрокДействия = Дата("39991231");
	КонецЕсли;
	Запись.СрокДействия = СрокДействия; 
КонецПроцедуры


