#Область ПрограммныйИнтерфейс

// Формирует сведения о загружаемом файле
// Параметры:
// СведенияОФайле - Файл, Структура - Загружаемый файл или структура с описанием файла
// Возвращаемое значение:
//  Структура:
//   *Представление - Строка - Имя файла с расширением
//   *Имя - Строка
//   *Расширение - Строка
//   *РасширениеБезТочки - Строка - расширение без "."
//
Функция СведенияОЗагружаемомКонтенте(СведенияОФайле) Экспорт

	ИмяФайла = СведенияОФайле.ИмяБезРасширения;
	Представление = СведенияОФайле.Имя;
	Расширение = СведенияОФайле.Расширение;
	РасширениеБезТочки = СтрЗаменить(Расширение, ".", "");

#Если МобильныйКлиент Тогда
	Если СтрНачинаетсяС(Нрег(СведенияОФайле.ПолноеИмя), "content") И ПустаяСтрока(Расширение) Тогда
		Если ТипЗнч(СведенияОФайле) = Тип("Структура") Тогда
			Файл = Новый Файл(СведенияОФайле.ПолноеИмя);
		Иначе
			Файл = СведенияОФайле;
		КонецЕсли;
		
		Представление = Файл.ПолучитьПредставлениеФайлаБиблиотекиМобильногоУстройства();
		ЧастиПредставления = СтрРазделить(Представление, ".");
		
		Если ЧастиПредставления.Количество() >1 Тогда
			ИндексПоследнегоЭлемента = ЧастиПредставления.ВГраница();
			РасширениеБезТочки = ЧастиПредставления[ИндексПоследнегоЭлемента];
			Расширение = СтрШаблон(".%1", РасширениеБезТочки);
			ЧастиПредставления.Удалить(ИндексПоследнегоЭлемента);
			ИмяФайла = СтрСоединить(ЧастиПредставления, ".");
		КонецЕсли;
	
	КонецЕсли;
#КонецЕсли

	//@skip-check structure-consructor-too-many-keys
	Возврат Новый Структура("Имя, Расширение, РасширениеБезТочки, Представление",
		ИмяФайла,
		Расширение,
		РасширениеБезТочки,
		Представление);

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти