
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФайлСсылка") И ЗначениеЗаполнено(Параметры.ФайлСсылка) Тогда 
		
		ФайлСсылка = Параметры.ФайлСсылка;
		
		ТекстСообщения = ВстроеннаяПочтаСервер.ПолучитьТекстПриглашения(ФайлСсылка);

	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтандартнымПриложением(Команда)
	
	ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайлаДляОткрытия(ФайлСсылка, Неопределено, 
		УникальныйИдентификатор);
	КомандыРаботыСФайламиКлиент.Открыть(ДанныеФайла, УникальныйИдентификатор);
	
	Закрыть();
	
КонецПроцедуры
