#Область ПрограммныйИнтерфейс

// Возвращает данные выбора получателя заявки по введенному тексту.
// 
// Параметры:
//  Текст - Строка
//  ЭтоДокумент - Булево
// 
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.Контрагенты, СправочникСсылка.Пользователи
//
Функция ДанныеВыбораПолучателя(Текст, ЭтоДокумент = Ложь) Экспорт
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 20
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Текст
		|	И НЕ Контрагенты.ПометкаУдаления";
	
	Если ЭтоДокумент Тогда
		ТекстЗапросаПользователи =
			"ВЫБРАТЬ ПЕРВЫЕ 20
			|	Пользователи.Ссылка
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Наименование ПОДОБНО &Текст
			|	И НЕ Пользователи.ПометкаУдаления";
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.ТекстОбъединитьВсе() + ТекстЗапросаПользователи;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + Символы.ПС + "АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Текст", "%" + Текст + "%");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат ДанныеВыбора;
	
КонецФункции

// Возвращает виды документов по связи "Авансовый отчет".
//
Функция ВидыДокументовПоСвязиАвансовыйОтчет(ВидДокументаЗаявкаНаОплату) Экспорт
	
	ВидыДокументов = Новый Массив;
	Документ = Новый Структура("ВидДокумента", ВидДокументаЗаявкаНаОплату);
	Настройки = СвязиДокументов.ПолучитьНастройкиСвязи(Документ);
	Для Каждого Настройка Из Настройки Цикл
		Если Настройка.ТипСвязи = Справочники.ТипыСвязей.АвансовыйОтчет 
			И Настройка.ТипСсылкаНа = "СправочникСсылка.ВнутренниеДокументы" Тогда
			ВидыДокументов.Добавить(Настройка.СсылкаНа);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВидыДокументов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти