
&НаСервере
Процедура РасшДОАМ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент 							= Элементы.Вставить("ВыводитьНаГлавной", Тип("ПолеФормы"), Элементы.ГлавнаяСтраница);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным				= "Объект.ВыводитьНаГлавной";
	НовыйЭлемент.Заголовок					= "Выводить на главной";

	НовыйЭлемент 							= Элементы.Вставить("ВыполнятьПоиск", Тип("ПолеФормы"), Элементы.ГлавнаяСтраница);
	НовыйЭлемент.Вид						= ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным				= "Объект.ВыполнятьПоиск";
	НовыйЭлемент.Заголовок					= "Выполнять поиск";

	НовыйЭлемент 							= Элементы.Вставить("ВыборСпискаЗначений", Тип("ДекорацияФормы"), Элементы.ГлавнаяСтраница);
	НовыйЭлемент.Вид						= ВидДекорацииФормы.Надпись;
	НовыйЭлемент.Заголовок					= ?(ЗначениеЗаполнено(Объект.НаборСвойств), "", "Возможность выбирать несколько значений");
	
КонецПроцедуры
