
&НаСервере
Функция РасшДОАМ_ПолучитьРасширенныеРеквизиты() Экспорт
	
	// выбираем свойства у которых пустой набор доп реквизитов
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.УникальныйКодДляПоля КАК ИмяПоля,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ТЗРеквизиты 		= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗРеквизиты;
	
КонецФункции
