
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ОбщегоНазначения.РазделениеВключено() Тогда
		
		Элементы.ГруппаПрефиксИЗапретРедактированияСтатейДДС.Видимость = Ложь;
		Элементы.ИспользоватьСВД.Видимость = Ложь;
		Элементы.ЯвляетсяСерверомСВД.Видимость = Ложь;
		
	Иначе
		
		Элементы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Доступность = 
			НаборКонстант.ИспользоватьСинхронизациюДанных;

		Элементы.ЗапретитьРедактированиеСтатейДвиженияДенежныхСредств.Доступность = 
			НаборКонстант.ИспользоватьСинхронизациюДанных;
		
		Элементы.ЗапретитьРедактированиеТоваровИУслуг.Доступность = 
			НаборКонстант.ИспользоватьСинхронизациюДанных;
			
	КонецЕсли;
		
	Элементы.ИспользоватьPushУведомления.Доступность = НаборКонстант.ИспользоватьМобильныеКлиенты;

	Элементы.Настроить.Доступность = 
		НаборКонстант.ИспользоватьМобильныеКлиенты И НаборКонстант.ИспользоватьPushУведомления;

	Элементы.НастроитьЭДО.Доступность = НаборКонстант.ИспользоватьОбменЭД;
	
	Элементы.ГруппаНастройкиОтчетностиВКО.Доступность = НаборКонстант.ИспользоватьОтчетностьВКонтролирующиеОрганы;
	
	ЭтоФайловаяБаза = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	АдресПубликацииНаВебСервере = НаборКонстант.АдресПубликацииНаВебСервере;
	
	Элементы.АдресПубликацииНаВебСервере.Доступность = НаборКонстант.ИспользоватьМобильныеКлиенты;
	
	Элементы.ВнешнийОбменВНовойВерсии.Доступность = НаборКонстант.МиграцияНаНовуюВерсию;
	Элементы.НастроитьМиграциюВНовуюВерсию.Доступность = НаборКонстант.МиграцияНаНовуюВерсию;
	
	Элементы.ГруппаМЭДОНастройки.Доступность = НаборКонстант.ИспользоватьМЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступностьМиграцииНаНовуюВерсию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НаборКонстант.ИспользоватьМЭДО Тогда 
		Опции = ВыключенныеОпцииОтКоторыхЗависитМЭДО();
		Если Опции <> "" Тогда
			ТекстПредупреждения = СтрШаблон(
				НСтр("ru = 'Одновременно с опцией ""МЭДО"" автоматически включаются другие необходимые для МЭДО опции:
				|%1'"),
				Опции);
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	
	Если ПараметрыЗаписи.Свойство("Закрыть") Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НаборКонстант.ИспользоватьМЭДО Тогда
		Если Не Константы.ИспользоватьГрифыДоступа.Получить() Тогда
			Константы.ИспользоватьГрифыДоступа.Установить(Истина);
		КонецЕсли;
		Если Не Константы.ИспользоватьСинхронизациюСИнтегрированнымиСистемами.Получить() Тогда
			Константы.ИспользоватьСинхронизациюСИнтегрированнымиСистемами.Установить(Истина);
		КонецЕсли;
		Если Не Константы.АвтовизуализацияЭП.Получить() Тогда
			Константы.АвтовизуализацияЭП.Установить(Истина);
		КонецЕсли;
		Если Не Константы.ИспользоватьЭлектронныеПодписи.Получить() Тогда
			Константы.ИспользоватьЭлектронныеПодписи.Установить(Истина);
		КонецЕсли;
		
		РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ВыполнениеОбменаМЭДО, Истина);
	Иначе
		РегламентныеЗаданияСервер.УстановитьИспользованиеРегламентногоЗадания(
			Метаданные.РегламентныеЗадания.ВыполнениеОбменаМЭДО, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьОбменДаннымиПриИзменении(Элемент)

	Элементы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Доступность = 
		НаборКонстант.ИспользоватьСинхронизациюДанных;

	Элементы.ЗапретитьРедактированиеСтатейДвиженияДенежныхСредств.Доступность = 
		НаборКонстант.ИспользоватьСинхронизациюДанных;
	Элементы.ЗапретитьРедактированиеТоваровИУслуг.Доступность = 
		НаборКонстант.ИспользоватьСинхронизациюДанных;
	
	Если НаборКонстант.ИспользоватьСинхронизациюДанных Тогда
		НаборКонстант.ЗапретитьРедактированиеСтатейДвиженияДенежныхСредств = Истина;
		НаборКонстант.ЗапретитьРедактированиеТоваровИУслуг = Истина;
	Иначе
		НаборКонстант.ЗапретитьРедактированиеСтатейДвиженияДенежныхСредств = Ложь;
		НаборКонстант.ЗапретитьРедактированиеТоваровИУслуг = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМобильныеКлиентыПриИзменении(Элемент)

	Если Не НаборКонстант.ИспользоватьМобильныеКлиенты Тогда
		НаборКонстант.ИспользоватьPushУведомления = Ложь;
	КонецЕсли;

	Элементы.ИспользоватьPushУведомления.Доступность = Ложь;
		//НаборКонстант.ИспользоватьМобильныеКлиенты;

	Элементы.Настроить.Доступность = Ложь;
		//НаборКонстант.ИспользоватьМобильныеКлиенты И НаборКонстант.ИспользоватьPushУведомления;

	Элементы.АдресПубликацииНаВебСервере.Доступность = НаборКонстант.ИспользоватьМобильныеКлиенты;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьМЭДОПриИзменении(Элемент)
	
	Элементы.ГруппаМЭДОНастройки.Доступность = НаборКонстант.ИспользоватьМЭДО;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьPushУведомленияПриИзменении(Элемент)

	Элементы.Настроить.Доступность = НаборКонстант.ИспользоватьPushУведомления;

КонецПроцедуры

&НаКлиенте
Процедура МиграцияНаНовуюВерсиюПриИзменении(Элемент)
	
	Записать();
	ОбновитьИнтерфейс();
	
	НастроитьВидимостьДоступностьМиграцииНаНовуюВерсию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настроить(Команда)

	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.НастройкаPushУведомлений",,
		ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура НастроитьЭДО(Команда,ПараметрыВыполненияКоманды)
	
	Записать();
	ОткрытьФорму("Обработка.ПанельАдминистрированияБЭД.Форма.ОбщиеНастройки",,
		ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура Настроить1СОтчетность(Команда)
	
	Записать();
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Раздел", ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Настройки"));
	
	ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность", ПараметрыОткрытия, ЭтотОбъект, "1С-Отчетность", , , , РежимОткрытияОкнаФормы.Независимый);
	
	Оповестить("Открытие формы 1С-Отчетность", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегистрациюВ1СДО30(Команда)
	
	Записать();
	
	Записать();
	ОткрытьФорму("Обработка.НастройкаПрограммы.Форма.РегистрацияЧерезДО30",,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьМиграциюВНовуюВерсию(Команда)
	
	ОткрытьФорму("Обработка.МиграцияДанныхИзВнешнихСистемМонитор.Форма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыключенныеОпцииОтКоторыхЗависитМЭДО()
	
	Опции = Новый Массив();
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа") Тогда
		Опции.Добавить(НСтр("ru = 'Грифы доступа'"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюСИнтегрированнымиСистемами") Тогда
		Опции.Добавить(НСтр("ru = 'Использовать синхронизацию с интегрированными системами'"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронныеПодписи") Тогда
		Опции.Добавить(НСтр("ru = 'Электронные подписи'"));
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("АвтовизуализацияЭП") Тогда
		Опции.Добавить(НСтр("ru = 'Вставлять штамп ЭП (автовизуализация ЭП)'"));
	КонецЕсли;
	
	Если Опции.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СтрСоединить(Опции, Символы.ПС);
	
КонецФункции

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	
	Если НаборКонстант.ИспользоватьСинхронизациюДанных Тогда
		НаборКонстант.ИспользоватьФоновоеВыполнениеЗадач = Истина;
		НаборКонстант.ИспользоватьФоновуюМаршрутизациюКомплексныхПроцессов = Истина;
	КонецЕсли;
	
	НаборКонстант.АдресПубликацииНаВебСервере = АдресПубликацииНаВебСервере;
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОбменЭДПриИзменении(Элемент)

	Элементы.НастроитьЭДО.Доступность = НаборКонстант.ИспользоватьОбменЭД;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтчетностьВКонтролирующиеОрганыПриИзменении(Элемент)
	
	Элементы.ГруппаНастройкиОтчетностиВКО.Доступность = НаборКонстант.ИспользоватьОтчетностьВКонтролирующиеОрганы;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступностьМиграцииНаНовуюВерсию()
	
	Элементы.ВнешнийОбменВНовойВерсии.Доступность = НаборКонстант.МиграцияНаНовуюВерсию;
	Элементы.НастроитьРегистрациюВ1СДО30.Доступность = НаборКонстант.МиграцияНаНовуюВерсию;
	
	Элементы.НастроитьМиграциюВНовуюВерсию.Доступность = НаборКонстант.МиграцияНаНовуюВерсию;
	
КонецПроцедуры

#КонецОбласти
