#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Регистрация к обмену всех объектов НСИ, если обмен был выключен и его включили.
	
	Если Значение <> Истина Тогда
		Возврат
	КонецЕсли;
	ПредыдущееЗначение = Константы.ИнтеграцияС1САрхивом.Получить();
	Если ПредыдущееЗначение = Истина Тогда
		Возврат
	КонецЕсли;
	
	УзелАрхив = ПланыОбмена.ОбменНСИСАрхивом.УзелАрхив();
	
	Если МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ОбменСАрхивом.СформироватьСообщениеОВерсииФормата();
	
	Для Каждого ЭлементСостава Из Метаданные.ПланыОбмена.ОбменНСИСАрхивом.Состав Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(УзелАрхив, ЭлементСостава.Метаданные);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли