// @strict-types


#Область ПрограммныйИнтерфейс

Функция ИмяЭлементаНадписьОбменВДругойВерсии() Экспорт
	
	Возврат "НадписьОбменВНовойВерсии";
	
КонецФункции

// Возвращает текст сообщения при блокировке обмена при миграции данных из 2.1
// 
// Возвращаемое значение:
// 	Строка - текст сообщения.
Функция ТекстСообщенияОБлокировкеПриМиграции() Экспорт
	
	Возврат НСтр("ru = 'Обмен по ЭДО производится в новой версии программы.'");
	
КонецФункции

// Текст декорации о блокировке при миграции.
// 
// Возвращаемое значение:
//  Строка
Функция ТекстДекорацииОБлокировкеПриМиграции() Экспорт
	
	Возврат НСтр("ru = 'Обмен с контрагентами по ЭДО выполняется и настраивается в новой версии программы. Действия по документу необходимо производить в новой версии программы.'");
	
КонецФункции

#КонецОбласти