#Область СлужебныйПрограммныйИнтерфейс

// Используется для инициализации параметра сеанса
// Определяет признак того, что клиентское приложение являеется мобильным клиентом
// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
// Параметры:
//  ИмяПараметра			- Строка
//  УстановленныеПараметры	- Массив из Строка
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт

	Если ИмяПараметра = "ЭтоМобильныйКлиент" Тогда
		ПараметрыСеанса.ЭтоМобильныйКлиент = МобильныйКлиентКлиентСервер.ЭтоМобильныйКлиент();
		УстановленныеПараметры.Добавить("ЭтоМобильныйКлиент");
	КонецЕсли;

КонецПроцедуры

// Добавляет обработчик инициализации параметра сеанса
// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт

	Обработчики.Вставить("ЭтоМобильныйКлиент", "МК_Служебный.УстановкаПараметровСеанса");

КонецПроцедуры

#КонецОбласти