
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
#Если Не МобильныйКлиент Тогда	

	ОткрытьФорму("Обработка.КартаМаршрутаБизнесПроцесса.Форма", 
		Новый Структура("БизнесПроцесс", ПараметрКоманды), 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
#Иначе
	
	Сообщение = НСтр("ru = 'Просмотр и редактирование графической схемы не поддерживается мобильным клиентом'");
	ПоказатьПредупреждение(, Сообщение);	
	
#КонецЕсли

КонецПроцедуры
