////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ РАБОТЫ С ФАЙЛАМИ
// 
//

#Область СлужебныйПрограммныйИнтерфейс

// Получает расположение штампа ЭП в pdf.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.МестаВставкиКартинки -
Функция РасположениеШтампаЭПВPdf() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.РасположениеШтампаЭПВPdf.Получить();
	
КонецФункции

// Возвращает константу СпособВставкиШтампаЭПВPDF
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СпособыВставкиШтампаЭПВPDF - Способ вставки штампа ЭПВPDF
Функция СпособВставкиШтампаЭПВPDF() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.СпособВставкиШтампаЭПВPDF.Получить();
	
КонецФункции

// Получает СписокРасширенийФайловOpenDocument
// 
// Возвращаемое значение:
//  Строка -
Функция ПолучитьСписокРасширенийФайловOpenDocument() Экспорт
	
	Возврат ФайловыеФункции.ПолучитьСписокРасширенийФайловOpenDocument();
	
КонецФункции

// Получает СписокРасширенийТекстовыхФайлов
// 
// Возвращаемое значение:
//  Строка -
Функция ПолучитьСписокРасширенийТекстовыхФайлов() Экспорт
	
	Возврат ФайловыеФункции.ПолучитьСписокРасширенийТекстовыхФайлов();
	
КонецФункции

// Вернет размер файлов на томе - в байтах
// 
// Параметры:
//  СсылкаТома - СправочникСсылка.ТомаХраненияФайлов -
// 
// Возвращаемое значение:
//  Число -
Функция ПодсчитатьРазмерФайловНаТоме(СсылкаТома) Экспорт
	
	Возврат ФайловыеФункции.ПодсчитатьРазмерФайловНаТоме(СсылкаТома);
	
КонецФункции

// Путь к программе конвертации PDF (ImageMagick). Кэширование константы
// 
// Возвращаемое значение:
//  Строка
Функция ПутьКПрограммеКонвертацииPDF() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ПутьКПрограммеКонвертацииPDF = Константы.ПутьКПрограммеКонвертацииPDF.Получить();
	
	Если ПустаяСтрока(ПутьКПрограммеКонвертацииPDF) Тогда

		ПутьКПрограммеКонвертацииPDF = "magick.exe"; // ImageMagick
		
		ТипПлатформыСервера = ОбщегоНазначенияДокументооборотПовтИсп.ТипПлатформыСервера();
		
		Если (ТипПлатформыСервера = ТипПлатформы.Linux_x86 
			Или ТипПлатформыСервера = ТипПлатформы.Linux_x86_64) Тогда
		
			ПутьКПрограммеКонвертацииPDF = "";
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ПутьКПрограммеКонвертацииPDF) Тогда
			Константы.ПутьКПрограммеКонвертацииPDF.Установить(ПутьКПрограммеКонвертацииPDF);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПутьКПрограммеКонвертацииPDF;
	
КонецФункции

#КонецОбласти