// @strict-types


#Область ПрограммныйИнтерфейс

// Возвращает параметры формы подписания данных для ДО
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** ДоверенностьСертификата - Строка 
//      ** ДоступныеДоверенностиСертификата - Строка
//      ** ВнешниеДоверенностиСертификатов - Строка
//      ** ВыводилиПредупреждениеНеУстановленыСертификатыЭП - Строка
//    * ИменаЭлементов - ФиксированнаяСтруктура:
//      ** Группы - ФиксированнаяСтруктура:
//        *** ГруппаМЧД - Строка
//      ** Элементы - ФиксированнаяСтруктура:
//        *** НадписьДоверенность - Строка
// 
Функция ПараметрыФормыПодписанияДанных() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("ДоверенностьСертификата", "ДоверенностьСертификата");
	ИменаРеквизитов.Вставить("ДоступныеДоверенностиСертификата", "ДоступныеДоверенностиСертификата");
	ИменаРеквизитов.Вставить("ВнешниеДоверенностиСертификатов", "ВнешниеДоверенностиСертификатов");
	ИменаРеквизитов.Вставить("ВыводилиПредупреждениеНеУстановленыСертификатыЭП",
		"ВыводилиПредупреждениеНеУстановленыСертификатыЭП");
	
	Группы = Новый Структура;
	Группы.Вставить("ГруппаМЧД", "ГруппаМЧД");
	
	Элементы = Новый Структура;
	Элементы.Вставить("НадписьДоверенность", "НадписьДоверенность");
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("Группы", Новый ФиксированнаяСтруктура(Группы));
	ИменаЭлементов.Вставить("Элементы", Новый ФиксированнаяСтруктура(Элементы));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	ПараметрыФормы.Вставить("ИменаЭлементов", Новый ФиксированнаяСтруктура(ИменаЭлементов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Возвращает параметры формы подписания данных для ДО
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** ВыводилиПредупреждениеНеУстановленыСертификатыЭП - Строка
// 
Функция ПараметрыФормыШифрованияДанных() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("ОбязательныеДляШифрованияСертификаты", "ОбязательныеДляШифрованияСертификаты");
	
	СертификатыШифрования = Новый Структура;
	СертификатыШифрования.Вставить("ИмяТаблицы", "СертификатыШифрования");
	СертификатыШифрования.Вставить("ОбязательныйДляШифрования", "ОбязательныйДляШифрования");
	ИменаРеквизитов.Вставить("СертификатыШифрования", Новый ФиксированнаяСтруктура(СертификатыШифрования));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Возвращает параметры формы расшифровки данных для ДО
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** ВыводилиПредупреждениеНеУстановленыСертификатыЭП - Строка
// 
Функция ПараметрыФормыРасшифровкиДанных() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("ВыводилиПредупреждениеНеУстановленыСертификатыЭП",
		"ВыводилиПредупреждениеНеУстановленыСертификатыЭП");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Возвращает параметры формы для отображения страниц сертификатов
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** ОписаниеДанныхСертификата - ФиксированнаяСтруктура:
//        *** ИмяТаблицы - Строка
//        *** Свойство - Строка
//        *** Значение - Строка
//    * ИменаЭлементов - ФиксированнаяСтруктура:
//      ** Страницы - ФиксированнаяСтруктура:
//        *** СтраницыСертификаты - Строка
//        *** СтраницаСертификат - Строка
//        *** СтраницаВыборСертификата - Строка
//      ** Группы - ФиксированнаяСтруктура:
//        *** ГруппаСертификатШапка - Строка
//        *** ГруппаОписаниеСертификата - Строка
//        *** ГруппаВыборСертификатаШапка - Строка
//      ** Элементы - ФиксированнаяСтруктура:
//        *** СертификатЗаголовок - Строка
//        *** СертификатЗаголовокОтступ - Строка
//        *** ОписаниеДанныхСертификата - Строка
//        *** ОписаниеДанныхСертификатаСвойство - Строка
//        *** ОписаниеДанныхСертификатаЗначение - Строка
//        *** ВыборСертификатаЗаголовок - Строка
//        *** ВыборСертификатаЗаголовокОтступ - Строка
//        *** СертификатСписокВыбора - Строка
//        *** СертификатСписокВыбораЗначение - Строка
//      ** Кнопки - ФиксированнаяСтруктура:
//        *** ПоказатьДанныеСертификата - Строка
//        *** ПоказатьДанныеСертификатаСписок - Строка
//    * ИменаКоманд - ФиксированнаяСтруктура:
//      ** ПоказатьДанныеСертификата - Строка 
// 
Функция ПараметрыФормыДляОтрображенияСертификатов() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	
	ОписаниеДанныхСертификата = Новый Структура;
	ОписаниеДанныхСертификата.Вставить("ИмяТаблицы", "ОписаниеДанныхСертификата");
	ОписаниеДанныхСертификата.Вставить("Свойство", "Свойство");
	ОписаниеДанныхСертификата.Вставить("Значение", "Значение");
	ИменаРеквизитов.Вставить("ОписаниеДанныхСертификата", Новый ФиксированнаяСтруктура(ОписаниеДанныхСертификата));
	
	Страницы = Новый Структура;
	Страницы.Вставить("СтраницыСертификаты", "СтраницыСертификаты");
	Страницы.Вставить("СтраницаСертификат", "СтраницаСертификат");
	Страницы.Вставить("СтраницаВыборСертификата", "СтраницаВыборСертификата");
	
	Группы = Новый Структура;
	Группы.Вставить("ГруппаСертификатШапка", "ГруппаСертификатШапка");
	Группы.Вставить("ГруппаОписаниеСертификата", "ГруппаОписаниеСертификата");
	Группы.Вставить("ГруппаВыборСертификатаШапка", "ГруппаВыборСертификатаШапка");
	
	Элементы = Новый Структура;
	Элементы.Вставить("СертификатЗаголовок", "СертификатЗаголовок");
	Элементы.Вставить("СертификатЗаголовокОтступ", "СертификатЗаголовокОтступ");
	Элементы.Вставить("ОписаниеДанныхСертификата", "ОписаниеДанныхСертификата");
	Элементы.Вставить("ОписаниеДанныхСертификатаСвойство", "ОписаниеДанныхСертификатаСвойство");
	Элементы.Вставить("ОписаниеДанныхСертификатаЗначение", "ОписаниеДанныхСертификатаЗначение");
	Элементы.Вставить("ВыборСертификатаЗаголовок", "ВыборСертификатаЗаголовок");
	Элементы.Вставить("ВыборСертификатаЗаголовокОтступ", "ВыборСертификатаЗаголовокОтступ");
	Элементы.Вставить("СертификатСписокВыбора", "СертификатСписокВыбора");
	Элементы.Вставить("СертификатСписокВыбораЗначение", "СертификатСписокВыбораЗначение");
	
	Кнопки = Новый Структура;
	Кнопки.Вставить("ПоказатьДанныеСертификата", "ПоказатьДанныеСертификата");
	Кнопки.Вставить("ПоказатьДанныеСертификатаСписок", "ПоказатьДанныеСертификатаСписок");
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("Страницы", Новый ФиксированнаяСтруктура(Страницы));
	ИменаЭлементов.Вставить("Группы", Новый ФиксированнаяСтруктура(Группы));
	ИменаЭлементов.Вставить("Элементы", Новый ФиксированнаяСтруктура(Элементы));
	ИменаЭлементов.Вставить("Кнопки", Новый ФиксированнаяСтруктура(Кнопки));
	
	ИменаКоманд = Новый Структура;
	ИменаКоманд.Вставить("ПоказатьДанныеСертификата", "ПоказатьДанныеСертификата");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	ПараметрыФормы.Вставить("ИменаЭлементов", Новый ФиксированнаяСтруктура(ИменаЭлементов));
	ПараметрыФормы.Вставить("ИменаКоманд", Новый ФиксированнаяСтруктура(ИменаКоманд));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Возвращает имя реквизита, содержащего имя события обработчика ожидания
// 
// Возвращаемое значение:
//  Строка - Имя реквизита события обработчика ожидания
Функция ИмяРеквизитаСобытияОбработчикаОжидания() Экспорт
	
	Возврат "СобытиеОбработчикаОжидания";
	
КонецФункции

// Параметры формы сертификата.
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** ОбязательныйДляШифрованияНачальноеЗначение - Строка - 
//    * ИменаЭлементов - ФиксированнаяСтруктура:
//      ** ОбязательныйДляШифрования - Строка - 
Функция ПараметрыФормыСертификата() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("ОбязательныйДляШифрованияНачальноеЗначение",
		"ОбязательныйДляШифрованияНачальноеЗначение");
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("ОбязательныйДляШифрования", "ОбязательныйДляШифрования");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	ПараметрыФормы.Вставить("ИменаЭлементов", Новый ФиксированнаяСтруктура(ИменаЭлементов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Параметры формы сертификатов и программ ЭП и шифрования
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** КолонкаСертификатДляШифрования - Строка
//      ** КолонкаСертификатДляШифрованияОтсутствует - Строка
//      ** ДействияПриОтправкеПоПочтеСЭП - Строка
//      ** ДействияПриСохраненииСЭП - Строка
//      ** СохранятьДоверенностиВместеСПодписью - Строка
//    * ИменаЭлементов - ФиксированнаяСтруктура:
//      ** КолонкаСертификатДляШифрования - Строка
//      ** ДействияПриОтправкеПоПочтеСЭП - Строка
//      ** СохранятьДоверенностиВместеСПодписью - Строка
//      ** ДействияПриСохраненииДанныхСЭП - Строка
Функция ПараметрыФормыСертификатовИПрограмм() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("КолонкаСертификатДляШифрования", "СертификатДляШифрования");
	ИменаРеквизитов.Вставить("КолонкаСертификатДляШифрованияОтсутствует", "СертификатДляШифрованияОтсутствует");
	ИменаРеквизитов.Вставить("ДействияПриОтправкеПоПочтеСЭП", "ДействияПриОтправкеПоПочтеСЭП");
	ИменаРеквизитов.Вставить("ДействияПриСохраненииСЭП", "ДействияПриСохраненииСЭПДокументооборот");
	ИменаРеквизитов.Вставить("СохранятьДоверенностиВместеСПодписью", "СохранятьДоверенностиВместеСПодписью");
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("КолонкаСертификатДляШифрования", "ПрограммыСертификатДляШифрования");
	ИменаЭлементов.Вставить("ДействияПриОтправкеПоПочтеСЭП", "ДействияПриОтправкеПоПочтеСЭП");
	ИменаЭлементов.Вставить("СохранятьДоверенностиВместеСПодписью", "СохранятьДоверенностиВместеСПодписью");
	ИменаЭлементов.Вставить("ДействияПриСохраненииДанныхСЭП", "ДействияПриСохраненииДанныхСЭП");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	ПараметрыФормы.Вставить("ИменаЭлементов", Новый ФиксированнаяСтруктура(ИменаЭлементов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

// Параметры формы сохранения вместе с ЭП
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура:
//    * ИменаРеквизитов - ФиксированнаяСтруктура:
//      ** КолонкаДоверенностьСсылка - Строка
//      ** КолонкаДоверенностьПредставление - Строка
//      ** КолонкаАдресДанныхВыгрузкиДоверенности - Строка
//      ** СохранятьДоверенность - Строка
//      ** СохранятьДоверенностьНачальноеЗначение - Строка
//    * ИменаЭлементов - ФиксированнаяСтруктура:
//      ** КолонкаДоверенностьПредставление - Строка
//      ** СохранятьДоверенность - Строка
Функция ПараметрыФормыСохраненияВместеСЭП() Экспорт
	
	ИменаРеквизитов = Новый Структура;
	ИменаРеквизитов.Вставить("КолонкаДоверенностьСсылка", "ДоверенностьСсылка");
	ИменаРеквизитов.Вставить("КолонкаДоверенностьПредставление", "ДоверенностьПредставление");
	ИменаРеквизитов.Вставить("КолонкаАдресДанныхВыгрузкиДоверенности", "АдресДанныхВыгрузкиДоверенности");
	ИменаРеквизитов.Вставить("СохранятьДоверенность", "СохранятьДоверенность");
	ИменаРеквизитов.Вставить("СохранятьДоверенностьНачальноеЗначение", "СохранятьДоверенностьНачальноеЗначение");
	
	ИменаЭлементов = Новый Структура;
	ИменаЭлементов.Вставить("КолонкаДоверенностьПредставление", "ДоверенностьПредставление");
	ИменаЭлементов.Вставить("СохранятьДоверенность", "СохранятьДоверенность");
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаРеквизитов", Новый ФиксированнаяСтруктура(ИменаРеквизитов));
	ПараметрыФормы.Вставить("ИменаЭлементов", Новый ФиксированнаяСтруктура(ИменаЭлементов));
	
	Возврат Новый ФиксированнаяСтруктура(ПараметрыФормы);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
