// @strict-types


#Область ПрограммныйИнтерфейс

#Область УчетныеЗаписиЭДО

// Вызывается при создании на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки учетной записи
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при чтении на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки учетной записи
//  ТекущийОбъект - РегистрСведенийМенеджерЗаписи
//
Процедура УчетнаяЗаписьЭДОПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка учетных записей ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура УчетнаяЗаписьЭДОФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.УчетнаяЗаписьЭДОФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеДокументыЭДО

// Вызывается при настройки видимости действий исходящего документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма);
	
КонецПроцедуры

// Вызывается при настройки видимости действий исходящего документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(Форма);
	
КонецПроцедуры

// Вызывается при определении доступных по ЭДО действий для документа ЭДО
// 
// Параметры:
//  СостояниеДокумента - ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние электронного документа.
//  СвойстваДокумента - ДокументОбъект.ЭлектронныйДокументВходящийЭДО, ДокументОбъект.ЭлектронныйДокументИсходящийЭДО, Структура - Свойства:
//    * Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
//    * НаОзнакомлении - Булево - Признак необходимости ознакомиться с электронным документом.
//    * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена электронным документом.
//    * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  Действия - Соответствие Из КлючИЗначение:
//    * Ключ - ПеречислениеСсылка.ДействияПоЭДО
//    * Значение - Булево
//
Процедура ПриОпределенииДействийДоступныхПоЭДО(Знач СостояниеДокумента, Знач СвойстваДокумента, Действия) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПриОпределенииДействийДоступныхПоЭДО(СостояниеДокумента, СвойстваДокумента, Действия);
	
КонецПроцедуры

// Вызывается при принудительном закрытии документа ЭДО
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
Процедура ПриПринудительномЗакрытииДокументаЭДО(ЭлектронныйДокумент) Экспорт
	
	ОбменСКонтрагентамиДО21.ПриПринудительномЗакрытииДокументаЭДО(ЭлектронныйДокумент);
	
КонецПроцедуры

// Вызывается после загрузки сообщения ЭДО по новому документу ЭДО
// 
// Параметры:
//  РезультатЗагрузкиСообщения - Структура - см. ЭлектронныеДокументыЭДО.НовыйРезультатЗагрузкиСообщения
Процедура ПослеЗагрузкиСообщенияЭДОНовогоЭлектронногоДокумента(РезультатЗагрузкиСообщения) Экспорт
	
	ОбменСКонтрагентамиДО21.ПослеЗагрузкиСообщенияЭДОНовогоЭлектронногоДокумента(РезультатЗагрузкиСообщения);
	
КонецПроцедуры

// После загрузки нового электронного документа.
// 
// Параметры:
// 	ЗагруженныйДокумент - См. ЭлектронныеДокументыЭДО.НовыеСведенияЗагруженногоДокумента
Процедура ПослеЗагрузкиНовогоЭлектронногоДокумента(ЗагруженныйДокумент) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

// Вызывается при создании на сервере формы настроек создания документов в ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ПравилаУчетаВидовЭДДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПравилаУчетаВидовЭДДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настроек отражения документов в ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(
		Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настроек отправки документов
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настройки отправки вида документа
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкаОтправкиВидаДокументаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.НастройкаОтправкиВидаДокументаПриСозданииНаСервере(
		Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка настроек ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура СписокНастроекЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.СписокНастроекЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеПоВходящимДокументамЭДО

// Вызывается при создании на сервере формы создания документов ДО по входящим ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура СозданиеПоВходящимЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.СозданиеПоВходящимЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при обновлении элементов выбранного документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура СозданиеПоВходящимЭДОПриОбновленииЭлементовПоВыбранномуДокументу(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.СозданиеПоВходящимЭДОПриОбновленииЭлементовПоВыбранномуДокументу(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаДокументовПоЭДО

// Вызывается при создании на сервере формы списка отправки документов по ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ОтправкаДокументовПоЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ОтправкаДокументовПоЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

// Вызывается при определении доступных действий по выбранным исходящим документам
// 
// Параметры:
//  ДанныеВыделенныхОбъектов см. ОбменСКонтрагентамиДОСлужебный.ДанныеВыделенныхИсходящихДокументов
//  ДоступныеДействия - Соответствие Из КлючИЗначение:
//    * Ключ - Строка - Действие по выбранным исходящим документам
//                      см. ОбменСКонтрагентамиДОСлужебныйКлиентСервер.ДействияСпискаИсходящихДокументов
//    * Значение - Булево - Истина, если действие для выбранных документов должно быть доступно.
//
Процедура ПриОпределенииДоступныхДействийПоВыбраннымИсходящим(Знач ДанныеВыделенныхОбъектов, ДоступныеДействия) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПриОпределенииДоступныхДействийПоВыбраннымИсходящим(
		ДанныеВыделенныхОбъектов, ДоступныеДействия);
	
КонецПроцедуры

// Вызывается при отображении данных выделенных исходящих ЭДО
// 
// Параметры:
//  Форма см. Обработка.ИнтерфейсДокументовЭДОДокументооборот.Форма.ОтправкаДокументовПоЭДО
//
Процедура ОтправкаДокументовПоЭДОПриОтображенииДанныхВыделенныхДокументов(Форма) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыДО

// Вызывается при установке видимости и доступности команд ЭДО для документов ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * ЕстьЭДО - Булево
//    * ПодписанЭДО - Булево
//    * ТипДокументаЭДО - ПеречислениеСсылка.ТипыДокументовЭДО
//    * НаправлениеЭДО - ПеречислениеСсылка.НаправленияЭДО
//    * СостояниеПоЭДО - ПеречислениеСсылка.СостоянияЭДОДокументооборот
//    * ДоступнаКорректировкаЭД - Булево
//    * ИдентификаторПакетаЭДО - УникальныйИдентификатор
//    * МожноМенятьПакетЭДО - Булево
//    * ПоддерживаетсяПакетнаяОбработкаЭДО - Булево
//    * ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
//                                      Документ ЭДО, связанный с документом ДО на форме
//    * ПакетЭДОНеОтражен - Булево
//    * УчетнаяЗаписьЭДО - Строка - Идентификатор учетной записи, которой будет обменян документ
//    * СертификатыДляЭДО - ТаблицаЗначений:
//      ** ДоступенДляЭДО - Булево
//      ** Отпечаток - Строка
//      ** Доверенность - ОпределяемыйТип.МашиночитаемаяДоверенность
//      ** ДоступенНаКлиенте - Булево
//      ** ДоступенНаСервере - Булево
//  ОписаниеКоманд - см. ИнтерфейсЭДОДокументооборот.НовоеОписаниеКомандЭДО
//
Процедура ПриУстановкеВидимостиДоступностиКомандЭДО(Форма, ОписаниеКоманд) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПриУстановкеВидимостиДоступностиКомандЭДО(Форма, ОписаниеКоманд);
	
КонецПроцедуры

// Вызывается при установке видимости по ЭДО в форме просмотра файла или пакета по ЭДО
// 
// Параметры:
//  Форма - см. Обработка.ИнтерфейсДокументовЭДОДокументооборот.Форма.ПросмотрФайлаПакетаЭДО
//
Процедура ПросмотрФайлаПакетаЭДОПриУстановкеВидимостиПоЭДО(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПросмотрФайлаПакетаЭДОПриУстановкеВидимостиПоЭДО(Форма);
	
КонецПроцедуры

// Вызывается при установке видимости по ЭДО в карточке документа предприятия
// 
// Параметры:
//  Форма - см. Справочник.ВнутренниеДокументы.Форма.ФормаЭлемента
//
Процедура ДокументДОПриУстановкеВидимостиПоЭДО(Форма) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ДокументДОПриУстановкеВидимостиПоЭДО(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументовЭДО

// Вызывается при создании на сервере формы текущих дел ЭДО
// 
// Параметры:
//  Форма - см. Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентыеЗадания

// При получении запроса на обновление словаря сопоставления номенклатуры БЭД.
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаНаОбновлениеСловаряСопоставленияНоменклатурыБЭД(Запрос) Экспорт
	
	
КонецПроцедуры

// При получении запроса на пометку на удаление устаревших траспортных контейнеров ЭДО
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаДляПометкиНаУдалениеТранспортныхКонтейнеровЭДО(Запрос) Экспорт
	
	
КонецПроцедуры

// Перед регламентной проверкой наличия новых документов в сервисе ЭДО.
// 
// Параметры:
//  УчетныеЗаписиЭДО - Неопределено, Массив Из Строка - Учетные записи ЭДО, по которым необходимо проверить
//                                                      наличие новых документов.
//                                                      Неопределено - отбора не будет.
//                                                      Массив - будет отбор по учетным записям в массиве.
//
Процедура ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО);
	
КонецПроцедуры

// Перед автоматическим созданием документов ДО по входящим ЭДО.
// 
// Параметры:
//  ДокументыКОбработке - Массив Из ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документы ЭДО к обработке
//
Процедура ПередАвтоматическимСозданиемДокументовДОПоВходящимЭДО(ДокументыКОбработке) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередАвтоматическимСозданиемДокументовДОПоВходящимЭДО(ДокументыКОбработке);
	
КонецПроцедуры

// Перед созданием объектов ЭДО по документу ДО.
// 
// Параметры:
//  ПараметрыФормирования - см. ОбменСКонтрагентамиДОСлужебныйКлиентСервер.НовыеПараметрыФормированияЭДПоДокументамДО
//  ДокументыКСозданиюОбъектовЭДО - Массив Из ОпределяемыйТип.ДокументДОДляЭДО
//
Процедура ПередСозданиемОбъектовЭДОПоДокументамДО(ПараметрыФормирования, ДокументыКСозданиюОбъектовЭДО) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередСозданиемОбъектовЭДОПоДокументамДО(
		ПараметрыФормирования, ДокументыКСозданиюОбъектовЭДО);
	
КонецПроцедуры

// При получении запроса непроверенных контрагентов.
// 
// Параметры:
//  Запрос - Запрос
//
Процедура ПриПолученииЗапросаНепроверенныхКонтрагентов(Запрос) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

// Вызывается перед проверкой контрагента в сервисе 1С-ЭДО при записи контрагента
// 
// Параметры:
//  Источник - СправочникОбъект.Контрагенты
//  Отказ - Булево
//  ПроводитьПроверку - Булево
//
Процедура ПередПроверкойКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ, ПроводитьПроверку) Экспорт
	
	ОбменСКонтрагентамиДОМиграция.ПередПроверкойКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ, ПроводитьПроверку);
	
КонецПроцедуры

// Вызвается после получения данных для синхронизации ЭДО
// 
// Параметры:
//  ДанныеДляСинхронизации см. СинхронизацияЭДОСлужебный.ДанныеДляСинхронизации
//  КонтекстДиагностики см. ОбработкаНеисправностейБЭД.НовыйКонтекстДиагностики
//  ПереданыУчетныеЗаписи - Булево - Переданы ли учетные записи для получения данных для синхронизации
//
Процедура ПослеПолученияДанныхДляСинхронизацииЭДО(
		ДанныеДляСинхронизации,
		КонтекстДиагностики,
		Знач ПереданыУчетныеЗаписи) Экспорт
	
	
КонецПроцедуры

#КонецОбласти
