// Возвращает Право доступа к Карточке контрагента.
//
// Параметры:
//  СсылкаПользователь - ПараметрыСеанса.ТекущийПользователь - Пользователь для проверки доступа.
// 
// Возвращаемое значение:
//  Логическое - Дать доступ или нет.
//
&НаСервере
Функция ПолучитьПравоДоступаККарточкеКонтрагента(СсылкаПользователь, Объект) Экспорт // 2025-05
	////  заметка по экспорту - https://dzen.ru/a/Y94yCYcNIA0oHidt
	
	РезультатПроверкиКарточкиКонтрагентов = Ложь;
	
	
	Если СсылкаПользователь = Неопределено Тогда
		СсылкаПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;		
	
	СведенияПользователя = РегистрыСведений.СведенияОПользователяхДокументооборот.Получить(
		Новый Структура("Пользователь", СсылкаПользователь));
	Попытка
		СведенияПользователя.Подразделение.Уровень();
	Исключение
		// ОТЛАДКА
		СсылкаДОАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ДОАМ", Истина);
		СведенияПользователя.Подразделение = СсылкаДОАМ;
	КонецПопытки;
	
	
	Если СведенияПользователя.Подразделение.Уровень() = 0 Тогда
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение;
	Иначе // Каждая "точка" блокирует таблицу
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение.Родитель;
	КонецЕсли;

	////ПодразделениеКарточки = Объект.Ответственный.Подразделение; // Каждая "точка" блокирует таблицу
	ПодразделениеКарточки = РаботаСПользователями.ПолучитьПодразделение(Объект.Ответственный);
	
	////ПодразделенияРуководителя = Справочники.СтруктураПредприятия.ПодчиненныеПодразделения(Объект.Ответственный);
	////Для Каждого ЭлементМассива из ПодразделенияРуководителя Цикл
	////	Если ЭлементМассива.Код = ПодразделениеКарточки.Код Тогда
	////		РезультатПроверкиКарточкиКонтрагентов = Истина;	
	////	КонецЕсли;	
	////КонецЦикла;
	
	Если РольДоступна("АдминистраторСистемы") Тогда // ОТЛАДКА
		Сообщить("[doc8.3] " + ПодразделениеКарточки
			+ ?(ПодразделениеКарточки.Уровень() >= СведенияПользователя.Подразделение.Уровень(), 
				" на одном уровне", " выше уровня") + " с " + СведенияПользователя.Подразделение
			+ ", в котором состоит " + СсылкаПользователь.ПредставлениеВПерепискеСРангом);	
	КонецЕсли;
	
	
	СсылкаОВП = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОВП", Истина);
	СсылкаОПАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОПАМ", Истина);
	//// Справочники.СтруктураПредприятия.ВыбратьИерархически(<Родитель>, <Владелец>, <Отбор>, <Порядок>)
	//Выборка = Справочники.СтруктураПредприятия.ВыбратьИерархически(ПодразделениеРуководителяПользователя);
	//Пока Выборка.Следующий() Цикл
	//	ПодразделениеВыбоки = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Выборка);
	//	Сообщить("[doc8.3] " + "" + ПодразделениеВыбоки.Уровень()); 
	
	Если ПодразделениеКарточки.ПринадлежитЭлементу(ПодразделениеРуководителяПользователя) Тогда
		
		Если СведенияПользователя.Подразделение.Уровень() = 0
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель департамента") Тогда
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ПодразделениеКарточки.Родитель.Код = СсылкаОПАМ.Код // 1 = ОПАМ
		И ( ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код
			Или СведенияПользователя.Подразделение.Код = СсылкаОПАМ.Код ) Тогда // Письмо от 2024-12-24
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
			Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код )
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
		Или ПодразделениеКарточки.Код = СведенияПользователя.Подразделение.Код
			И ( СтрНайти(НРег(СведенияПользователя.Должность), "заместитель руководителя")
			Или СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения") ) Тогда
		
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
	Иначе
		Если ПодразделениеКарточки.Код = ПодразделениеРуководителяПользователя.Код
			И ПодразделениеРуководителяПользователя.Уровень() <= 1 Тогда // Письмо от 2024-12-24
			
			Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
				Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код )
				И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
				//И ( ПодразделениеРуководителяПользователя.Код = СсылкаДОАМ.Код // 0 = ДОАМ
				//	Или ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код ) // 1 = ОВП
			Или ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код Тогда
				
				РезультатПроверкиКарточкиКонтрагентов = Истина;
	//			Прервать;
			
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//	Продолжить;
	//КонецЦикла;
	//Выборка = Неопределено;	
	
	
	Возврат РезультатПроверкиКарточкиКонтрагентов;
	
КонецФункции

&НаСервере
Функция РасшДОАМ_ПолучитьРасширенныеРеквизиты() Экспорт
	
	// выбираем свойства у которых пустой набор доп реквизитов
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.УникальныйКодДляПоля КАК ИмяПоля,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ТЗРеквизиты 		= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗРеквизиты;
	
КонецФункции
