// Возвращает Право доступа к Карточке контрагента.
//
// Параметры:
//  СсылкаПользователь - ПараметрыСеанса.ТекущийПользователь - Пользователь для проверки доступа.
// 
// Возвращаемое значение:
//  Логическое - Дать доступ или нет.
//
&НаСервере
Функция Расш_ПолучитьПравоДоступаККарточкеКонтрагента(СсылкаПользователь, Объект) Экспорт // 2025-05
	////  заметка по экспорту - https://dzen.ru/a/Y94yCYcNIA0oHidt
	
	РезультатПроверкиКарточкиКонтрагентов = Ложь;
	
	
	Если СсылкаПользователь = Неопределено Тогда
		СсылкаПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;		
	
	////ПодразделениеКарточки = Объект.Ответственный.Подразделение; // Каждая "точка" блокирует таблицу
	ПодразделениеКарточки = РаботаСПользователями.ПолучитьПодразделение(Объект.Ответственный);
	
	////ПодразделенияРуководителя = Справочники.СтруктураПредприятия.ПодчиненныеПодразделения(Объект.Ответственный);
	////Для Каждого ЭлементМассива из ПодразделенияРуководителя Цикл
	////	Если ЭлементМассива.Код = ПодразделениеКарточки.Код Тогда
	////		РезультатПроверкиКарточкиКонтрагентов = Истина;	
	////	КонецЕсли;	
	////КонецЦикла;
	
	
	СведенияПользователя = РегистрыСведений.СведенияОПользователяхДокументооборот.Получить(
		Новый Структура("Пользователь", СсылкаПользователь));
	Если ОбщегоНазначения.СсылкаСуществует(ПодразделениеКарточки) Тогда
		ПодразделениеКарточки.Уровень();
	Иначе
		СсылкаДОАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ДОАМ", Истина);
		ПодразделениеКарточки = СведенияПользователя.Подразделение;
		Если НЕ ОбщегоНазначения.СсылкаСуществует(СведенияПользователя.Подразделение) Тогда // ЗначениеЗаполнено(
			СведенияПользователя.Подразделение = СсылкаДОАМ;
		КонецЕсли;
	КонецЕсли;	
	
	Если СведенияПользователя.Подразделение.Уровень() = 0 Тогда
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение;
		Если ПодразделениеКарточки = ПодразделениеРуководителяПользователя Тогда // DOAM 2026-05
        	РезультатПроверкиКарточкиКонтрагентов = Истина;	
		КонецЕсли;	
	Иначе // Каждая "точка" блокирует таблицу
		ПодразделениеРуководителяПользователя = СведенияПользователя.Подразделение.Родитель;
	КонецЕсли;
	
	Если РольДоступна("АдминистраторСистемы") 
		Или ОбщегоНазначения.РежимОтладки() Тогда // ОТЛАДКА
		
		Попытка
			РангКарточки = Строка(ПодразделениеКарточки) + " "
				+ ?(ПодразделениеКарточки.Уровень() >= СведенияПользователя.Подразделение.Уровень(), "на одном уровне", "выше уровня");
		Исключение
			Если РольДоступна("ПолныеПрава") Тогда // ОТЛАДКА ОШИБКИ
				Возврат Истина;
			КонецЕсли;
		КонецПопытки;
		
		// https://infostart.ru/1c/articles/1004554/  https://its.1c.ru/db/v8std/content/418/hdoc
		ОбщегоНазначения.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '[doc8.3] карточка %1 с %2, в котором состоит %3'"), РангКарточки,
			СведенияПользователя.Подразделение, СсылкаПользователь.ПредставлениеВПерепискеСРангом));
	КонецЕсли;
	
	СсылкаОКМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОКМ", Истина); // 2025-11-14
	СсылкаОВП = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОВП", Истина);
	СсылкаОПАМ = Справочники.СтруктураПредприятия.НайтиПоНаименованию("ОПАМ", Истина);
	//// Справочники.СтруктураПредприятия.ВыбратьИерархически(<Родитель>, <Владелец>, <Отбор>, <Порядок>)
	//Выборка = Справочники.СтруктураПредприятия.ВыбратьИерархически(ПодразделениеРуководителяПользователя);
	//Пока Выборка.Следующий() Цикл
	//	ПодразделениеВыбоки = Справочники.СтруктураПредприятия.НайтиПоНаименованию(Выборка);
	//  #Если Клиент Тогда // ФОРМА
	//	ПоказатьОповещениеПользователя("[doc8.3] " + "" + ПодразделениеВыбоки.Уровень()); 
	//  #КонецЕсли
	
	Если ПодразделениеКарточки.ПринадлежитЭлементу(ПодразделениеРуководителяПользователя) Тогда
		
		Если СведенияПользователя.Подразделение.Уровень() = 0
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель департамента") Тогда
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ПодразделениеКарточки.Родитель.Код = СсылкаОПАМ.Код // 1 = ОПАМ
		И ( ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код
			Или СведенияПользователя.Подразделение.Код = СсылкаОПАМ.Код ) Тогда // Письмо от 2024-12-24
			
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
		Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
			Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код
			Или СведенияПользователя.Подразделение.Код = СсылкаОКМ.Код ) // DOAM 2025-11
			И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
		Или ПодразделениеКарточки.Код = СведенияПользователя.Подразделение.Код
			И ( СтрНайти(НРег(СведенияПользователя.Должность), "заместитель руководителя")
			Или СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения") ) Тогда
		
			РезультатПроверкиКарточкиКонтрагентов = Истина;
			
		КонецЕсли;
		
	Иначе
		Если ПодразделениеКарточки.Код = ПодразделениеРуководителяПользователя.Код
			И ПодразделениеРуководителяПользователя.Уровень() <= 1 Тогда // Письмо от 2024-12-24
			
			Если ( ПодразделениеРуководителяПользователя.Код = СсылкаОВП.Код // 1 = ОВП
				Или СведенияПользователя.Подразделение.Код = СсылкаОВП.Код
				Или СведенияПользователя.Подразделение.Код = СсылкаОКМ.Код ) // DOAM 2025-11
				И СтрНайти(НРег(СведенияПользователя.Должность), "руководитель подразделения")
			Или ПодразделениеРуководителяПользователя.Код = СсылкаОПАМ.Код Тогда
				
				РезультатПроверкиКарточкиКонтрагентов = Истина;
	//			Прервать;
			
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	//	Продолжить;
	//КонецЦикла;
	//Выборка = Неопределено;	
	
	
	Возврат РезультатПроверкиКарточкиКонтрагентов;
	
КонецФункции

&НаСервере
Функция РасшДОАМ_ПолучитьРасширенныеРеквизиты() Экспорт
	
	// выбираем свойства у которых пустой набор доп реквизитов
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
	|	ДополнительныеРеквизитыИСведения.Наименование,
	|	ДополнительныеРеквизитыИСведения.УникальныйКодДляПоля КАК ИмяПоля,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения,
	|	ДополнительныеРеквизитыИСведения.ЗаполнятьОбязательно
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.НаборСвойств = &НаборСвойств";	
	Запрос.УстановитьПараметр("НаборСвойств", НаборСвойств);	
	РезультатЗапроса 	= Запрос.Выполнить();	
	ТЗРеквизиты 		= РезультатЗапроса.Выгрузить();
	
	Возврат ТЗРеквизиты;
	
КонецФункции
