// @strict-types


#Область ПрограммныйИнтерфейс

#Область УчетныеЗаписиЭДО

// Вызывается при создании на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма карточки учетной записи
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
Процедура УчетнаяЗаписьЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка учетных записей ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура УчетнаяЗаписьЭДОФормаСпискаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	СписокУчетныхЗаписейЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеДокументыЭДО

// Вызывается при создании на сервере карточки учетной записи ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ЭлектронныйДокументИсходящийЭДОПриНастройкеВидимостиДействий(Форма) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокументИсходящийЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при настройки видимости действий исходящего документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура ЭлектронныйДокументВходящийЭДОПриНастройкеВидимостиДействий(Форма) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныйДокументВходящийЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при определении доступных по ЭДО действий для документа ЭДО
// 
// Параметры:
//  СостояниеДокумента - ПеречислениеСсылка.СостоянияДокументовЭДО - Состояние электронного документа.
//  СвойстваДокумента - ДокументОбъект.ЭлектронныйДокументВходящийЭДО, ДокументОбъект.ЭлектронныйДокументИсходящийЭДО, Структура - Свойства:
//    * Ссылка - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО - Ссылка на электронный документ.
//    * НаОзнакомлении - Булево - Признак необходимости ознакомиться с электронным документом.
//    * СпособОбмена - ПеречислениеСсылка.СпособыОбменаЭД - Способ обмена электронным документом.
//    * ВидДокумента - СправочникСсылка.ВидыДокументовЭДО
//  Действия - Соответствие Из КлючИЗначение:
//    * Ключ - ПеречислениеСсылка.ДействияПоЭДО
//    * Значение - Булево
//
Процедура ПриОпределенииДействийДоступныхПоЭДО(Знач СостояниеДокумента, Знач СвойстваДокумента, Действия) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	// Если по миграции у нас обмен продолжается в прошлой версии, то действия нельзя выполнять ни для какого документа
	Действия.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

// Вызывается при создании на сервере формы настроек создания документов в ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ПравилаУчетаВидовЭДДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ПравилаУчетаВидовЭДДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настроек отражения документов в ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтраженияДокументовВУчетеПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтраженияДокументовВУчетеУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настроек отправки документов
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкиОтправкиДокументовПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиОтправкиДокументовУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы настройки отправки вида документа
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура НастройкаОтправкиВидаДокументаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОтправкиВидаДокументаУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при создании на сервере формы списка настроек ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура СписокНастроекЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	СписокНастроекЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеПоВходящимДокументамЭДО

// Вызывается при создании на сервере формы создания документов ДО по входящим ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура СозданиеПоВходящимЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	СозданиеПоВходящимЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при обновлении элементов выбранного документа ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//
Процедура СозданиеПоВходящимЭДОПриОбновленииЭлементовПоВыбранномуДокументу(Форма) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	СозданиеПоВходящимЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаДокументовПоЭДО

// Вызывается при создании на сервере формы списка отправки документов по ЭДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ОтправкаДокументовПоЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ОтправкаДокументовПоЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при определении доступных действий по выбранным исходящим документам
// 
// Параметры:
//  ДанныеВыделенныхОбъектов см. ОбменСКонтрагентамиДОСлужебный.ДанныеВыделенныхИсходящихДокументов
//  ДоступныеДействия - Соответствие Из КлючИЗначение:
//    * Ключ - Строка - Действие по выбранным исходящим документам
//                      см. ОбменСКонтрагентамиДОСлужебныйКлиентСервер.ДействияСпискаИсходящихДокументов
//    * Значение - Булево - Истина, если действие для выбранных документов должно быть доступно.
//
Процедура ПриОпределенииДоступныхДействийПоВыбраннымИсходящим(Знач ДанныеВыделенныхОбъектов, ДоступныеДействия) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеДействия.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыДО

// Вызывается при установке видимости и доступности команд ЭДО для документов ДО
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения:
//    * ЕстьЭДО - Булево
//    * ПодписанЭДО - Булево
//    * ТипДокументаЭДО - ПеречислениеСсылка.ТипыДокументовЭДО
//    * НаправлениеЭДО - ПеречислениеСсылка.НаправленияЭДО
//    * СостояниеПоЭДО - ПеречислениеСсылка.СостоянияЭДОДокументооборот
//    * ДоступнаКорректировкаЭД - Булево
//    * ИдентификаторПакетаЭДО - УникальныйИдентификатор
//    * МожноМенятьПакетЭДО - Булево
//    * ПоддерживаетсяПакетнаяОбработкаЭДО - Булево
//    * ДокументЭДО - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
//                                      Документ ЭДО, связанный с документом ДО на форме
//    * ПакетЭДОНеОтражен - Булево
//    * УчетнаяЗаписьЭДО - Строка - Идентификатор учетной записи, которой будет обменян документ
//    * СертификатыДляЭДО - ТаблицаЗначений:
//      ** ДоступенДляЭДО - Булево
//      ** Отпечаток - Строка
//      ** Доверенность - СправочникСсылка.МашиночитаемыеДоверенностиОрганизаций
//      ** ДоступенНаКлиенте - Булево
//      ** ДоступенНаСервере - Булево
//  ОписаниеКоманд - см. ИнтерфейсЭДОДокументооборот.НовоеОписаниеКомандЭДО
//
Процедура ПриУстановкеВидимостиДоступностиКомандЭДО(Форма, ОписаниеКоманд) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	СкрытьНедоступныеКомандыЭДО(Форма, ОписаниеКоманд);
	
КонецПроцедуры

// Вызывается при установке видимости по ЭДО в форме просмотра файла или пакета по ЭДО
// 
// Параметры:
//  Форма - см. Обработка.ИнтерфейсДокументовЭДОДокументооборот.Форма.ПросмотрФайлаПакетаЭДО
//
Процедура ПросмотрФайлаПакетаЭДОПриУстановкеВидимостиПоЭДО(Форма) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ПросмотрФайлаПакетаЭДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

// Вызывается при установке видимости по ЭДО в карточке документа предприятия
// 
// Параметры:
//  Форма - см. Справочник.ВнутренниеДокументы.Форма.ФормаЭлемента
//
Процедура ДокументДОПриУстановкеВидимостиПоЭДО(Форма) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументДОУстановитьВидимостьДоступность(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументовЭДО

// Вызывается при создании на сервере формы текущих дел ЭДО
// 
// Параметры:
//  Форма - см. Обработка.ИнтерфейсДокументовЭДО.Форма.ТекущиеДелаПоЭДО
//  Отказ - Булево
//  СтандартнаяОбработка - Булево
//
Процедура ТекущиеДелаЭДОПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДелаЭДОУстановитьВидимостьДоступность(Форма);
	ТекущиеДелаЭДОУстановитьНедоступныеКоманды(Форма);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентыеЗадания

// Перед регламентной проверкой наличия новых документов в сервисе ЭДО.
// 
// Параметры:
//  УчетныеЗаписиЭДО - Неопределено, Массив Из Строка - Учетные записи ЭДО, по которым необходимо проверить
//                                                      наличие новых документов.
//                                                      Неопределено - отбора не будет.
//                                                      Массив - будет отбор по учетным записям в массиве.
//
Процедура ПередРегламентнойПроверкойНаличияНовыхДокументовВСервисеЭДО(УчетныеЗаписиЭДО) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	// Если блокирован обмен с внешними ресурсами, то проверку не проводим вообще не по каким учеткам.
	УчетныеЗаписиЭДО = Новый Массив();
	
КонецПроцедуры

// Перед автоматическим созданием документов ДО по входящим ЭДО.
// 
// Параметры:
//  ДокументыКОбработке - Массив Из ДокументСсылка.ЭлектронныйДокументВходящийЭДО - Документы ЭДО к обработке
//
Процедура ПередАвтоматическимСозданиемДокументовДОПоВходящимЭДО(ДокументыКОбработке) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКОбработке.Очистить();
	
КонецПроцедуры

// Перед созданием объектов ЭДО по документу ДО.
// 
// Параметры:
//  ПараметрыФормирования - см. ОбменСКонтрагентамиДОСлужебныйКлиентСервер.НовыеПараметрыФормированияЭДПоДокументамДО
//  ДокументыКСозданиюОбъектовЭДО - Массив Из ОпределяемыйТип.ДокументДОДляЭДО
//
Процедура ПередСозданиемОбъектовЭДОПоДокументамДО(ПараметрыФормирования, ДокументыКСозданиюОбъектовЭДО) Экспорт
	
	Если Не МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыКСозданиюОбъектовЭДО.Очистить();
	
КонецПроцедуры

#КонецОбласти

// Вызывается перед проверкой контрагента в сервисе 1С-ЭДО при записи контрагента
// 
// Параметры:
//  Источник - СправочникОбъект.Контрагенты
//  Отказ - Булево
//  ПроводитьПроверку - Булево
//
Процедура ПередПроверкойКонтрагентаВ1СЭДОПриЗаписи(Источник, Отказ, ПроводитьПроверку) Экспорт
	
	Если МиграцияДанныхИзВнешнихСистемСервер.БлокироватьОбменСВнешнимиРесурсами() Тогда
		ПроводитьПроверку = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, Заголовок, СледующийЭлемент)
	
	ИмяЭлемента = ОбменСКонтрагентамиДОМиграцияКлиентСервер.ИмяЭлементаНадписьОбменВДругойВерсии();
	
	Элемент = Форма.Элементы.Найти(ИмяЭлемента);
	Если Элемент = Неопределено Тогда
		Элемент = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"),
			Форма, СледующийЭлемент);
	КонецЕсли;
	
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Заголовок;
	Элемент.ЦветФона = ЦветаСтиля.ОтсутствиеЦветФона;
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.АвтоМаксимальнаяШирина = Ложь;
	
КонецПроцедуры

#Область УчетныеЗаписиЭДО

Процедура УчетнаяЗаписьЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ИзменитьАдресОрганизации.Доступность = Ложь;
	Элементы.ИзменитьКодНалоговогоОргана.Доступность = Ложь;
	Элементы.ФормаПроверкаУчетнойЗаписи.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

Процедура СписокУчетныхЗаписейЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.СоздатьОбменЧерезСервисЭДО.Доступность = Ложь;
	Элементы.СоздатьПрямойОбмен.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеДокументыЭДО

Процедура ЭлектронныйДокументИсходящийЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОсновное);
	
КонецПроцедуры

Процедура ЭлектронныйДокументВходящийЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОсновное);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиЭДО

Процедура ПравилаУчетаВидовЭДДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ФормаКомандаЗаписатьИЗакрыть.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОсновное);
	
КонецПроцедуры

Процедура НастройкиОтраженияДокументовВУчетеУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ФормаУдалить.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

Процедура НастройкиОтправкиДокументовУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ФормаОтправитьКаталогПоСоглашению.Доступность = Ложь;
	Элементы.ФормаСформироватьСоглашениеПоШаблону.Доступность = Ложь;
	Элементы.ФормаУдалить.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

Процедура НастройкаОтправкиВидаДокументаУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ФормаСохранитьНастройки.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаВидИТипЭД);
	
КонецПроцедуры

Процедура СписокНастроекЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.СоздатьНастройкуВнутреннегоЭДО.Доступность = Ложь;
	Элементы.НастройкиОтправкиСоздатьНастройкуОтправки.Доступность = Ложь;
	Элементы.ИнтеркампаниСоздатьНастройкуИнтеркампани.Доступность = Ложь;
	Элементы.НастройкиОтправкиСоздатьНастройкуПрямогоОбмена.Доступность = Ложь;
	Элементы.НастройкиПолученияСоздатьНастройкуПолучения.Доступность = Ложь;
	Элементы.НастройкиОтправкиОбновитьСтатусыПодключения.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеПоВходящимДокументамЭДО

Процедура СозданиеПоВходящимЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.СоздатьДокумент.Доступность = Ложь;
	Элементы.НеСоздаватьДокумент.Доступность = Ложь;
	Элементы.ФормаОтправитьПолучитьЭДО.Доступность = Ложь;
	Элементы.ФормаСоздатьАвтоматически.Доступность = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОтборы);
	
КонецПроцедуры

#КонецОбласти

#Область ОтправкаДокументовПоЭДО

Процедура ОтправкаДокументовПоЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОтборы);
	
КонецПроцедуры

#КонецОбласти

#Область ДокументыДО

Процедура СкрытьНедоступныеКомандыЭДО(Форма, ОписаниеКоманд)
	
	ДействияПоПакету = ИнтерфейсЭДОДокументооборот.ДействияСПакетомЭДО();
	ДействияПоЭДО = ИнтерфейсЭДОДокументооборот.ДействияКомандЭДО();
	
	НедоступныеДействия = Новый Массив; // Массив из Строка
	
	НедоступныеДействия.Добавить(ДействияПоПакету.ИзменитьСоставПакета);
	НедоступныеДействия.Добавить(ДействияПоПакету.ДобавитьКПакету);
	НедоступныеДействия.Добавить(ДействияПоПакету.СоздатьПакет);
	
	НедоступныеДействия.Добавить(ДействияПоЭДО.Принять);
	НедоступныеДействия.Добавить(ДействияПоЭДО.Отклонить);
	НедоступныеДействия.Добавить(ДействияПоЭДО.Подписать);
	НедоступныеДействия.Добавить(ДействияПоЭДО.Отправить);
	НедоступныеДействия.Добавить(ДействияПоЭДО.ЗакрытьПринудительно);
	НедоступныеДействия.Добавить(ДействияПоЭДО.ПоставитьВОчередьОтправки);
	
	Отбор = ИнтерфейсЭДОДокументооборот.НовыйОтборКомандЭДО();
	
	ГруппаОтбора = ИнтерфейсЭДОДокументооборот.НовыйЭлементОтбораКомандЭДО();
	ГруппаОтбора.ВидЭлемента = ИнтерфейсЭДОДокументооборот.ВидыЭлементовОтбораКомандЭДО().ГруппаПоИли;
	
	Для Каждого Действие Из НедоступныеДействия Цикл
		
		ЭлементОтбора = ИнтерфейсЭДОДокументооборот.НовыйЭлементОтбораКомандЭДО();
		ЭлементОтбора.Ключ = ИнтерфейсЭДОДокументооборот.КлючиОтбораКомандЭДО().ВыполняемыеДействия;
		ЭлементОтбора.ВидСравнения = ИнтерфейсЭДОДокументооборот.ВидыСравненияЭлементовОтбораКомандЭДО().Содержит;
		ЭлементОтбора.Значение = Действие;
		ГруппаОтбора.ДочерниеЭлементы.Добавить(ЭлементОтбора);
		
	КонецЦикла;
	
	Отбор.Добавить(ГруппаОтбора);
	
	ИнтерфейсЭДОДокументооборот.УстановитьВидимостьДоступностьКомандЭДОПоОтбору(ОписаниеКоманд, Отбор, Ложь, Ложь);
	
КонецПроцедуры

Процедура ПросмотрФайлаПакетаЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ГруппаОсновнаяОбласть);
	
КонецПроцедуры

Процедура ДокументДОУстановитьВидимостьДоступность(Форма)
	
	Форма.Элементы.ОбновитьСтороныЭДО.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсДокументовЭДО

Процедура ТекущиеДелаЭДОУстановитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	
	Форма.ТолькоПросмотр = Истина;
	
	Элементы.ОтправитьИПолучитьЭД.Видимость = Ложь;
	
	ТекстПредупреждения =
		ОбменСКонтрагентамиДОМиграцияКлиентСервер.ТекстДекорацииОБлокировкеПриМиграции();
	СоздатьНастроитьНадписьОбменаВДругойВерсии(Форма, ТекстПредупреждения, Элементы.ПанельКонтекстныхНовостей);
	
КонецПроцедуры

Процедура ТекущиеДелаЭДОУстановитьНедоступныеКоманды(Форма)
	
	НедоступныеКоманды = Форма.НедоступныеКоманды; // Массив Из Строка
	
	НедоступныеКоманды.Добавить("КомандыВходящиеЭД");
	НедоступныеКоманды.Добавить("КомандыИсходящиеЭД");
	НедоступныеКоманды.Добавить("КомандыСформироватьЭД");
	НедоступныеКоманды.Добавить("КомандыКонтейнерыЭД");
	НедоступныеКоманды.Добавить("КомандыПриглашенияЭД");
	НедоступныеКоманды.Добавить("Обновить");
	НедоступныеКоманды.Добавить("ЗакрытьПринудительно");
	НедоступныеКоманды.Добавить("Перенаправить");
	НедоступныеКоманды.Добавить("УтвердитьЭД");
	НедоступныеКоманды.Добавить("ПодписатьВх");
	НедоступныеКоманды.Добавить("ПодписатьИсх");
	НедоступныеКоманды.Добавить("ОтклонитьПодписаниеИсх");
	НедоступныеКоманды.Добавить("Аннулировать");
	НедоступныеКоманды.Добавить("ОтклонитьДокумент");
	НедоступныеКоманды.Добавить("ОтклонитьАннулирование");
	НедоступныеКоманды.Добавить("ИзменитьДокумент");
	НедоступныеКоманды.Добавить("СформироватьЭД");
	НедоступныеКоманды.Добавить("СоздатьПроизвольныйДокумент");
	НедоступныеКоманды.Добавить("ОтправитьВАрхив");
	НедоступныеКоманды.Добавить("ОтправитьЭД");
	НедоступныеКоманды.Добавить("ВернутьНаПодготовкуКОтправке");
	НедоступныеКоманды.Добавить("ОтменитьКонтейнеры");
	НедоступныеКоманды.Добавить("РаспаковатьКонтейнеры");
	НедоступныеКоманды.Добавить("ОтправитьПриглашения");
	НедоступныеКоманды.Добавить("ПринятьПриглашения");
	НедоступныеКоманды.Добавить("ОтклонитьПриглашения");
	НедоступныеКоманды.Добавить("УтвердитьПодписатьИОтправитьВх");
	НедоступныеКоманды.Добавить("УтвердитьПодписатьИОтправитьИсх");
	НедоступныеКоманды.Добавить("СформироватьПодписатьИОтправить");
	НедоступныеКоманды.Добавить("СопоставитьНоменклатуру");
	НедоступныеКоманды.Добавить("ОткрытьНоменклатуруКонтрагентов");
	НедоступныеКоманды.Добавить("ПровестиУчетныеДокументы");
	НедоступныеКоманды.Добавить("ВАрхивПриглашенияОтправить");
	НедоступныеКоманды.Добавить("ОтозватьПриглашение");
	НедоступныеКоманды.Добавить("ВходящиеЭДКонтекстноеМенюУтвердитьЭД");
	НедоступныеКоманды.Добавить("ВходящиеЭДКонтекстноеМенюОтклонитьАннулирование");
	НедоступныеКоманды.Добавить("ИсходящиеЭДКонтекстноеМенюОтклонитьПодписаниеИсх");
	НедоступныеКоманды.Добавить("ИсходящиеЭДКонтекстноеМенюОтклонитьАннулирование");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
