Функция ПолучитьДанныеДокумента(Физлицо, ВидДокумента, Реквизит, Дата = Неопределено)Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Физлицо",	Физлицо);
	Запрос.УстановитьПараметр("ДатаСреза",	Дата);
	Запрос.УстановитьПараметр("ВидДокумента",	ВидДокумента);
	
	Запрос.Текст =
	"	ВЫБРАТЬ ПЕРВЫЕ 1
	|		ДокументыФизическихЛиц."+Реквизит+"
	|	ИЗ
	|		РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период,
	|				ДокументыФизическихЛиц.Физлицо КАК Физлицо
	|			ИЗ
	|				РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|			ГДЕ
	|				ДокументыФизическихЛиц.Физлицо = &Физлицо
	|				" + ?(Дата <> Неопределено, "И ДокументыФизическихЛиц.Период <= &ДатаСреза", "") + "
	|				И ДокументыФизическихЛиц.ВидДокумента = &ВидДокумента
	|	
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ДокументыФизическихЛиц.Физлицо) КАК ДокументыСрез
	|			ПО ДокументыФизическихЛиц.Период = ДокументыСрез.Период
	|				И ДокументыФизическихЛиц.Физлицо = ДокументыСрез.Физлицо";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка[Реквизит];
	КонецЕсли;
	
	Возврат "";
	
КонецФункции