#Область ПрограммныйИнтерфейс

// Собирает картинки в одну вертикально.
//
// Параметры:
//   ИсходныеКартинки - Массив - массив строк или двоичных данных с исходными картинками.
//   Формат - Строка - расширение формата.
//
// Возвращаемое значение:
//   Строка - путь к картинке, являющейся сборкой исходных по вертикали.
//
Функция СобратьКартинки(ИсходныеКартинки, Формат) Экспорт
	
	ПутьНовогоФайла = ПолучитьИмяВременногоФайла(Формат);
	ФайлыКУдалению = Новый Массив;
	
	ПараметрыConvert = Новый Массив;
	Для Каждого ИсходнаяКартинка Из ИсходныеКартинки Цикл
		Если ТипЗнч(ИсходнаяКартинка) = Тип("ДвоичныеДанные") Тогда
			ПутьИсходногоФайла = ПолучитьИмяВременногоФайла(Формат);
			ИсходнаяКартинка.Записать(ПутьИсходногоФайла);
			ФайлыКУдалению.Добавить(ПутьИсходногоФайла);
		ИначеЕсли ТипЗнч(ИсходнаяКартинка) = Тип("Строка") Тогда
			ПутьИсходногоФайла = ИсходнаяКартинка;
		КонецЕсли;
		ПараметрыConvert.Добавить(ПутьИсходногоФайла);
	КонецЦикла;
	
	Параметры = СтрШаблон("convert %1 -append %2",
		СтрСоединить(ПараметрыConvert, " "),
		ПутьНовогоФайла);
		
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Параметры = СтрЗаменить(Параметры, "convert", "");
	КонецЕсли;		
		
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Константа - качество преобразования PDF для предпросмотра.
// 
// Возвращаемое значение:
//  Число
Функция КачествоПреобразованияPDFДляПредпросмотра() Экспорт
	
	Возврат 150;
	
КонецФункции

// Преобразует pdf в массив png
// 
// Параметры:
//  ИмяФайлаPdf  - Строка
//  ВременнаяПапкаДляРазархивирования  -Строка
// 
// Возвращаемое значение:
//  Массив из Строка - Преобразовать pdf в png
Функция ПреобразоватьPdfВPng(ИмяФайлаPdf, ВременнаяПапкаДляРазархивирования) Экспорт
	
	DPI = КачествоПреобразованияPDFДляПредпросмотра();
	
	МассивПутейPng = Новый Массив;
	
	ПутьНовогоФайла = ВременнаяПапкаДляРазархивирования + ПолучитьРазделительПути() + "res.png";
	ФайлыКУдалению = Новый Массив;
	
	Параметры = СтрШаблон("convert -density %1 %2 -strip -quality 0  %3", "" + DPI, ИмяФайлаPdf, ПутьНовогоФайла);	
	
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Параметры = СтрЗаменить(Параметры, "convert", "");
	КонецЕсли;		
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	МассивФайлов = НайтиФайлы(ВременнаяПапкаДляРазархивирования, "res*.png");
	
	МассивПутей = Новый Массив;
	МассивСтруктур = Новый Массив;
	
	// отсортируем по дате
	Для Каждого Файл Из МассивФайлов Цикл
		
		ПутьФайла = Файл.ПолноеИмя;
		
		СтруктураФайла = Новый Структура("ПутьФайла, ИмяБезРасширения");
		СтруктураФайла.ПутьФайла = ПутьФайла;
		СтруктураФайла.ИмяБезРасширения = Файл.ИмяБезРасширения;
		
		МассивСтруктур.Добавить(СтруктураФайла);
		
	КонецЦикла;	
	
	СортироватьМассивПоЧислам(МассивСтруктур, МассивПутей);
	
	Для Каждого ПутьФайла Из МассивПутей Цикл
		МассивПутейPng.Добавить(ПутьФайла);
	КонецЦикла;	
	
	Возврат МассивПутейPng;

КонецФункции

// Преобразует массив png в pdf 
Процедура ПреобразоватьPngВPdf(МассивНовыхPng, ИмяФайлаPdfНовое, ИмяBatФайла = "") Экспорт
	
	ТипПлатформыСервера = ОбщегоНазначенияДокументооборотПовтИсп.ТипПлатформыСервера();
	
	Если (ТипПлатформыСервера = ТипПлатформы.Linux_x86 
		Или ТипПлатформыСервера = ТипПлатформы.Linux_x86_64) Тогда
	
		ИмяBatФайла = "";
	
	КонецЕсли;
	
	ФайлыКУдалению = Новый Массив;
	
	ПараметрыConvert = Новый Массив;
	Для Каждого ПутьИсходногоФайла Из МассивНовыхPng Цикл
		ПараметрыConvert.Добавить(ПутьИсходногоФайла);
	КонецЦикла;
	
	Параметры = СтрШаблон("convert %1 %2",
		СтрСоединить(ПараметрыConvert, " "),
		ИмяФайлаPdfНовое);
		
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Параметры = СтрЗаменить(Параметры, "convert", "");
	КонецЕсли;	
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению, ИмяBatФайла);

КонецПроцедуры

// Уменьшить штамп. 
Процедура УменьшитьШтамп(ИмяФайлаШтампа, ЧислоПодписей) Экспорт
	
	ФайлыКУдалению = Новый Массив;
	НоваяВысота = ЧислоПодписей * 140;
	
	Параметры = СтрШаблон("mogrify -resize 600x%1 %2",
		Формат(НоваяВысота, "ЧГ=0"), // ЧГ=0  без группировки по 3
		ИмяФайлаШтампа);
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению); 
	
КонецПроцедуры

// Увеличить штамп. 
Процедура УвеличитьШтамп(ИмяФайлаШтампа, ЧислоПодписей) Экспорт
	
	ФайлыКУдалению = Новый Массив;
	НоваяВысота = ЧислоПодписей * 140*4;
	
	Параметры = СтрШаблон("mogrify -resize 2400x%1 %2",
		Формат(НоваяВысота, "ЧГ=0"), // ЧГ=0  без группировки по 3
		ИмяФайлаШтампа);
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению); 
	
КонецПроцедуры

// Накладывает на картинки штамп. 
Функция НаложитьШтамп(ПутьPng, ИмяФайлаШтампа, 
	ВременнаяПапкаДляРазархивирования, Счетчик,
	РасположениеШтампаЭПВPdf) Экспорт
	
	ОтступX = ""; //как строка
	ОтступY = "";
	
	ПоложениеШтампаСтрока = "NorthWest";
	Если РасположениеШтампаЭПВPdf = Перечисления.МестаВставкиКартинки.ЛевыйВерхний Тогда
		ПоложениеШтампаСтрока = "NorthWest";
		ОтступX = "+120";
		ОтступY = "+120";
	ИначеЕсли РасположениеШтампаЭПВPdf = Перечисления.МестаВставкиКартинки.ЛевыйНижний Тогда
		ПоложениеШтампаСтрока = "SouthWest";
		ОтступX = "+120";
		ОтступY = "+120";
	ИначеЕсли РасположениеШтампаЭПВPdf = Перечисления.МестаВставкиКартинки.ПравыйВерхний Тогда
		ПоложениеШтампаСтрока = "NorthEast";
		ОтступX = "+60";
		ОтступY = "+120";
	ИначеЕсли РасположениеШтампаЭПВPdf = Перечисления.МестаВставкиКартинки.ПравыйНижний Тогда
		ПоложениеШтампаСтрока = "SouthEast";
		ОтступX = "+60";
		ОтступY = "+120";
	КонецЕсли;	
	
	ПутьНовогоФайла = ВременнаяПапкаДляРазархивирования + ПолучитьРазделительПути() + СтрШаблон("res%1.png", Счетчик);
	ФайлыКУдалению = Новый Массив;
	
	Параметры = СтрШаблон("composite -dissolve 80 -gravity %1 -geometry %2%3 -colorspace RGB %4 %5 %6",
		ПоложениеШтампаСтрока,
		ОтступX,
		ОтступY,
		ИмяФайлаШтампа,
		ПутьPng,
		ПутьНовогоФайла);
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	УдалитьФайлы(ПутьPng);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Накладывает на картинки штампы ЭП, когда заданы их координаты на листе. 
// "Положение" в параметре ПутиСПоложениями в каждом штампе должно быть задано (<> Неопределено), иначе вызывается
// см. НаложитьШтамп.
// 
// Параметры:
//  ПутьPng - Строка - Путь к файлу с нужной страницей документа, на которую накладываем рег.штамп.
//  ПутиСПоложениями - Массив из см. РаботаСЭП.НовыйПутьИПоложение.
//  ВременнаяПапкаДляРазархивирования - Строка - Временная папка для разархивирования
//  Счетчик - Число - Номер текущей страницы разобранного на картинки документа.
// 
// Возвращаемое значение:
//  Строка - Путь к созданному файлу
Функция НаложитьШтампыСПоложениями(
	ПутьPng, ПутиСПоложениями, ВременнаяПапкаДляРазархивирования, Счетчик) Экспорт
	
	ПутьНовогоФайла = ВременнаяПапкаДляРазархивирования + ПолучитьРазделительПути() + СтрШаблон("res%1.png", Счетчик);
	ИсходныйФайл = ПутьPng;
	
	Dpi = КачествоПреобразованияPDFДляПредпросмотра();
	Для Каждого ПутьПоложение Из ПутиСПоложениями Цикл
		
		Положение = ПутьПоложение.Положение;
		ИмяФайлаШтампа = ПутьПоложение.Путь;
		
		РазмерыШтампа = ВсеРазмерыКартинки(ИмяФайлаШтампа);
		РазмерыСтраницы = ВсеРазмерыКартинки(ПутьPng);
		Если РазмерыСтраницы.Нулевые Тогда
			Возврат ПутьPng; // Ничего не преобразуем, картинка страницы остается самой собой.
		КонецЕсли;
		
		// Плотность у картинки не всегда правильно определяется, через пропорцию нужно высчитать правильную 
		// размер штампа. Небольшой погрещностью можно пренебречь.
		НоваяШирина = Окр(Положение.Ширина / РазмерыСтраницы.ШиринаМм * РазмерыСтраницы.ШиринаПикс);
		НоваяВысота = Окр(Положение.Высота / РазмерыСтраницы.ВысотаМм * РазмерыСтраницы.ВысотаПикс);
		Если МодульЧисла(НоваяШирина - РазмерыШтампа.ШиринаПикс) / РазмерыШтампа.ШиринаПикс > 0.02
			Или МодульЧисла(НоваяВысота - РазмерыШтампа.ВысотаПикс) / РазмерыШтампа.ВысотаПикс > 0.02 Тогда
			// Масштабируем и приводим штамп к такой-же плотности, как саму страницу:
			МасштабироватьКартинку(ИмяФайлаШтампа, НоваяШирина, НоваяВысота, Dpi);
		КонецЕсли;
		
		ПоложениеШтампаСтрока = "NorthWest";
		ОтступX = "+" + Формат(Положение.Слева * DPI / 25.4, "ЧДЦ=0; ЧГ=0;");
		ОтступY = "+" + Формат(Положение.Сверху * DPI / 25.4, "ЧДЦ=0; ЧГ=0;");
	
		ФайлыКУдалению = Новый Массив();
		
		Параметры = СтрШаблон("composite -dissolve 80 -colorspace rgb -gravity %1 -geometry %2%3 %4 %5 %6",
			ПоложениеШтампаСтрока,
			ОтступX,
			ОтступY,
			ИмяФайлаШтампа,
			ИсходныйФайл,
			ПутьНовогоФайла);
		
		ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
		
		ИсходныйФайл = ПутьНовогоФайла;
		
	КонецЦикла;
	
	УдалитьФайлы(ПутьPng);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Формирует изображение штампа ЭП
//
// Параметры:
//   ОписаниеЭП - Структура - Со свойствами:
//     Номер - Строка - серийный номер
//     Владелец - Строка - владелец сертификата ЭП.
//     ДатаНачала - Дата - дата начала действия сертификата.
//     ДатаОкончания - Дата - дата окончания действия сертификата.
//   Формат - Строка - расширение формата.
//
// Возвращаемое значение:
//   Строка - полный путь к картинке штампа ЭП.
//
Функция СформироватьШтампЭП(ОписаниеЭП, Формат = "PNG") Экспорт
	
	ФайлыКУдалению = Новый Массив;
	
	МакетСертификат = ПолучитьОбщийМакет("ШаблонОтметкиЭП");
	
	ПутьФайлаШаблона = ПолучитьИмяВременногоФайла(Формат);
	МакетСертификат.Записать(ПутьФайлаШаблона);
	ФайлыКУдалению.Добавить(ПутьФайлаШаблона);
	
	ПараметрыDraw = Новый Массив;
	
	ПараметрыDraw.Добавить(
		СтрШаблон(
			"text %1, %2 '%3'",
			260,
			133,
			ОписаниеЭП.Номер));
	
	ПараметрыDraw.Добавить(
		СтрШаблон(
			"text %1, %2 '%3'",
			260,
			333,
			СтрШаблон(
				НСтр("ru = 'с %1 по %2'"),
				Формат(ОписаниеЭП.ДатаНачала, "ДФ=dd.MM.yyyy"),
				Формат(ОписаниеЭП.ДатаОкончания, "ДФ=dd.MM.yyyy"))));
	
	
	ПараметрыСоздания = Новый Массив;
	
	Добавка = СтрШаблон("convert %1", ПутьФайлаШаблона);
		
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Добавка = СтрЗаменить(Добавка, "convert", "");	
	КонецЕсли;	     
	
	ПараметрыСоздания.Добавить(Добавка);
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(" -pointsize 36 -fill ""#0A64DC"" -draw ""%1""", 
			СтрСоединить(ПараметрыDraw, " ")));
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(
			"-background none  -fill ""#0A64DC"" -stroke None -pointsize 36 -size 940x140 -gravity NorthWest caption:""%1"" -geometry +%2+%3 -composite",
			ОписаниеЭП.Владелец,
			260,
			150)); // 260 150 - координаты (лево верх)
	
	ПутьНовогоФайла = ПолучитьИмяВременногоФайла("PNG");
	
	ПараметрыСоздания.Добавить(ПутьНовогоФайла);
	
	ПараметрыImageMagick = СтрСоединить(ПараметрыСоздания, " ");
	
	ЗапуститьImageMagick(ПараметрыImageMagick, ФайлыКУдалению);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

Функция СформироватьШтампЭПСДоверенностью(ОписаниеЭП, Формат = "PNG") Экспорт
	
	ФайлыКУдалению = Новый Массив;

	МакетСертификат = ПолучитьОбщийМакет("ШаблонОтметкиЭПСДоверенностью");
	
	ПутьФайлаШаблона = ПолучитьИмяВременногоФайла(Формат);
	МакетСертификат.Записать(ПутьФайлаШаблона);
	ФайлыКУдалению.Добавить(ПутьФайлаШаблона);
	
	ПараметрыDraw = Новый Массив;
	
	ПараметрыDraw.Добавить(
		СтрШаблон(
			"text %1, %2 '%3'",
			260,
			133,
			ОписаниеЭП.Номер));
	
	ПараметрыDraw.Добавить(
		СтрШаблон(
			"text %1, %2 '%3'",
			260,
			233,
			СтрШаблон(
				НСтр("ru = 'с %1 по %2'"),
				Формат(ОписаниеЭП.ДатаНачала, "ДФ=dd.MM.yyyy"),
				Формат(ОписаниеЭП.ДатаОкончания, "ДФ=dd.MM.yyyy"))));
	
	ПараметрыDraw.Добавить(
		СтрШаблон(
			"text %1, %2 '%3'",
			260,
			413,
			ОписаниеЭП.ДанныеДоверенности.НомерДоверенности));
	
	
	ПараметрыСоздания = Новый Массив;
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(" %1", ПутьФайлаШаблона));
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(" -pointsize 36 -fill ""#0A64DC"" -draw ""%1""", 
			СтрСоединить(ПараметрыDraw, " ")));
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(
			"-background none  -fill ""#0A64DC""  -stroke None -pointsize 36 -size 940x90 -gravity NorthWest caption:""%1"" -geometry +%2+%3 -composite",
			ОписаниеЭП.Владелец,
			260,
			150)); // 260 150 - координаты (лево верх)
	
	ПараметрыСоздания.Добавить(
		СтрШаблон(
			"-background none  -fill ""#0A64DC""  -stroke None -pointsize 36 -size 940x90 -gravity NorthWest caption:""%1"" -geometry +%2+%3 -composite",
			СтрЗаменить(ОписаниеЭП.ДанныеДоверенности.ДоверительПредставление, """", ""),
			260,
			280));
	
	ПутьНовогоФайла = ПолучитьИмяВременногоФайла("PNG");
	
	ПараметрыСоздания.Добавить(ПутьНовогоФайла);
	
	ПараметрыImageMagick = СтрСоединить(ПараметрыСоздания, " ");
	
	ЗапуститьImageMagick(ПараметрыImageMagick, ФайлыКУдалению);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Накладывает на изображение строки в указанных местах.
//
// Параметры:
//   ИсходнаяКартинка - Строка, ДвоичныеДанные - исходная картинка.
//   Формат - Строка - расширение формата.
//   Строки - Массив - массив структур со свойствами:
//     Слева - Число - пикселей слева до левого края строки.
//     Сверху - Число - пикселей сверху до нижнего края строки.
//     Строка - Строка - накладываемая строка.
//   Размер - Число - размер шрифта в пикселях.
//
// Возвращаемое значение:
//   Строка - полный путь к картинке с наложенным текстом.
//
Функция НаложитьСтроки(ИсходнаяКартинка, Формат, Строки, Размер) Экспорт
	
	ФайлыКУдалению = Новый Массив;
	Если ТипЗнч(ИсходнаяКартинка) = Тип("ДвоичныеДанные") Тогда
		ПутьИсходногоФайла = ПолучитьИмяВременногоФайла(Формат);
		ИсходнаяКартинка.Записать(ПутьИсходногоФайла);
		ФайлыКУдалению.Добавить(ПутьИсходногоФайла);
	ИначеЕсли ТипЗнч(ИсходнаяКартинка) = Тип("Строка") Тогда
		ПутьИсходногоФайла = ИсходнаяКартинка;
	КонецЕсли;
	
	ПутьНовогоФайла = ПолучитьИмяВременногоФайла(Формат);
	
	ПараметрыDraw = Новый Массив;
	Для Каждого Строка Из Строки Цикл
		ПараметрDraw = СтрШаблон("text %1, %2 '%3'",
			Формат(Строка.Слева, "ЧГ=0"),
			Формат(Строка.Сверху, "ЧГ=0"),
			Строка.Текст);
		ПараметрыDraw.Добавить(ПараметрDraw);
	КонецЦикла;
	
	Параметры = СтрШаблон("convert %3 -pointsize %1 -draw ""%2"" %4",
		Формат(Размер, "ЧГ=0"),
		СтрСоединить(ПараметрыDraw, " "),
		ПутьИсходногоФайла,
		ПутьНовогоФайла);
		
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Параметры = СтрЗаменить(Параметры, "convert", "");
	КонецЕсли;		
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Конвертирует картинку из указанного формата в новый.
//
// Параметры:
//   ИсходнаяКартинка - Строка, ДвоичныеДанные - исходная картинка.
//   ИсходныйФормат - Строка - расширение исходного формата.
//   НовыйФормат - Строка - расширение нового формата.
//
// Возвращаемое значение:
//   Строка - полный путь к картинке в новом формате.
//
Функция Конвертировать(ИсходнаяКартинка, ИсходныйФормат, НовыйФормат) Экспорт
	
	ФайлыКУдалению = Новый Массив;
	Если ТипЗнч(ИсходнаяКартинка) = Тип("ДвоичныеДанные") Тогда
		ПутьИсходногоФайла = ПолучитьИмяВременногоФайла(ИсходныйФормат);
		ИсходнаяКартинка.Записать(ПутьИсходногоФайла);
		ФайлыКУдалению.Добавить(ПутьИсходногоФайла);
	ИначеЕсли ТипЗнч(ИсходнаяКартинка) = Тип("Строка") Тогда
		ПутьИсходногоФайла = ИсходнаяКартинка;
	КонецЕсли;
	
	ПутьНовогоФайла = ПолучитьИмяВременногоФайла(НовыйФормат);
	
	Параметры = СтрШаблон("convert %1 %2", ПутьИсходногоФайла, ПутьНовогоФайла);
	
	НоваяВерсияIM = ВерсияImageMagickНовая(); // Булево
	Если НоваяВерсияIM Тогда
		Параметры = СтрЗаменить(Параметры, "convert", "");
	КонецЕсли;		
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению);
	
	Возврат ПутьНовогоФайла;
	
КонецФункции

// Запускает ImageMagick с указанными параметрами. В случае ошибки вызывается исключение,
// в остальных случаях возвращается код возврата ImageMagick.
//
// Параметры:
//   Параметры - Строка - параметры запуска ImageMagick.
//   ФайлыКУдалению - Массив - необязательный параметр, временные файлы, требующие удаления.
//   ИмяBatФайла - строка, полный путь + имя  bat файла. Может быть пуст.
//
// Возвращаемое значение:
//   Число - 0 в случае успешного выполнения, 300+ - при завершении с предупреждением.
//     Полный список предупреждений см. в документации к ImageMagick.
//
Функция ЗапуститьImageMagick(Параметры, ФайлыКУдалению, ИмяBatФайла = "", СтрокаImageMagick = "") Экспорт
	
	Если ФайлыКУдалению = Неопределено Тогда
		ФайлыКУдалению = Новый Массив();
	КонецЕсли;

	ПолныйПуть = ФайловыеФункцииПовтИсп.ПутьКПрограммеКонвертацииPDF();
	Если СтрокаImageMagick <> "" Тогда
		ПолныйПуть = СтрокаImageMagick;
	КонецЕсли;	
	

	Возврат РаботаСКартинкамиКлиентСервер.ЗапуститьImageMagick(Параметры, ФайлыКУдалению, ИмяBatФайла, ПолныйПуть);
	
КонецФункции

// Получить размеры картинки в мм и пикселях.
// 
// Параметры:
//  Штамп - Строка, ДвоичныеДанные, СправочникСсылка.Файлы - Путь к файлу картинки, двоичные 
//															 данные, или ссылка на файл.
//
// Возвращаемое значение:
//  Структура - Размеры картинки:
//   * ШиринаПикс - Число - в пикселях.
//   			  - Неопределено - если передана Коллекция картинок (ненормальная ситуация).
//   * ВысотаПикс - Число - в пикселях.
//   			  - Неопределено - если передана Коллекция картинок (ненормальная ситуация).
//   * ШиринаМм - Число - в мм.
//   * ВысотаМм - Число - в мм.
//   * ПлотностьПоГоризонтали - Число - в DPI
//   						  - Неопределено - если передана Коллекция картинок (ненормальная ситуация).
//   * ПлотностьПоВертикали -  Число - в DPI
//   						- Неопределено - если передана Коллекция картинок (ненормальная ситуация).
//   * Нулевые - Булево - Если картинка очень маленькая или вообще нулевая.
Функция ВсеРазмерыКартинки(Штамп) Экспорт
	
	Картинка = Неопределено;
	Если ТипЗнч(Штамп) = Тип("Строка") Или ТипЗнч(Штамп) = Тип("ДвоичныеДанные") Тогда
		Картинка = Новый Картинка(Штамп);
	ИначеЕсли ТипЗнч(Штамп) = Тип("СправочникСсылка.Файлы") Тогда
		Картинка = Новый Картинка(РаботаСФайламиВызовСервера.ПолучитьДвоичныеДанныеФайла(Штамп));
	КонецЕсли;
	
	DPI = КачествоПреобразованияPDFДляПредпросмотра();
	
	Размеры = Новый Структура();
	Размеры.Вставить("ПлотностьПоГоризонтали", Картинка.ПлотностьПоГоризонтали());
	Если Размеры.ПлотностьПоГоризонтали = 72 Тогда
		Размеры.ПлотностьПоГоризонтали = DPI;
		// (Т.е. принудительно ставим ту же плотность, с каком pdf преобразуется в png при наложение 
		// штампов средствами ImageMagick).
	КонецЕсли;
	Размеры.Вставить("ПлотностьПоВертикали", Картинка.ПлотностьПоВертикали());
	Если Размеры.ПлотностьПоВертикали = 72 Тогда
		Размеры.ПлотностьПоВертикали = DPI;
	КонецЕсли;
	
	Размеры.Вставить("ШиринаПикс", Картинка.Ширина());
	Размеры.Вставить("ВысотаПикс", Картинка.Высота());
	
	Размеры.Вставить("ШиринаМм", Окр(Размеры.ШиринаПикс / Размеры.ПлотностьПоГоризонтали * 25.4)); // Перевод из пикселей в мм.
	Размеры.Вставить("ВысотаМм", Окр(Размеры.ВысотаПикс / Размеры.ПлотностьПоВертикали * 25.4));
	
	// Возможны "артефакты" - аномально маленькие страницы при разборе:
	Размеры.Вставить("Нулевые", Ложь);
	Если Размеры.ШиринаМм < 2 Или Размеры.ВысотаМм < 2 Тогда
		Размеры.Нулевые = Истина;
	КонецЕсли;
	
	Возврат Размеры;
	
КонецФункции

// Получает фрагмент изображения и сохраняет его в отдельном файле.
//
// Параметры:
//  ФайлИзображение - Строка - путь к файлу изображения.
//  Ширина - Число - ширина получаемого фрагмента в пикселях.
//  Высота - Число - высота фрагмента в пикселях.
//  X - Число - координата X левого верхнего угла фрагмента.
//  У - Число - координата Y левого верхнего угла фрагмента.
//  ФайлФрагмент - Строка - путь к файлу, по которому будет сохранен фрагмент.
//
Процедура ПолучитьФрагментИзображения(ФайлИзображение, Ширина, Высота, X, Y, ФайлФрагмент) Экспорт
	
	Картинка = Новый Картинка(ФайлИзображение);
	
	ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
	ОбрабатываемаяКартинка.ВыделитьОбласть(X, Y, Ширина, Высота);
	КартинкаРезультат = ОбрабатываемаяКартинка.ПолучитьКартинку();
	КартинкаРезультат.Записать(ФайлФрагмент);
	
КонецПроцедуры

// Возвращает размер изображения.
//
// Для многостраничных tif из картинок возвращается размер первой страницы.
// Для файлов, не являющихся изображениями, вызывается исключение.
//
// Параметры:
//  ФайлИзображение - Строка - путь к файлу изображения.
//
// Возвращаемое значение:
//  Структура
//   * Высота - Число - высота изображения в пикселях.
//   * Ширина - Число - ширина изображения в пикселях.
//   * yDPI - Число - dpi изображения по высоте.
//   * xDPI - Число - dpi изображения по ширине.
//
Функция РазмерИзображения(ФайлИзображение) Экспорт
	
	Файл = Новый Файл(ФайлИзображение);
	РасширениеФайла = СтрЗаменить(Файл.Расширение, ".", "");
	Если Не РаботаСФайламиКлиентСервер.ЭтоРасширениеКартинки(РасширениеФайла) Тогда
		ВызватьИсключение 
			НСтр("ru = 'Получение размера не возможно. Файл не является изображением.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
		                           
	Результат = Новый Структура;
	Результат.Вставить("Высота", 0);
	Результат.Вставить("Ширина", 0);
	Результат.Вставить("yDPI", 0);
	Результат.Вставить("xDPI", 0);
	
	ПутьКФайлуСРезультатом = ПолучитьИмяВременногоФайла(".info");
	
	ТипПлатформыСервера = ОбщегоНазначенияДокументооборотПовтИсп.ТипПлатформыСервера();
	Если (ТипПлатформыСервера = ТипПлатформы.Linux_x86 
		Или ТипПлатформыСервера = ТипПлатформы.Linux_x86_64) Тогда
	
		ИмяBatФайла = "";
		
	Иначе
		ИмяBatФайла = ПолучитьИмяВременногоФайла(".cmd");
	КонецЕсли;
			
	ФайлыКУдалению = Новый Массив;
	Параметры = СтрШаблон("identify -verbose %1 > %2", ФайлИзображение, ПутьКФайлуСРезультатом);
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению, ИмяBatФайла);
	
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуСРезультатом);
	
	ПрочитаноСтрок = 0;
	СтрокаТекста = "";
	
	ЕдиницаРазрешения = "";
	
	Пока ПрочитаноСтрок <=10 И СтрокаТекста <> Неопределено Цикл
		
		СтрокаТекста = ЧтениеТекста.ПрочитатьСтроку();
		ПрочитаноСтрок = ПрочитаноСтрок + 1;
				
		ФрагментыСтроки = СтрРазделить(СокрЛП(СтрокаТекста), ":", Ложь);
		Если ФрагментыСтроки.Количество() <> 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ФрагментыСтроки[0] = "Geometry" Тогда
			ФрагментыСтроки = СтрРазделить(СокрЛП(ФрагментыСтроки[1]), "+", Ложь);
			РазмерВСтроках = СтрРазделить(ФрагментыСтроки[0], "x");
			
			Если РазмерВСтроках.Количество() <> 2
				Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(РазмерВСтроках[0])
				Или Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(РазмерВСтроках[1]) Тогда
				
				Продолжить;
			КонецЕсли;
			
			Результат.Ширина = Число(РазмерВСтроках[0]);
			Результат.Высота = Число(РазмерВСтроках[1]);
			
		ИначеЕсли ФрагментыСтроки[0] = "Resolution" Тогда
			
			РазмерВСтроках = СтрРазделить(СокрЛП(ФрагментыСтроки[1]), "x");
			
			Если РазмерВСтроках.Количество() <> 2 Тогда
				Продолжить;
			КонецЕсли;
			
			ФрагментыЧисла = СтрРазделить(РазмерВСтроках[0], ".", Ложь);
			Если ФрагментыЧисла.Количество() > 2 Тогда
				Продолжить;
			КонецЕсли;
			ЕстьОшибка = Ложь;
			Для Каждого ФрагментЧисла Из ФрагментыЧисла Цикл
				Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ФрагментЧисла) Тогда
					ЕстьОшибка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьОшибка Тогда
				Продолжить;
			КонецЕсли;
			Результат.xDPI = Число(РазмерВСтроках[0]);
				
			ФрагментыЧисла = СтрРазделить(РазмерВСтроках[1], ".", Ложь);
			Если ФрагментыЧисла.Количество() > 2 Тогда
				Продолжить;
			КонецЕсли;
			ЕстьОшибка = Ложь;
			Для Каждого ФрагментЧисла Из ФрагментыЧисла Цикл
				Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ФрагментЧисла) Тогда
					ЕстьОшибка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьОшибка Тогда
				Продолжить;
			КонецЕсли;
			Результат.yDPI = Число(РазмерВСтроках[1]);
			
		ИначеЕсли ФрагментыСтроки[0] = "Units" Тогда
			ЕдиницаРазрешения = СокрЛП(ФрагментыСтроки[1]);
		КонецЕсли;
			
	КонецЦикла;
	
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ПутьКФайлуСРезультатом);
	
	Если ЗначениеЗаполнено(ЕдиницаРазрешения)
		И ЕдиницаРазрешения = "PixelsPerCentimeter" Тогда
		
		Результат.xDPI = Окр(Результат.xDPI * 2.54, 1);
		Результат.yDPI = Окр(Результат.yDPI * 2.54, 1);
		
	КонецЕсли;
	
	// Если DPI не удалось получить по сведения изображения,
	// то по умолчанию считаем, что он равен 72. 
	Если Результат.Ширина <> 0 И Результат.xDPI = 0 Тогда
		Результат.xDPI = 72;
	КонецЕсли;
	Если Результат.Высота <> 0 И Результат.yDPI = 0 Тогда
		Результат.yDPI = 72;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

// Возвращает параметры для получения фрагмента изображения со штрихкодом.
//
// Возвращаемое значение:
//   Структура:
//     * ФайлИзображение - Строка - путь к файлу изображения.
//     * ФайлФрагмент - Строка - путь к файлу, в который будет сохранен фрагмент.
//     * ПоложенияШтрихКода - ПеречислениеСсылка.ПоложенияШтрихКода - положение штрихкода в изображении. 
//     * ШиринаЗоныШтрихКода - Число - ширина зоны штрихкода в мм. имеет смсыл при ПоложенияШтрихКода.ТочноеПоложение.
//     * ВысотаЗоныШтрихКода - Число - высота зоны штрихкода в мм. имеет смсыл при ПоложенияШтрихКода.ТочноеПоложение.
//     * ОтступСлева - Число - Отступ слева от зоны штрихкода в мм. имеет смсыл при ПоложенияШтрихКода.ТочноеПоложение.
//     * ОтступСверху - Число - Отступ справа от зоны штрихкода в мм. имеет смсыл при ПоложенияШтрихКода.ТочноеПоложение.
//
Функция ПараметрыПолученияФрагментаСоШтрихкодом() Экспорт
	
	ПараметрыФрагмента = Новый Структура;
	ПараметрыФрагмента.Вставить("ФайлИзображение", "");
	ПараметрыФрагмента.Вставить("ФайлФрагмент", "");
	ПараметрыФрагмента.Вставить("ПоложенияШтрихКода", Перечисления.ПоложенияШтрихКода.НеЗадано);
	ПараметрыФрагмента.Вставить("ШиринаЗоныШтрихКода", 0);
	ПараметрыФрагмента.Вставить("ВысотаЗоныШтрихКода", 0);
	ПараметрыФрагмента.Вставить("ОтступСлева", 0);
	ПараметрыФрагмента.Вставить("ОтступСверху", 0);
	
	Возврат ПараметрыФрагмента;
	
КонецФункции

// Получает фрагмент изображения со штрихкодом.
//
// Если параметры изображения не удалось определить или размеры фрагмента и отступы
// не соответствуют изображению, то вызывается исключение.
//
// Параметры:
//  ПараметрыФрагмента - Структура - см. ПараметрыПолученияФрагментаСоШтрихкодом
//
Процедура ПолучитьФрагментИзображенияСоШтрихкодом(ПараметрыФрагмента) Экспорт
	
	Файл = Новый Файл(ПараметрыФрагмента.ФайлИзображение);
	РасширениеФайла = СтрЗаменить(Файл.Расширение, ".", "");
	Если Не РаботаСФайламиКлиентСервер.ЭтоРасширениеКартинки(РасширениеФайла) Тогда
		ВызватьИсключение 
			НСтр("ru = 'Получение фрагмента не возможно. Файл не является изображением.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
	
	УдалитьФайлы(ПараметрыФрагмента.ФайлФрагмент);
	
	Если ПараметрыФрагмента.ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.НеЗадано Тогда
		ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ЛевыйВерхнийУгол;
	Иначе
		ПоложенияШтрихКода = ПараметрыФрагмента.ПоложенияШтрихКода;
	КонецЕсли;
	
	РазмерИзображения = РазмерИзображения(ПараметрыФрагмента.ФайлИзображение);
	
	Если РазмерИзображения.Ширина = 0
		Или РазмерИзображения.Высота = 0
		Или РазмерИзображения.xDPI = 0
		Или РазмерИзображения.yDPI = 0 Тогда
		
		ВызватьИсключение
			НСтр("ru = 'Не удалось определить параметры изображения.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
		
	ДюймВмм = 25.4;
	
	// если указан угол  - то ширину и высоту считаем фиксированными - 45 и 25 мм.
	ШиринаВммПоУмолчанию = 45;
	ВысотаВммПоУмолчанию = 25;
	
	ШиринаЗоныШтрихКода = 0;
	ВысотаЗоныШтрихКода = 0;
	X = 0;
	Y = 0;
	
	Если ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ТочноеПоложение Тогда
		
		ШиринаЗоныШтрихКода = Окр(
			ПараметрыФрагмента.ШиринаЗоныШтрихКода / ДюймВмм * РазмерИзображения.xDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
			
		ВысотаЗоныШтрихКода = Окр(
			ПараметрыФрагмента.ВысотаЗоныШтрихКода / ДюймВмм * РазмерИзображения.yDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
				
		X = Окр(ПараметрыФрагмента.ОтступСлева / ДюймВмм * РазмерИзображения.xDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
				
		Y = Окр(ПараметрыФрагмента.ОтступСверху / ДюймВмм * РазмерИзображения.yDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
		
	Иначе
						
		ШиринаЗоныШтрихКода = Окр(
			ШиринаВммПоУмолчанию / ДюймВмм * РазмерИзображения.xDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
			
		ВысотаЗоныШтрихКода = Окр(
			ВысотаВммПоУмолчанию / ДюймВмм * РазмерИзображения.yDPI + 0.5,
			0,
			РежимОкругления.Окр15как10);
			
		Если ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ЛевыйВерхнийУгол Тогда
			X = 1;
			Y = 1;
		ИначеЕсли ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ПравыйВерхнийУгол Тогда
			X = РазмерИзображения.Ширина - ШиринаЗоныШтрихКода - 1;
			Y = 1;
		ИначеЕсли ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ЛевыйНижнийУгол Тогда
			X = 1;
			Y = РазмерИзображения.Высота - ВысотаЗоныШтрихКода - 1;
		ИначеЕсли ПоложенияШтрихКода = Перечисления.ПоложенияШтрихКода.ПравыйНижнийУгол Тогда
			X = РазмерИзображения.Ширина - ШиринаЗоныШтрихКода - 1;
			Y = РазмерИзображения.Высота - ВысотаЗоныШтрихКода - 1;
		КонецЕсли;
		
	КонецЕсли;
		
	Если X < 0 Или X > РазмерИзображения.Ширина
		Или Y < 0 Или Y > РазмерИзображения.Высота
		Или ШиринаЗоныШтрихКода <= 0 Или ВысотаЗоныШтрихКода <= 0
		Или X + ШиринаЗоныШтрихКода > РазмерИзображения.Ширина
		Или Y + ВысотаЗоныШтрихКода > РазмерИзображения.Высота Тогда
		
		ВызватьИсключение
			НСтр("ru = 'Размеры фрагмента со штрихкодом и отступы не соответствуют размеру изображения.'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	КонецЕсли;
		
	ПолучитьФрагментИзображения(
		ПараметрыФрагмента.ФайлИзображение,
		ШиринаЗоныШтрихКода, ВысотаЗоныШтрихКода, X, Y,
		ПараметрыФрагмента.ФайлФрагмент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Определяет, является ли переданная строка числом
//
// Параметры:
//   СтрокаСимволов - Строка - строка символов
//
// Возвращаемое значение:
//   Булево - возвращает Истина, если строка является числом
//
Функция ЭтоЧисло(СтрокаСимволов)
	
	СтрокаСимволов = СокрЛП(СтрокаСимволов);
	
	Если Не ЗначениеЗаполнено(СтрокаСимволов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(СтрокаСимволов);
	
	Для ТекущийСимвол = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(СтрокаСимволов, ТекущийСимвол);
		
		Если КодСимвола < 48 Или КодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура СортироватьМассивПоЧислам(МассивСтруктур, МассивПутей)
	
	ПараметрыДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ПутьФайла");
	ТаблицаФайлов.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтруктураФайла Из МассивСтруктур Цикл
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ПутьФайла = СтруктураФайла.ПутьФайла;
		
		ИмяБезРасширения = СтруктураФайла.ИмяБезРасширения;
		
		Номер = 0;
		СтрокаНомера = "";
		
		ТекПоз = СтрДлина(ИмяБезРасширения);
		Пока ТекПоз > 1 Цикл
			Символ = Сред(ИмяБезРасширения, ТекПоз, 1);
			Если Не ЭтоЧисло(Символ) Тогда
				Прервать;
			КонецЕсли;	
			СтрокаНомера = Символ + СтрокаНомера;
			ТекПоз = ТекПоз - 1;
		КонецЦикла;	
		
		Попытка
			Номер = Число(СтрокаНомера);
		Исключение
		КонецПопытки;	
		
		НоваяСтрока.Номер = Номер;
		
	КонецЦикла;		
	
	ТаблицаФайлов.Сортировать("Номер Возр");  
	
	МассивПутей.Очистить();
	
	Для Каждого Стр Из ТаблицаФайлов Цикл
		МассивПутей.Добавить(Стр.ПутьФайла);
	КонецЦикла;	
	
КонецПроцедуры	

// Масштабировать картинку средствами ImageMagick произвольно.
// 
// Параметры:
//  ПутьКФайлу - Строка - Путь к файлу картинки
//  НоваяШирина - Число - Новая ширина, в пикселях
//  НоваяВысота - Число - Новая высота, в пикселях
//  НоваяDpi - Число - Новая плотность (DPI - точек на дюйм) 
Процедура МасштабироватьКартинку(ПутьКФайлу, НоваяШирина, НоваяВысота, НоваяDpi)
	
	ФайлыКУдалению = Новый Массив();
	
	Параметры = СтрШаблон("mogrify -resize %1x%2 %3 -density %4",
		Формат(НоваяШирина, "ЧДЦ=0; ЧГ=0;"), // ЧГ=0  без группировки по 3
		Формат(НоваяВысота, "ЧДЦ=0; ЧГ=0;"),
		ПутьКФайлу,
		НоваяDpi);
	
	ЗапуститьImageMagick(Параметры, ФайлыКУдалению); 
	
КонецПроцедуры

// Модуль числа.
// 
// Параметры:
//  Число - Число
// 
// Возвращаемое значение:
//  Число
Функция МодульЧисла(Число)
	Возврат Макс(Число, -Число);
КонецФункции

Функция ВерсияImageMagickНовая() 
	
	Если ОбщегоНазначения.ЭтоLinuxСервер() Тогда
		Возврат Ложь; // для Linux  convert не удаляем никогда
	КонецЕсли;	
	
	Возврат Истина; // Windows всегда Истина
	
КонецФункции	

#КонецОбласти
