#Область ПрограммныйИнтерфейс

// Возвращает имя собыития для записи в журнал регистрации по push уведомлениям.
// 
// Возвращаемое значение:
//  Строка - Имя события для записи в журнал регистрации для push уведомлений.
//
Функция ИмяСобытияPushУведомления() Экспорт
	
#Если Клиент Тогда
	КодЯзыка = ОбщегоНазначенияКлиент.КодОсновногоЯзыка();
#Иначе
	КодЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
#КонецЕсли

	ИмяСобытия = НСтр("ru = 'Push-уведомления'", КодЯзыка);
	
	Возврат ИмяСобытия;

КонецФункции

#КонецОбласти
