// @strict-types


#Область ПрограммныйИнтерфейс

// Вызывается при принудительном закрытии документа ЭДО
// 
// Параметры:
//  ЭлектронныйДокумент - ДокументСсылка.ЭлектронныйДокументВходящийЭДО, ДокументСсылка.ЭлектронныйДокументИсходящийЭДО -
Процедура ПриПринудительномЗакрытииДокументаЭДО(ЭлектронныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОчередьПриемаСообщенийЭДО.СообщениеЭДО КАК СообщениеЭДО
		|ИЗ
		|	РегистрСведений.ОчередьПриемаСообщенийЭДО КАК ОчередьПриемаСообщенийЭДО
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СообщениеЭДО КАК СообщенияЭДО
		|		ПО ОчередьПриемаСообщенийЭДО.СообщениеЭДО = СообщенияЭДО.Ссылка
		|ГДЕ
		|	СообщенияЭДО.ЭлектронныйДокумент = &ЭлектронныйДокумент";
	Запрос.УстановитьПараметр("ЭлектронныйДокумент", ЭлектронныйДокумент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		РегистрыСведений.ОчередьПриемаСообщенийЭДО.УдалитьЗапись(Выборка.СообщениеЭДО);
	КонецЦикла;
	
	РегистрыСведений.ОшибкиЭДОКИсправлению.УдалитьЗаписьОбОшибке(ЭлектронныйДокумент);
	
КонецПроцедуры

// Вызывается после загрузки сообщения ЭДО по новому документу ЭДО
// 
// Параметры:
//  РезультатЗагрузкиСообщения - Структура:
//    * СообщениеОбъект - ДокументОбъект.СообщениеЭДО
Процедура ПослеЗагрузкиСообщенияЭДОНовогоЭлектронногоДокумента(РезультатЗагрузкиСообщения) Экспорт
	
	Если НеобходимоДобавитьСообщениеЭДОВОчередьПриема(РезультатЗагрузкиСообщения.СообщениеОбъект) Тогда
		РегистрыСведений.ОчередьПриемаСообщенийЭДО.ДобавитьЗапись(РезультатЗагрузкиСообщения.СообщениеОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает необходимо ли добавить сообщение ЭДО в очередь приема
//
// Параметры:
//  СообщениеЭДО - ДокументОбъект.СообщениеЭДО - Сообщение, по которому необходимо провести проверку
// 
// Возвращаемое значение:
//  Булево - Истина - если необходимо добавить в очередь, Ложь - в противном случае
Функция НеобходимоДобавитьСообщениеЭДОВОчередьПриема(СообщениеЭДО)
	
	ТипРегламента = СообщениеЭДО.ТипЭлементаРегламента;
	Статус = СообщениеЭДО.Статус;
	
	Если ТипРегламента = Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя
		И Статус = Перечисления.СтатусыСообщенийЭДО.Получен Тогда
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти