#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоМобильныйКлиент = ПараметрыСеанса.ЭтоМобильныйКлиент;
	МК_НастроитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции_МобильныйКлиент

&НаСервере
Процедура МК_НастроитьЭлементыФормы()
	
	Если Не ЭтоМобильныйКлиент Тогда
		Возврат;
	КонецЕсли;
	
	СворачиваниеЭлементовПоВажности = СворачиваниеЭлементовФормыПоВажности.НеИспользовать;
	ВертикальныйИнтервал = ИнтервалМеждуЭлементамиФормы.Половинный;
	
	Элементы.Список.Шапка = Ложь;
	Элементы.Подразделение.Видимость = Ложь;
	
	Элементы.МК_ГруппаКолонок.Видимость = Истина;
	Элементы.Переместить(Элементы.Дата, Элементы.ГруппаДатаСотрудник);
	Элементы.Переместить(Элементы.Пользователь, Элементы.ГруппаДатаСотрудник);
	Элементы.Переместить(Элементы.ДлительностьРабот, Элементы.ГруппаДаты);
	Элементы.Переместить(Элементы.ДлительностьРабочая, Элементы.ГруппаДаты);
	
	Элементы.Пользователь.ЦветТекста = ЦветаСтиля.МК_ЦветАвтораИсполнителя;
	Элементы.Пользователь.Шрифт = ШрифтыСтиля.МК_ШрифтАвтораИсполнителя;
	
	Элементы.Дата.Формат = НСтр("ru='ДФ=''dd MMMM yyyy'''");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗапросаОбновления()
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
	
#КонецОбласти