
Процедура Добавить(ДанныеЗаполнения) Экспорт
	
	Набор = РегистрыСведений.МиграцияДанныхИзВнешнихСистемЖурнал.СоздатьНаборЗаписей();
	Запись = Набор.Добавить();
	Запись.Период = ТекущаяДатаСеанса();
	Запись.Момент = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запись.Сеанс = НомерСоединенияИнформационнойБазы();
	Запись.Идентификатор = Новый УникальныйИдентификатор();
	
	ЗаполнитьЗначенияСвойств(Запись, ДанныеЗаполнения);
	
	МиграцияДанныхИзВнешнихСистемСервер.ЗаписатьСлужебныеДанные(Набор, Ложь);
		
КонецПроцедуры
