///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//Изменяет запись о трудозатрате для дальнейшего удаления в мобильном приложении
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь для изменения
//  День - Дата - День для отбора трудозатраты
//  НомерДобавления - НомерДобавления для трудозатраты
Процедура ЗафиксироватьУдалениеЗаписиОТрудозатрате(Пользователь, День, НомерДобавления) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьМобильныеКлиенты") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерДобавления) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.МП_ИзмененныеТрудозатраты.УдалитьЗаписьОТрудозатрате(Пользователь, День, НомерДобавления);
	
КонецПроцедуры
