#Область ОчередностьВыгрузки

// Возвращает массив объектов метаданных исключаемых из выгрузки. 
// 
// Возвращаемое значение:
//   - Массив из ОбъектМетаданных. 
//
Функция ЛишниеОбъекты() Экспорт
	
	Объекты = Новый Массив(ВыгрузкаЗагрузкаДанныхСлужебныйСобытия.ПолучитьТипыИсключаемыеИзВыгрузкиЗагрузки());
	
	// в общих методах этот РС ДвоичныеДанныеФайлов исключается - но нам он нужен.
	Индекс = Объекты.Найти(Метаданные.РегистрыСведений.ДвоичныеДанныеФайлов);
	Если Индекс <> Неопределено Тогда
		Объекты.Удалить(Индекс);		
	КонецЕсли;
	
	// Объекты подсистемы DSS в отличие от других конфигураций могут использоваться не только во фреше.
	Индекс = Объекты.Найти(Метаданные.Константы.ИспользоватьСервисDSS);
	Если Индекс <> Неопределено Тогда
		Объекты.Удалить(Индекс);		
	КонецЕсли;
	Индекс = Объекты.Найти(Метаданные.РегистрыСведений.СертификатыПользователяDSS);
	Если Индекс <> Неопределено Тогда
		Объекты.Удалить(Индекс);		
	КонецЕсли;
	
	// Вести внешний обмен в новой версии по умолчанию будет добавлен в лишний по принадлежности к подсистеме миграции.
	// Но на самом деле выгружать нужно.
	Индекс = Объекты.Найти(Метаданные.Константы.ВнешнийОбменВНовойВерсии);
	Если Индекс <> Неопределено Тогда
		Объекты.Удалить(Индекс);		
	КонецЕсли;
	
	Объекты.Добавить(Метаданные.Константы.АдресКриптосервиса);
	Объекты.Добавить(Метаданные.Константы.АдресПрограммногоИнтерфейсаСлужбыПоддержки);
	ДобавитьЛишниеКонстанты(Объекты);
	ДобавитьЛишниеСправочники(Объекты);
	ДобавитьЛишниеРегистрыСведений(Объекты);
	ДобавитьЛишниеПланыОбмена(Объекты);
	
	Объекты.Добавить(Метаданные.Документы.ВходящееСообщениеСВД);
	Объекты.Добавить(Метаданные.Документы.ИсходящееСообщениеСВД);
	Объекты.Добавить(Метаданные.Документы.УведомлениеПоSMS);
	
	ДобавитьОбъектыБиблиотекиРегламентированнойОтчетности(Объекты);
	
	Подсистемы = Новый Массив;
	Подсистемы.Добавить(Метаданные.Подсистемы.ТехнологияСервиса);
	Для Каждого Подсистема Из Подсистемы Цикл
		Для Каждого Объект Из Подсистема.Состав Цикл
			Если Не Метаданные.ОбщиеМодули.Содержит(Объект) Тогда
				Объекты.Добавить(Объект);
			КонецЕсли;
		КонецЦикла;
		Для Каждого Объект Из Подсистема.Подсистемы Цикл
			Подсистемы.Добавить(Объект);
		КонецЦикла;
	КонецЦикла;
	
	// тут прочитаем все метаданные, и исключим с префиксом Удалить.
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Идентификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК Идентификаторы";
	Таблица = Запрос.Выполнить().Выгрузить();	
		
	Для Каждого Выборка Из Таблица Цикл
		
		Попытка				
			Метаданное = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Выборка.Ссылка, Ложь);
			Если Метаданное = Null Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Метаданное, "Имя") Тогда
				Продолжить;
			КонецЕсли;
			
			ПолноеИмя = Метаданное.Имя;
			Если СтрНачинаетсяС(ПолноеИмя, "Удалить") Тогда
				
				Индекс = Объекты.Найти(Метаданное);
				Если Индекс = Неопределено Тогда
					Объекты.Добавить(Метаданное);				
				КонецЕсли;	 
				
			КонецЕсли;	
			
		Исключение
			Продолжить;
		КонецПопытки;	

	КонецЦикла;	
	
	МиграцияДанныхИзВнешнихСистемПереопределяемый.ПриОпределенииЛишнихОбъектов(Объекты);	
	
	Возврат Объекты;
	
КонецФункции

// Вызывается при заполнении очереди объектов к выгрузке.
//
// Параметры:
//  ОбъектМетаданных	 - ОбъектМетаданных - текущий объект метаданных.
//  Отказ				 - Булево - значение использования в выгрузке для переопределения.
//  Последовательность	 - Число - значение последовательности выгрузки для переопределения.
//  Периодичность		 - Булево - применение режима выгрузки по периодам для переопределения. 
//  ПолеПериода			 - ОбъектМетаданных - реквизит объекта для сортировки по периоду для переопределения. 
//  Порция				 - Число - количество элементов в порции выгрузки для переопределения. 
//
Процедура ПриЗаполненииОчередности(ОбъектМетаданных, Отказ, Последовательность, Периодичность, ПолеПериода, Порция) Экспорт
	
	Если Отказ Тогда
		//По умолчанию не выгружается.
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Константы.ДокументооборотИспользоватьОграничениеПравДоступа
		Или ОбъектМетаданных = Метаданные.Константы.ДокументооборотИспользоватьОтложенноеОбновлениеПравДоступа Тогда
		Последовательность = 14;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Календари
		Или ОбъектМетаданных = Метаданные.Справочники.ВидыКонтактнойИнформации Тогда
		
		Последовательность = 15;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ФизическиеЛица
		Или ОбъектМетаданных = Метаданные.Справочники.Должности
		Или ОбъектМетаданных = Метаданные.Справочники.ГрафикиРаботы 
		Или ОбъектМетаданных = Метаданные.Справочники.Контрагенты
		Или ОбъектМетаданных = Метаданные.Справочники.Организации Тогда
		
		Последовательность = 18;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Пользователи Тогда
		
		Последовательность = 19;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РабочиеГруппы Тогда
		
		Последовательность = 20;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОПользователяхДокументооборот Тогда
		Последовательность = 21;

	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ПолномочияПользователей Тогда
		Последовательность = 22;	

	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПрофилиГруппДоступа Тогда
		Последовательность = 23;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СтруктураПредприятия
		Или ОбъектМетаданных = Метаданные.Справочники.БанковскиеСчета Тогда
		Последовательность = 24;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.БезопасноеХранилищеДанных Тогда
		Последовательность = 25;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Константы.ПолитикаУчетаРабочегоВремени Тогда
		Последовательность = 25;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Константы.ИспользоватьДокументыУчетаРабочегоВремени Тогда
		Последовательность = 60;
						
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.УчетныеЗаписиЭлектроннойПочты Тогда
		Последовательность = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ТомаХраненияФайлов Тогда
		Последовательность = 90;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.РазделыНоменклатурыДел Тогда
		Последовательность = 120;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.НоменклатураДел Тогда
		Последовательность = 130;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ДелаХраненияДокументов Тогда
		Последовательность = 140;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПравилаАвтозаполненияФайлов 
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкаСвязей
		Или ОбъектМетаданных = Метаданные.Справочники.ШаблоныКомплексныхБизнесПроцессов Тогда
		Последовательность = 150;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.КонтактныеЛица Тогда
		Последовательность = 150;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.ПланыВидовХарактеристик.ОбъектыАдресацииЗадач Тогда
		Последовательность = 160;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВопросыОбращений
		Или ОбъектМетаданных = Метаданные.Справочники.ТематикиОбращений
		Или ОбъектМетаданных = Метаданные.Справочники.ТемыОбращений
		Или ОбъектМетаданных = Метаданные.Справочники.РазделыОбращений
		Или ОбъектМетаданных = Метаданные.Справочники.ЗаписиРабочегоКалендаря Тогда
		Порция = 1000;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЕжедневныйОтчет Тогда
		Последовательность = 200;
		Периодичность = Истина;
		Порция = 500;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СпискиРассылкиПоКонтрагентам Тогда
		Последовательность = 200;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ПередачаДелВАрхив
		Или ОбъектМетаданных = Метаданные.Документы.УничтожениеДел Тогда 
		Последовательность = 210;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.СправкиСПАРКРиски Тогда 
		Последовательность = 220;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ЕженедельныйОтчет Тогда
		Последовательность = 300;
		Периодичность = Истина;
		Порция = 500;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВерсииФайлов Тогда
		Последовательность = 500;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаСоздания;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Файлы Тогда
		Последовательность = 800;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаСоздания;
		Порция = 100;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.РабочиеГруппыДляПерехода Тогда
		Последовательность = 800;
		Порция = 100;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВнутренниеДокументы Тогда
		Последовательность = 900;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаСоздания;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВходящиеДокументы Тогда
		Последовательность = 900;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаСоздания;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ИсходящиеДокументы Тогда
		Последовательность = 900;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаСоздания;
		Порция = 100;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.НастройкиДоступностиПоСостоянию Тогда
		Последовательность = 2000;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ВходящееПисьмо Тогда
		Последовательность = 900;
		Периодичность = Истина;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.ИсходящееПисьмо Тогда
		Последовательность = 900;
		Периодичность = Истина;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Мероприятия Тогда
		Последовательность = 150; // После основных справочников
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПротоколыМероприятий Тогда
		Последовательность = 160; // После Справочники.Мероприятия
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.Бронь
		Или ОбъектМетаданных = Метаданные.Документы.УведомлениеПоSMS Тогда
		Периодичность = Истина;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗемельныеУчастки Тогда
		Порция = 1000;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВизыСогласования Тогда
		Последовательность = 950;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаИсполнения;
		Порция = 200;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Контроль Тогда
		Последовательность = 2050;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаПостановкиНаКонтроль;
		Порция = 500;
			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыНакопления.РабочееВремяПользователей Тогда
		Порция = 2000;
		Последовательность = 1000;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.СтандартныеРеквизиты.Период;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСроковДействияДокументов Тогда
		
		Последовательность = 1000;
		Периодичность = Истина;
  		ПолеПериода = ОбъектМетаданных.Измерения.ДатаИзменения;
  			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ТекущиеСостоянияДокументов Тогда
		
		Последовательность = 1000;
		Периодичность = Истина;
  		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаУстановки;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналПередачиДокументов Тогда
		
		Последовательность = 1000;
		Периодичность = Истина;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СвязиДокументов Тогда
		
		Последовательность = 1000;
		Периодичность = Истина;
  		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаУстановки;
  			
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ФактическиеТрудозатраты Тогда
		
		Последовательность = 1000;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Измерения.ДатаДобавления;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСостоянийМероприятий
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСостоянийПротоколовМероприятий Тогда
		Периодичность = Истина;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗанятостьПользователя Тогда
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Измерения.ДатаНачала;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НапоминанияПользователя Тогда
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Измерения.ВремяСобытия;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиОтображенияЗаписейРабочегоКалендаря Тогда
		Порция = 1000;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПапкиФорума Тогда
		
		Последовательность = 1200; // Перед ТемыОбсуждений
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ТемыОбсуждений Тогда
		
		Последовательность = 1300; // После ПапкиФорума, перед СообщенияОбсуждений, СведенияОТемахОбсуждений
		Периодичность = Истина;
		ПолеПериода = Метаданные.Справочники.ТемыОбсуждений.Реквизиты.ДатаСоздания;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.СообщенияОбсуждений Тогда
		
		Последовательность = 1400; // После ТемыОбсуждений, перед СообщенияОбсуждений
		Периодичность = Истина;
		ПолеПериода = Метаданные.Справочники.СообщенияОбсуждений.Реквизиты.ДатаСоздания;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОТемахОбсуждений Тогда
		
		Последовательность = 1400; // После ТемыОбсуждений
		Периодичность = Истина;
		ПолеПериода = Метаданные.РегистрыСведений.СведенияОТемахОбсуждений.Ресурсы.ДатаПоследнегоСообщения;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СведенияОГолосовании Тогда
		
		Последовательность = 1500; // После СообщенияОбсуждений
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЭлектронныеПодписи Тогда
		
		Последовательность = 1200;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВидыМероприятий Тогда
		
		Последовательность = 1600; // Перед Мероприятия
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПапкиМероприятий Тогда
		
		Последовательность = 1600; // Перед Мероприятия
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Мероприятия Тогда
		
		// Перед ПротоколыМероприятий, ДанныеМероприятий, ИсторияСостоянийМероприятий,
		//       ИсторияСостоянийПротоколовМероприятий, СостоянияМероприятий, УчастникиМероприятия
		// После ВидыМероприятий, ПапкиМероприятий
		Последовательность = 1700;
		ПолеПериода = Метаданные.Справочники.Мероприятия.Реквизиты.ДатаНачала;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ПротоколыМероприятий Тогда
		
		// После Мероприятия
		Последовательность = 1800; 
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ДанныеМероприятий Тогда
		
		// После Мероприятия
		Последовательность = 1800; 
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСостоянийМероприятий Тогда
		
		// После Мероприятия
		Последовательность = 1800;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСостоянийПротоколовМероприятий Тогда
		
		// После Мероприятия
		Последовательность = 1800;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияМероприятий Тогда
		
		// После Мероприятия
		Последовательность = 1800; 
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.УчастникиМероприятия Тогда
		
		// После Мероприятия
		Последовательность = 1800; 
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.БизнесПроцессы.Исполнение
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Ознакомление
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Поручение
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Приглашение
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Рассмотрение
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Регистрация
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.РешениеВопросовВыполненияЗадач
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Согласование
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.Утверждение Тогда
		
		Последовательность = 1800; // После всех предметов процессов.
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.СтандартныеРеквизиты.Дата;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.БизнесПроцессы.ОбработкаВнутреннегоДокумента
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.ОбработкаВходящегоДокумента
		Или ОбъектМетаданных = Метаданные.БизнесПроцессы.ОбработкаИсходящегоДокумента Тогда
		
		Последовательность = 1810; // После простых процессов.
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.СтандартныеРеквизиты.Дата;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.БизнесПроцессы.КомплексныйПроцесс Тогда
		
		Последовательность = 1820; // После всех других процессов.
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.СтандартныеРеквизиты.Дата;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Задачи.ЗадачаИсполнителя Тогда
		
		Последовательность = 1830; // После всех процессов.
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.СтандартныеРеквизиты.Дата;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.Контроль Тогда
		// После загрузки потенциальных предметов контроля
		Последовательность = 1840;
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Реквизиты.ДатаПостановкиНаКонтроль;
		Порция = 500;
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияВыполненияЗадач Тогда
		Порция = 1000;
		Последовательность = 1840; // Выгружаем после Бизнес-процессов.
	
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ИсторияСобытийЗадач Тогда
		Порция = 1000;
		Последовательность = 1840; // Выгружаем после Бизнес-процессов.
		Периодичность = Истина;
		ПолеПериода = ОбъектМетаданных.Измерения.ДатаСобытия;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЭскалированныеЗадачи Тогда
		Порция = 1000;
		Последовательность = 1840; // после Задач
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ЗначенияПоказателейПроцессов Тогда
		Порция = 1000;
		Периодичность = Истина;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВидыОтсутствий Тогда
		
		// Перед Отсутствие
		Последовательность = 1900;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.Отсутствие Тогда
		
		// После ВидыОтсутствий
		Последовательность = 2000; 
		Периодичность = Истина;
		Порция = 100;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СпособыУведомленияПользователей Тогда
		
		// После ВидыКонтактнойИнформации
		Последовательность = 2200;
		Порция = 100;

	КонецЕсли;
	
	ЗаполнитьОчередностьПереходаОбъектовЭДО(ОбъектМетаданных, Отказ,
		Последовательность, Периодичность, ПолеПериода, Порция);
	
КонецПроцедуры

Процедура ЗаполнитьОчередностьПереходаОбъектовЭДО(ОбъектМетаданных, Отказ,
		Последовательность, Периодичность, ПолеПериода, Порция)
	
	Если Отказ Тогда
		
		Возврат;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Справочники.ВидыДокументовЭДО
		Или ОбъектМетаданных = Метаданные.Справочники.МаршрутыПодписания
		Или ОбъектМетаданных = Метаданные.Справочники.НастройкиЭДО
		Или ОбъектМетаданных = Метаданные.Справочники.НоменклатураКонтрагентов Тогда
		
		Последовательность = 110;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументов Тогда
		
		Последовательность = 910;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиОтправкиДокументовПоЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиПолученияЭлектронныхДокументов
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПравилаУчетаВидовЭДДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиОтправкиЭлектронныхДокументовПоВидам
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиВнутреннегоЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиЗаполненияДополнительныхПолей
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПодписываемыеВидыЭД
		Или ОбъектМетаданных = Метаданные.Документы.ТранспортныйКонтейнерЭДО
		Или ОбъектМетаданных = Метаданные.Документы.ЭлектронныйДокументВходящийЭДО
		Или ОбъектМетаданных = Метаданные.Документы.ЭлектронныйДокументИсходящийЭДО Тогда
		
		Последовательность = 920;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.Документы.СообщениеЭДО Тогда
		
		Последовательность = 930;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.ОбъектыТранспортныхКонтейнеровЭДО
		Или ОбъектМетаданных = Метаданные.Справочники.СообщениеЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.Справочники.ТранспортныйКонтейнерЭДОПрисоединенныеФайлы
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ЖурналДействийПоЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОшибкиЭДОКИсправлению
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДокументыАннулирования
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КонтрольОтраженияВУчетеЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КонтрольПроведенияУчетныхДокументовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.КонтрольСопоставленияНоменклатурыЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОбъектыУчетаДокументовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СоставПакетовДокументовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СоставПакетовЭДОДокументооборот
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостояниеДокументовПоЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияДокументовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияПоОбъектамУчетаЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НеобрабатываемыеПакетыЭД Тогда
		
		Последовательность = 940;
		
	ИначеЕсли ОбъектМетаданных = Метаданные.РегистрыСведений.СостояниеПодписанияЭД
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.АбонентыЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ВариантыУказанияНоменклатурыВДокументахБЭД
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ДанныеКонтрагентовСоздаваемыхБезусловно
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НаличиеНовыхЭлектронныхДокументов
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НастройкиСозданияДокументовАннулирования
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.НоменклатураКонтрагентовБЭД
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьСозданияОбъектовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОшибкиПередачиЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПакетыДокументовЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ПакетыЭДОДокументооборот
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостояниеОрганизацийБЭД
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияКонтрагентовБЭД
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияОбменовЭДЧерезОператоровЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.СостоянияСинхронизацииСервисНастроекЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.УчетныеЗаписиЭДО
		Или ОбъектМетаданных = Метаданные.РегистрыСведений.ОчередьПриемаСообщенийЭДО Тогда
		
		Последовательность = 950;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Выгрузка

// Вызывается перед выгрузкой полученой порции данных в файл.
// Рекомендуется для добавления вложенных коллекций значений.
//
// Параметры:
//  Метаданное	 - ОбъектМетаданных - выгружаемый объект.
//  Выгрузка	 - ТаблицаЗначений - выгружаемые данные объекта.
//
Процедура ПередВыгрузкой(Метаданное, Выгрузка) Экспорт
	
	Если Метаданное = Метаданные.Документы.Отсутствие Тогда
		
		ТекстШапкиЗаместителейВКоментарии =
			НСтр("ru = '***
				|Замещают:'");
	
		Для Каждого СтрокаОтсутствия Из Выгрузка Цикл
			
			ПодстрокиКомментария = Новый Массив;
			Если ЗначениеЗаполнено(СтрокаОтсутствия.Комментарий) Тогда
				ПодстрокиКомментария.Добавить(Символы.ПС + Символы.ПС);
			КонецЕсли;
			
			Если СтрокаОтсутствия.Заместители = Null Тогда
				Продолжить;
			КонецЕсли;
			
			ПодстрокиКомментария.Добавить(ТекстШапкиЗаместителейВКоментарии);
			Для Каждого СтрокаЗаместителя Из СтрокаОтсутствия.Заместители Цикл
				ПодстрокиКомментария.Добавить(Символы.ПС);
				ПодстрокиКомментария.Добавить(СтрокаЗаместителя.Заместитель);
				Если ЗначениеЗаполнено(СтрокаЗаместителя.Комментарий) Тогда
					ПодстрокиКомментария.Добавить(", ");
					ПодстрокиКомментария.Добавить(СтрокаЗаместителя.Комментарий);
				КонецЕсли;
			КонецЦикла;
			СтрокаОтсутствия.Комментарий = СтрокаОтсутствия.Комментарий + СтрСоединить(ПодстрокиКомментария);
			
		КонецЦикла;
		
		Выгрузка.Колонки.Удалить("Заместители");
		
	ИначеЕсли Метаданное = Метаданные.РегистрыСведений.НастройкаСвязей Тогда
			
		Выгрузка.Колонки.Добавить("КорреспонденцияИз");
		Выгрузка.Колонки.Добавить("КорреспонденцияНа");
		
		Для Каждого СтрокаСвязи Из Выгрузка Цикл
			
			КорреспонденцияИз = "";
			КорреспонденцияНа = "";
			
			Если ТипЗнч(СтрокаСвязи.СсылкаИз) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
				КорреспонденцияИз = "ВходящиеДокументы";
			ИначеЕсли ТипЗнч(СтрокаСвязи.СсылкаИз) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
				КорреспонденцияИз = "ИсходящиеДокументы";
			КонецЕсли;	

			Если ТипЗнч(СтрокаСвязи.СсылкаНа) = Тип("СправочникСсылка.ВидыВходящихДокументов") Тогда
				КорреспонденцияНа = "ВходящиеДокументы";
			ИначеЕсли ТипЗнч(СтрокаСвязи.СсылкаНа) = Тип("СправочникСсылка.ВидыИсходящихДокументов") Тогда
				КорреспонденцияНа = "ИсходящиеДокументы";
			КонецЕсли;
				
			СтрокаСвязи.КорреспонденцияИз = КорреспонденцияИз;
			СтрокаСвязи.КорреспонденцияНа = КорреспонденцияНа;
			
		КонецЦикла;	
		
	ИначеЕсли Метаданное = Метаданные.Справочники.ГрифыДоступа
		Или Метаданное = Метаданные.Справочники.ГруппыДоступаКонтрагентов
		Или Метаданное = Метаданные.Справочники.ГруппыДоступаФизическихЛиц Тогда
		
		МиграцияДанныхИзВнешнихСистемДокументооборот.ДополнитьГрифыИГруппыДоступаТаблицамиУчастников(
			Выгрузка, Метаданное);
			
	ИначеЕсли Метаданное = Метаданные.Справочники.Файлы Тогда
		
		МиграцияДанныхИзВнешнихСистемДокументооборот.ПриВыгрузкеФайлов(Выгрузка);
		
	ИначеЕсли Метаданное = Метаданные.Справочники.ВерсииФайлов Тогда
		
		МиграцияДанныхИзВнешнихСистемДокументооборот.ПриВыгрузкеВерсийФайлов(Выгрузка);
	
	ИначеЕсли Метаданное = Метаданные.Справочники.СообщениеЭДОПрисоединенныеФайлы Тогда
		
		МиграцияДанныхИзВнешнихСистемДокументооборот.ПриВыгрузкеПрисоединенныхФайловСообщенийЭДО(Выгрузка);
	
	ИначеЕсли Метаданное = Метаданные.Справочники.ВидыВходящихДокументов 
		Или Метаданное = Метаданные.Справочники.ВидыИсходящихДокументов
		Или Метаданное = Метаданные.Справочники.ВидыВнутреннихДокументов Тогда
			
		МиграцияДанныхИзВнешнихСистемДокументооборот.ДополнитьВидыДокументовПравамиНаСоздание(Выгрузка,
			Метаданное);

	ИначеЕсли Метаданное = Метаданные.Справочники.НаборыДополнительныхРеквизитовИСведений Тогда
		
		МиграцияДанныхИзВнешнихСистемДокументооборот.ДополнитьДопРеквизитыРодителями(Выгрузка);
	
	ИначеЕсли Метаданное = Метаданные.Справочники.НастройкиДоступностиПоСостоянию Тогда
	
		Выгрузка.Колонки.Добавить("ИсходныйТипДокумента");
		Для Каждого Строка Из Выгрузка Цикл
			Строка.ИсходныйТипДокумента = Строка(Строка.ТипДокумента);
		КонецЦикла;
		
	ИначеЕсли Метаданное = Метаданные.РегистрыСведений.НастройкиПравОбъектов Тогда
		
		Участники = Выгрузка.ВыгрузитьКолонку("Пользователь");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "Выбрать
		|	Пользователи.Ссылка
		|Из
		|	Справочник.Пользователи КАК Пользователи
		|Где
		|	Пользователи.Ссылка В (&Участники)
		|	И Пользователи.Служебный";
		Запрос.УстановитьПараметр("Участники", Участники);
		СлужебныеПользователи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Для Каждого Служебный Из СлужебныеПользователи Цикл
			Строки = Выгрузка.НайтиСтроки(Новый Структура("Пользователь", Служебный));
			Для Каждого Строка Из Строки Цикл
				Выгрузка.Удалить(Строка);
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед формированием запроса на выгрузку порции данных.
// Рекомендуется для изменения состава полей выгрузки.
//
// Параметры:
//  Метаданное	 - ОбъектМетаданных - выгружаемый объект.
//  Поля		 - ТаблицаЗначений - перечень реквизитов и табличных частей объекта метаданных. См. МиграцияДанныхИзВнешнихСистемСервер.ЗапросВыгрузки().
//
Процедура ПриОпределенииПолейВыгрузки(Метаданное, Поля) Экспорт
	
	Если Метаданное = Метаданные.Документы.Отсутствие Тогда
		
		СтрокаПериодСтрокой =  Поля.Найти(
			Метаданные.Документы.Отсутствие.Реквизиты.ПериодСтрокой,
			"Реквизит");
		Поля.Удалить(СтрокаПериодСтрокой);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет произвольные служебные данные в начале выгрузки. 
//
// Параметры:
//  Буфер		 - Структура - Ключ: Имя коллекции данных; Значение: таблица значений.
//  Настройки	 - Структура - кэш общих настроек обмена и служебных данных текущего сообщения.
//  Изменения	 - МенеджерВременныхТаблиц - таблица изменённых объектов, при выгрузке пакета изменений. См. ОтметкиВремени.ВыбратьИзменения().
//
Процедура ЗаполнитьПредисловие(Буфер, Настройки, Изменения = Неопределено) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьОбъектыБиблиотекиРегламентированнойОтчетности(Объекты)
	
	// Объекты ДО
	Объекты.Добавить(Метаданные.Константы.ИспользоватьОтчетностьВКонтролирующиеОрганы);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаУчетаДокументовОбменСКО);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОДокументахОбменСКО);
	
	// Библиотечные объекты
	Объекты.Добавить(Метаданные.Константы.АвтоматическиПодключатьФормыРОЧерезМеханизмОнлайнСервисовРО);
	Объекты.Добавить(Метаданные.Константы.АдресСервераСбораОтчетностиРосстата);
	Объекты.Добавить(Метаданные.Константы.АдресСервераСдачиОтчетности);
	Объекты.Добавить(Метаданные.Константы.АдресСервисаНаправленийСдачиОтчетности);
	Объекты.Добавить(Метаданные.Константы.АдресСервисаФормированияМЧБсPDF417);
	Объекты.Добавить(Метаданные.Константы.ДатаЗагрузкиБазы);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ВерсияВнешнегоМодуля);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ВнешнийМодуль);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ИмяКриптопровайдера);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ИспользоватьВнешнийМодуль);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ОтпечатокСертификатаОнлайнПроверки);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_РежимТестирования);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_СертификатСервераОнлайнПроверки);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотСКонтролирующимиОрганами_ТипКриптопровайдера);
	Объекты.Добавить(Метаданные.Константы.ЗапрещатьРедактированиеФормРеглОтчетности);
	Объекты.Добавить(Метаданные.Константы.ИмяПользователяСервисаФормированияМЧБсPDF417);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьМеханизмОнлайнСервисовРО);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСервисФормированияМЧБсPDF417);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСервисФормированияМЧБсPDF417ТолькоВРежимеВебКлиента);
	Объекты.Добавить(Метаданные.Константы.МодельРаботыСКлючамиПередВыгрузкой);
	Объекты.Добавить(Метаданные.Константы.НастройкиФорматаВыгрузкиОтчетовСтатистики);
	Объекты.Добавить(Метаданные.Константы.ПарольПользователяСервисаФормированияМЧБсPDF417);
	Объекты.Добавить(Метаданные.Константы.ПереносСообщений1СОтчетностиВПрисоединенныеФайлыПериодПовтора);
	Объекты.Добавить(Метаданные.Константы.ПредельноеКоличествоЗаписейВРазделеДекларацииПоНДС);
	Объекты.Добавить(Метаданные.Константы.РеквизитыДоверенности);
	Объекты.Добавить(Метаданные.Константы.УведомлятьОбОшибкахМеханизмаОнлайнСервисовРО);
	
	Объекты.Добавить(Метаданные.Справочники.ВидыНалоговыхОрганов);
	Объекты.Добавить(Метаданные.Справочники.ВидыОтправляемыхДокументов);
	Объекты.Добавить(Метаданные.Справочники.ДоверенностиНалогоплательщика);
	Объекты.Добавить(Метаданные.Справочники.ДокументыРеализацииПолномочийНалоговыхОрганов);
	Объекты.Добавить(Метаданные.Справочники.ЗаявлениеАбонентаСпецоператораСвязиПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.ЗаявлениеОНазначенииПенсии);
	Объекты.Добавить(Метаданные.Справочники.ЗаявлениеОНазначенииПенсииПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.МакетыПенсионныхДел);
	Объекты.Добавить(Метаданные.Справочники.МакетыПенсионныхДелПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.НалоговыеОрганы);
	Объекты.Добавить(Метаданные.Справочники.НаправленияСдачиОтчетности);
	Объекты.Добавить(Метаданные.Справочники.ОписиВходящихДокументовИзНалоговыхОрганов);
	Объекты.Добавить(Метаданные.Справочники.ОписиИсходящихДокументовВНалоговыеОрганы);
	Объекты.Добавить(Метаданные.Справочники.ОрганыПФР);
	Объекты.Добавить(Метаданные.Справочники.ОрганыФСГС);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиБанкРоссии);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиМинобороны);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиОтчетности);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиРПН);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиФСРАР);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиФСС);
	Объекты.Добавить(Метаданные.Справочники.ОтправкиФТС);
	Объекты.Добавить(Метаданные.Справочники.ПерепискаСКонтролирующимиОрганами);
	Объекты.Добавить(Метаданные.Справочники.ПерепискаСКонтролирующимиОрганамиПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.РегистрацииВНалоговомОргане);
	Объекты.Добавить(Метаданные.Справочники.РегламентированныеОтчеты);
	Объекты.Добавить(Метаданные.Справочники.РегламентированныйОтчетПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.СеансыСвязиСКонтролирующимиОрганами);
	Объекты.Добавить(Метаданные.Справочники.СерверыДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.СканированныеДокументыДляПередачиВЭлектронномВиде);
	Объекты.Добавить(Метаданные.Справочники.СканированныеДокументыДляПередачиВЭлектронномВидеПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.СобытияОтправкиОтчетности);
	Объекты.Добавить(Метаданные.Справочники.ТранспортноеСообщениеКонтейнерыПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.ТранспортноеСообщениеПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.УведомлениеОСпецрежимахНалогообложенияПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.УдалитьВидыНалоговыхОрганов);
	Объекты.Добавить(Метаданные.Справочники.УдалитьВидыОтправляемыхДокументов);
	Объекты.Добавить(Метаданные.Справочники.УдалитьДокументыРеализацииПолномочийНалоговыхОрганов);
	Объекты.Добавить(Метаданные.Справочники.УдалитьНалоговыеОрганы);
	Объекты.Добавить(Метаданные.Справочники.УдалитьОрганыПФР);
	Объекты.Добавить(Метаданные.Справочники.УдалитьОтправкиФСС);
	Объекты.Добавить(Метаданные.Справочники.УдалитьПерепискаСКонтролирующимиОрганами);
	Объекты.Добавить(Метаданные.Справочники.УдалитьРегламентированныеОтчеты);
	Объекты.Добавить(Метаданные.Справочники.УдалитьСерверыДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.УдалитьУчетныеЗаписиДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.УдалитьЭлектронныеПредставленияРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.Справочники.УчетныеЗаписиДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.ЦиклыОбмена);
	Объекты.Добавить(Метаданные.Справочники.ЭлектронныеПредставленияРегламентированныхОтчетов);
	
	Объекты.Добавить(Метаданные.Документы.ВыгрузкаРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.Документы.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП);
	Объекты.Добавить(Метаданные.Документы.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика);
	Объекты.Добавить(Метаданные.Документы.ЗапросНаИнформационноеОбслуживаниеСтрахователя);
	Объекты.Добавить(Метаданные.Документы.ЗаявкиНаЛьготныйКредит);
	Объекты.Добавить(Метаданные.Документы.ЗаявлениеАбонентаСпецоператораСвязи);
	Объекты.Добавить(Метаданные.Документы.ЗаявленияПоЭлДокументооборотуСПФР);
	Объекты.Добавить(Метаданные.Документы.ПоясненияКДекларацииПоНДС);
	Объекты.Добавить(Метаданные.Документы.РегламентированныйОтчет);
	Объекты.Добавить(Метаданные.Документы.ТранспортноеСообщение);
	Объекты.Добавить(Метаданные.Документы.УведомлениеОПолучателеДокументов);
	Объекты.Добавить(Метаданные.Документы.УведомлениеОСпецрежимахНалогообложения);
	Объекты.Добавить(Метаданные.Документы.УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП);
	Объекты.Добавить(Метаданные.Документы.УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика);
	Объекты.Добавить(Метаданные.Документы.УдалитьЗаявлениеАбонентаСпецоператораСвязи);
	
	Объекты.Добавить(Метаданные.РегистрыСведений.АрхивДанныхРегламентированнойОтчетности);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВложенияНеформализованныхДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВходящиеСообщенияСЭДОФСС);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДокументыПоТребованиюФНС);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДополнительныеРеквизитыУчетнойЗаписи);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДополнительныеРеквизитыУчетнойЗаписиПолучатели);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДополнительныеФайлыРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналЗапросовКСерверамФСС);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналНовыхСобытий);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналОтправокВКонтролирующиеОрганы);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналОтчетовСтатусы);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналПереданнойОтчетностиВБанк);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналПередачиОтчетностиВБанк);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсключенныеИзОбработкиСертификаты);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсключенныеИзОбработкиТранспортныеСообщения);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиИнтеграцииСоСпринтером);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаБанкРоссии);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаМинобороны);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаРПН);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаФСРАР);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаФСС);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаФТС);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОтправкиОтчетностиВБанк);
	Объекты.Добавить(Метаданные.РегистрыСведений.НеобрабатываемыеТранспортныеСообщения);
	Объекты.Добавить(Метаданные.РегистрыСведений.НумераторПачекПФР);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтветыНаЗапросыИОН);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтветыНаЗапросыИОС);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтправкиОтчетностиКОбработке);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтчетыПереданныеВСПАРК);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПакетыОтчетности);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПечатныеБланкиРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПользователиУчетныхЗаписейДокументооборота);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПоследняяПопыткаРасшифровкиТранспортногоСообщения);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаОтправкиОтчетностиПоФизЛицам);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПризнакиАрхивированияФайловДОСКонтролирующимиОрганами);
	Объекты.Добавить(Метаданные.РегистрыСведений.РесурсыМеханизмаОнлайнСервисовРО);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоЖурнал);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоЛицензии);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил11Раздел1);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил11Раздел2);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил12Раздел1);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил12Раздел2);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил13Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил14Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил15Поставщики);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил15Производство);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил16Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил17Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил18Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил27Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил28Декларация);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил29Поставщики);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияРеглОтчетАлкоПрил29Производство);
	Объекты.Добавить(Метаданные.РегистрыСведений.СвойстваТранспортныхСообщений);
	Объекты.Добавить(Метаданные.РегистрыСведений.СертификатыПереданныеПФР);
	Объекты.Добавить(Метаданные.РегистрыСведений.СкрытыеРегламентированныеОтчеты);
	Объекты.Добавить(Метаданные.РегистрыСведений.СобытияКалендаряБухгалтера);
	Объекты.Добавить(Метаданные.РегистрыСведений.СодержимоеТранспортныхКонтейнеров);
	Объекты.Добавить(Метаданные.РегистрыСведений.СоответствиеРегОтчетовУведомлениям);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостояниеПодключенияКЭДОсПФР);
	Объекты.Добавить(Метаданные.РегистрыСведений.СтатусыОтправки);
	Объекты.Добавить(Метаданные.РегистрыСведений.СчетчикВыгрузокОтчетностиВБанк);
	Объекты.Добавить(Метаданные.РегистрыСведений.СчетчикиВыгрузок);
	Объекты.Добавить(Метаданные.РегистрыСведений.ТранспортныеКонтейнеры);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьВложенияНеформализованныхДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьДополнительныеФайлыУведомлений);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиОбменаФСС);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНепрочтеннаяПерепискаСКонтролирующимиОрганами);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьОтветыНаЗапросыИОН);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьРесурсыМеханизмаОнлайнСервисовРО);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьСтатусыРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьФайлыДокументовРеализацииПолномочийНалоговыхОрганов);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьФайлыСведенийРОКИ);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьФайлыСведенийСпецоператоры);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьХранилищеЭлектронныхПредставленийРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыСведенийРОКИ);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыСведенийСпецоператоры);
	Объекты.Добавить(Метаданные.РегистрыСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ШаблоныПечатиМашиночитаемыхФорм);
	Объекты.Добавить(Метаданные.РегистрыСведений.ШаблоныЭВФОтчетовСтатистики);
	
КонецПроцедуры

Процедура ДобавитьЛишниеКонстанты(Объекты)
	
	Объекты.Добавить(Метаданные.Константы.АвтоматическиНастраиватьРазрешенияВПрофиляхБезопасности);
	Объекты.Добавить(Метаданные.Константы.АдресатыПолученияОтчетаПоЖурналуРегистрации);
	Объекты.Добавить(Метаданные.Константы.АдресДляВосстановленияПароляУчетнойЗаписи);
	Объекты.Добавить(Метаданные.Константы.АдресКриптосервиса);
	Объекты.Добавить(Метаданные.Константы.АдресПрограммногоИнтерфейсаСлужбыПоддержки);
	Объекты.Добавить(Метаданные.Константы.АдресПубликацииИнформационнойБазыВИнтернете);
	Объекты.Добавить(Метаданные.Константы.АдресПубликацииИнформационнойБазыВЛокальнойСети);
	Объекты.Добавить(Метаданные.Константы.АдресПубликацииНаВебСервере);
	Объекты.Добавить(Метаданные.Константы.АдресСервисаНовостей);
	Объекты.Добавить(Метаданные.Константы.АдресСервисаПодключенияЭлектроннойПодписиВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.АдресСервисаЦентраИдей);
	Объекты.Добавить(Метаданные.Константы.АдресУправленияКонференцией);
	Объекты.Добавить(Метаданные.Константы.АдресЦКК);
	Объекты.Добавить(Метаданные.Константы.БлокировкаОтправкиБыстрыхСообщений);
	Объекты.Добавить(Метаданные.Константы.ВариантОбновленияКлассификаторов);
	Объекты.Добавить(Метаданные.Константы.ВерсияКлассификатораБанков);
	Объекты.Добавить(Метаданные.Константы.ВнешнийАдресУправляющегоПриложения);
	Объекты.Добавить(Метаданные.Константы.ВнутреннийАдресМенеджераСервиса);
	Объекты.Добавить(Метаданные.Константы.ВыполнитьРезервноеКопированиеОбластиДанных);
	Объекты.Добавить(Метаданные.Константы.ГлавныйУзел);
	Объекты.Добавить(Метаданные.Константы.ДанныеДляОтложенногоОбновления);
	Объекты.Добавить(Метаданные.Константы.ДатаОбновленияПовторноИспользуемыхЗначенийМРО);
	
	Объекты.Добавить(Метаданные.Константы.ДатаНачалаВыгрузкиВоВнешнююСистему);
	Объекты.Добавить(Метаданные.Константы.ДатаПоследнегоОбновленияВсегоЗаписейДляВыгрузки);
	
	Объекты.Добавить(Метаданные.Константы.ДатаЗагрузкиОписанияФорматовДляПреобразования);
	Объекты.Добавить(Метаданные.Константы.ДатаПоследнегоОбновленияКлассификатораОшибок);
	Объекты.Добавить(Метаданные.Константы.ДатаПоследнегоСтартаКлиентскогоСеанса);
	Объекты.Добавить(Метаданные.Константы.ДатаПоследнейВыгрузкиЗамеровПроизводительностиUTC);
	Объекты.Добавить(Метаданные.Константы.ДатаУведомленияОЗавершенныхЗадачах);
	Объекты.Добавить(Метаданные.Константы.ДетализироватьОбновлениеИБВЖурналеРегистрации);
	Объекты.Добавить(Метаданные.Константы.ДокументооборотИспользоватьОтложенноеОбновлениеПравДоступа);
	Объекты.Добавить(Метаданные.Константы.ДоменРасположенияСерверовИПП);
	Объекты.Добавить(Метаданные.Константы.ЗаголовокСистемы);
	Объекты.Добавить(Метаданные.Константы.ЗагружатьИУстанавливатьИсправленияАвтоматически);
	Объекты.Добавить(Метаданные.Константы.ЗагрузитьРасширенияИзменяющиеСтруктуруДанных);
	Объекты.Добавить(Метаданные.Константы.ЗагрузитьСообщениеОбменаДанными);
	Объекты.Добавить(Метаданные.Константы.ЗарегистрированыИзмененияДанных);
	Объекты.Добавить(Метаданные.Константы.ИдентификаторИнформационнойБазы);
	Объекты.Добавить(Метаданные.Константы.ИзменятьЗаданияЗаднимЧислом);
	Объекты.Добавить(Метаданные.Константы.ИнформацияОПроцедуреЗагрузки);
	Объекты.Добавить(Метаданные.Константы.ИспользованиеКаталогаДополнительныхОтчетовИОбработокВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.ИспользованиеКаталогаРасширенийВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьАвтономнуюРаботуВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьАльтернативныйСерверДляЗагрузкиКурсовВалют);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВерсионированиеОбъектов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВидыВнутреннихДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВидыВходящихДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВидыДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВидыИсходящихДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВнешнихПользователей);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьВыгрузкуВСводноеПриложение);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьГруппыПользователей);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьДифференциальноеРезервноеКопирование);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьИнтеграциюССистемойВзаимодействия);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьОнлайнПоддержку);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьКонтрольТарификации);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьМобильныеКлиенты);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьОчередьСообщений);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьОтправкуSMSВШаблонахСообщений);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьПризнакРассмотрено);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьПроверкуКонтрагентов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьПрофилиБезопасностиДляДОО);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьПрофилиБезопасностиДляРасширений);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьПрямойОбменЭлектроннымиДокументами);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьРазделениеПоОбластямДанных);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьРаздельноеИсполнениеПунктовПротоколаМероприятия);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСВД);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСервисПереводаТекста);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСервисСПАРКРиски);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюДанных);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВЛокальномРежиме);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВМоделиСервисаСЛокальнойПрограммой);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюДанныхВМоделиСервисаСПриложениемВИнтернете);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСинхронизациюСИнтегрированнымиСистемами);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьСкрытиеПерсональныхДанныхСубъектов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьУчетДоступаКПерсональнымДанным);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьФайлыУВходящихДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьФайлыУИсходящихДокументов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьЭлектроннуюПодписьВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьЭлектроннуюПочтуВШаблонахСообщений);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьШаблоныСообщений);
	
	Объекты.Добавить(Метаданные.Константы.ИспользоватьФоновуюМаршрутизациюКомплексныхПроцессов);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьФоновоеВыполнениеЗадач);
	
	Объекты.Добавить(Метаданные.Константы.ИспользуетсяМиграцияПриложений);
	Объекты.Добавить(Метаданные.Константы.ИспользуютсяПрофилиБезопасности);
	Объекты.Добавить(Метаданные.Константы.ИсточникДанныхАдресногоКлассификатора);
	Объекты.Добавить(Метаданные.Константы.КаталогОбменаФайламиВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.КаталогОбменаФайламиВМоделиСервисаLinux);
	Объекты.Добавить(Метаданные.Константы.КаталогСообщенийОбменаДаннымиДляLinux);
	Объекты.Добавить(Метаданные.Константы.КаталогСообщенийОбменаДаннымиДляWindows);
	Объекты.Добавить(Метаданные.Константы.КаталогРасширенийКоличествоЭлементовВВыборке);
	Объекты.Добавить(Метаданные.Константы.КаталогРасширенийОтправлятьПревьюПриЗапросеСписка);
	Объекты.Добавить(Метаданные.Константы.КлассификаторОшибокКриптографии);
	Объекты.Добавить(Метаданные.Константы.КлючОбластиДанных);
	Объекты.Добавить(Метаданные.Константы.КоличествоЗамеровВПакетеЭкспорта);
	Объекты.Добавить(Метаданные.Константы.КоличествоПотоковОбновленияИнформационнойБазы);
	Объекты.Добавить(Метаданные.Константы.КоличествоЭлементовВТранзакцииЗагрузкиДанных);
	Объекты.Добавить(Метаданные.Константы.КонечнаяТочкаМенеджераСервиса);
	Объекты.Добавить(Метаданные.Константы.КопироватьОбластиДанныхИзЭталонной);
	Объекты.Добавить(Метаданные.Константы.ЛогироватьЗапускиЗаданийОчереди);
	Объекты.Добавить(Метаданные.Константы.МаксимальнаяДлительностьВыполненияИсполняющегоФоновогоЗадания);
	Объекты.Добавить(Метаданные.Константы.МаксимальноеКоличествоИсполняющихФоновыхЗаданий);
	Объекты.Добавить(Метаданные.Константы.МинимальныйИнтервалРегламентныхЗаданийДОИОВМоделиСервиса);
	
	Объекты.Добавить(Метаданные.Константы.МиграцияНаНовуюВерсию);
	
	Объекты.Добавить(Метаданные.Константы.НастройкаПроксиСервера);
	Объекты.Добавить(Метаданные.Константы.НастройкиВходаПользователей);
	Объекты.Добавить(Метаданные.Константы.НастройкиКолонтитулов);
	Объекты.Добавить(Метаданные.Константы.НастройкиРасчетаРазмераПриложений);
	Объекты.Добавить(Метаданные.Константы.НастройкаПодчиненногоУзлаРИБЗавершена);
	Объекты.Добавить(Метаданные.Константы.НастройкиПодчиненногоУзлаРИБ);
	Объекты.Добавить(Метаданные.Константы.НезависимоеИспользованиеДополнительныхОтчетовИОбработокВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.НезависимоеИспользованиеРасширенийВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных);
	Объекты.Добавить(Метаданные.Константы.ОбсужденияПодключены);
	Объекты.Добавить(Метаданные.Константы.ОтложенноеОбновлениеВГлавномУзлеЗавершеноУспешно);
	Объекты.Добавить(Метаданные.Константы.ОтложенноеОбновлениеДоступа);
	Объекты.Добавить(Метаданные.Константы.ОтложенноеОбновлениеЗавершеноУспешно);
	Объекты.Добавить(Метаданные.Константы.ОценкаПроизводительностиПериодЗаписи);
	Объекты.Добавить(Метаданные.Константы.ОценкаПроизводительностиЭкспортВсехКлючевыхОпераций);
	Объекты.Добавить(Метаданные.Константы.ПараметрыАдминистрированияИБ);
	Объекты.Добавить(Метаданные.Константы.ПараметрыАдресногоКлассификатора);
	Объекты.Добавить(Метаданные.Константы.ПараметрыБазовойФункциональности);
	Объекты.Добавить(Метаданные.Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами);
	Объекты.Добавить(Метаданные.Константы.ПараметрыЗапускаИнтерактивнойПроцедурыЗагрузки);
	Объекты.Добавить(Метаданные.Константы.ПараметрыРезервногоКопирования);
	Объекты.Добавить(Метаданные.Константы.ПараметрыЦентраМониторинга);
	Объекты.Добавить(Метаданные.Константы.ПериодХраненияЗамеров);
	Объекты.Добавить(Метаданные.Константы.ПериодХраненияИсторииЗапусковЗаданийОчереди);
	Объекты.Добавить(Метаданные.Константы.ПоддержкаРезервногоКопирования);
	Объекты.Добавить(Метаданные.Константы.ПредставлениеОбластиДанных);
	Объекты.Добавить(Метаданные.Константы.ПрефиксОбластиДанных);
	Объекты.Добавить(Метаданные.Константы.ПрефиксСервисаДляНовостей);
	Объекты.Добавить(Метаданные.Константы.ПовторитьЗагрузкуСообщенияОбменаДаннымиПередЗапуском);
	Объекты.Добавить(Метаданные.Константы.ПрефиксПоследнегоАвтономногоРабочегоМеста);
	Объекты.Добавить(Метаданные.Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы);
	Объекты.Добавить(Метаданные.Константы.ПриоритетОбновленияВОбластяхДанных);
	Объекты.Добавить(Метаданные.Константы.ПроверятьСоответствиеРабочихГруппОбщимНастройкам);
	Объекты.Добавить(Метаданные.Константы.ПрофильБезопасностиИнформационнойБазы);
	Объекты.Добавить(Метаданные.Константы.РаздельныйУчетДокументов);
	Объекты.Добавить(Метаданные.Константы.РазмерБлокаПередачиФайла);
	Объекты.Добавить(Метаданные.Константы.РазрешитьВыполнениеДООРегламентнымиЗаданиямиВМоделиСервиса);
	Объекты.Добавить(Метаданные.Константы.РазрешитьРучноеИзменениеСостоянияДокументов);
	Объекты.Добавить(Метаданные.Константы.РежимИспользованияИнформационнойБазы);
	Объекты.Добавить(Метаданные.Константы.СведенияОБлокируемыхОбъектах);
	Объекты.Добавить(Метаданные.Константы.СведенияОбОбновленииИБ);
	Объекты.Добавить(Метаданные.Константы.СвойстваСПАРКРиски);
	Объекты.Добавить(Метаданные.Константы.СервисПереводаТекста);
	Объекты.Добавить(Метаданные.Константы.СинхронизироватьФайлы);
	Объекты.Добавить(Метаданные.Константы.СинхронизироватьДанныеСПриложениемВИнтернетеПриЗавершенииРаботыПрограммы);
	Объекты.Добавить(Метаданные.Константы.СинхронизироватьДанныеСПриложениемВИнтернетеПриНачалеРаботыПрограммы);
	Объекты.Добавить(Метаданные.Константы.СоздаватьАвточатыДляПодразделений);
	Объекты.Добавить(Метаданные.Константы.СообщениеБлокировкиПриОбновленииКонфигурации);
	Объекты.Добавить(Метаданные.Константы.СообщениеОбменаДаннымиИзГлавногоУзла);
	Объекты.Добавить(Метаданные.Константы.СостояниеВыполненияРегламентныхЗаданий);
	Объекты.Добавить(Метаданные.Константы.СостояниеОбновленияПравДоступаПослеОбновления);
	Объекты.Добавить(Метаданные.Константы.СпецРазрешенияВПолитикахДоступа);
	Объекты.Добавить(Метаданные.Константы.СтатусОбновленияКонфигурации);
	Объекты.Добавить(Метаданные.Константы.ТипыИнцидентовЦККАктуальны);
	Объекты.Добавить(Метаданные.Константы.УдалитьЗапрещатьВходВПрограммуБезПароля);
	Объекты.Добавить(Метаданные.Константы.УдалитьКонтекстАвторизации);
	Объекты.Добавить(Метаданные.Константы.УдалитьКонтекстКриптографии);
	Объекты.Добавить(Метаданные.Константы.УдалитьЛогинДоступаКСервисуMorpher);
	Объекты.Добавить(Метаданные.Константы.УдалитьНаименованиеПредприятия);
	Объекты.Добавить(Метаданные.Константы.УдалитьПлательщикНДС);
	Объекты.Добавить(Метаданные.Константы.УдалитьПроверятьСложностьПароля);
	Объекты.Добавить(Метаданные.Константы.УдалитьРуководительАрхива);
	Объекты.Добавить(Метаданные.Константы.УдалитьРуководительПредприятия);
	Объекты.Добавить(Метаданные.Константы.УдалитьРуководительСлужбыДОУ);
	Объекты.Добавить(Метаданные.Константы.УдалитьТипХраненияФайлов);
	Объекты.Добавить(Метаданные.Константы.УчетнаяЗаписьДляВосстановленияПароля);
	Объекты.Добавить(Метаданные.Константы.УчитыватьИсполнениеВКарточкеДокументов);
	Объекты.Добавить(Метаданные.Константы.ФайлКлассификаторов);
	Объекты.Добавить(Метаданные.Константы.ФактическийИсполнительЗадач);
	Объекты.Добавить(Метаданные.Константы.ЧасовойПоясОбластиДанных);
	Объекты.Добавить(Метаданные.Константы.ЭтоАвтономноеРабочееМесто);
	Объекты.Добавить(Метаданные.Константы.ЯвляетсяСерверомСВД);
	
	Объекты.Добавить(Метаданные.Константы.ВариантИспользованияPushУведомлений);
	Объекты.Добавить(Метаданные.Константы.ДатаПоследнейОтправкиPushУведомлений);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьAPNS);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьFCM);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьPushУведомления);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьМобильныеКлиенты);
	Объекты.Добавить(Метаданные.Константы.КлючCервераОтправителяFCM);
	Объекты.Добавить(Метаданные.Константы.КодОтправителяСервисаПередачиУведомлений1СМК);
	Объекты.Добавить(Метаданные.Константы.ЛогинСервисаПередачиУведомлений1С);
	Объекты.Добавить(Метаданные.Константы.СертификатМобильногоПриложенияДляiOS);
	Объекты.Добавить(Метаданные.Константы.АдресПубликации1СДО30);
	Объекты.Добавить(Метаданные.Константы.ИмяПользователя1СДО30);
	Объекты.Добавить(Метаданные.Константы.РегистрацияВ1СДО30);
	
	Объекты.Добавить(Метаданные.Константы.ИспользоватьФоновыйСтартПроцессов);
	
	Объекты.Добавить(Метаданные.Константы.ПороговыйКоэффициентДляЗаписиПравПоштучно);
	
	Объекты.Добавить(Метаданные.Константы.ОтключитьАвтоматическоеДовериеПолнымПолномочиям);
	Объекты.Добавить(Метаданные.Константы.ОтключитьПодборМЧДПоКПППриПодписанииИПроверке);
	
	Объекты.Добавить(Метаданные.Константы.НастройкиПолученияУведомленийПортала);
	Объекты.Добавить(Метаданные.Константы.ИспользоватьОценкуПроизводительностиСинхронизацииДанных);
	Объекты.Добавить(Метаданные.Константы.КоличествоМесяцевХраненияИсторииРассылкиОтчетов);
	Объекты.Добавить(Метаданные.Константы.ПараметрыБлокировкиРаботыССервисамиИнтернетПоддержки);
	Объекты.Добавить(Метаданные.Константы.ПорядокОбрабатываемыхДанных);
	Объекты.Добавить(Метаданные.Константы.ХранитьИсториюРассылкиОтчетов);
	
	Объекты.Добавить(Метаданные.Константы.ОтсрочкаУдаленияДанныхУничтоженныхДокументов);
	
	Объекты.Добавить(Метаданные.Константы.ЗавершенПереходНаНовыйФорматХраненияЭП);
	
КонецПроцедуры

Процедура ДобавитьЛишниеСправочники(Объекты)
	
	Объекты.Добавить(Метаданные.Справочники.ВерсииРасширений);
	Объекты.Добавить(Метаданные.Справочники.Виджеты);
	Объекты.Добавить(Метаданные.Справочники.ВидыСостоянийДокументовВСВД);
	Объекты.Добавить(Метаданные.Справочники.ВнешниеКомпоненты);
	Объекты.Добавить(Метаданные.Справочники.ВнешниеПользователи);
	Объекты.Добавить(Метаданные.Справочники.ГруппыВнешнихПользователей);
	Объекты.Добавить(Метаданные.Справочники.ГруппыДоступа);
	Объекты.Добавить(Метаданные.Справочники.ДескрипторыДоступаОбъектов);
	Объекты.Добавить(Метаданные.Справочники.ДескрипторыДоступаРегистров);
	Объекты.Добавить(Метаданные.Справочники.ДополнительныеОтчетыИОбработки);
	Объекты.Добавить(Метаданные.Справочники.ИдентификаторыОбъектовМетаданных);
	Объекты.Добавить(Метаданные.Справочники.ИдентификаторыОбъектовРасширений);
	Объекты.Добавить(Метаданные.Справочники.ИдентификаторыСервисовСопровождения);
	Объекты.Добавить(Метаданные.Справочники.ИнформационныеСсылкиДляФорм);
	Объекты.Добавить(Метаданные.Справочники.ИсторияПроверкиИКорректировкиДанных);
	Объекты.Добавить(Метаданные.Справочники.ИсторияПроверкиИКорректировкиДанныхПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.КатегорииОтчетов);
	Объекты.Добавить(Метаданные.Справочники.КлючевыеОперации);
	Объекты.Добавить(Метаданные.Справочники.НастройкиАвторизацииИнтернетСервисов);
	Объекты.Добавить(Метаданные.Справочники.НастройкиОборудования);
	Объекты.Добавить(Метаданные.Справочники.НастройкиПочтыСВД);
	Объекты.Добавить(Метаданные.Справочники.ОбластиДелегированияПрав);
	Объекты.Добавить(Метаданные.Справочники.ОбработчикиОчередиЗаданий);
	Объекты.Добавить(Метаданные.Справочники.ОбщиеВнешниеКомпоненты);
	Объекты.Добавить(Метаданные.Справочники.ОбщиеДанныеИнформационногоЦентра);
	Объекты.Добавить(Метаданные.Справочники.ОповещенияПользователей);
	Объекты.Добавить(Метаданные.Справочники.ОчередиСообщенийИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.Справочники.ОчередьЗаданий);
	Объекты.Добавить(Метаданные.Справочники.ОчередьЗаданийОбластейДанных);
	Объекты.Добавить(Метаданные.Справочники.ПоказателиВиджетов);
	Объекты.Добавить(Метаданные.Справочники.ПолныеПутиКФормам);
	Объекты.Добавить(Метаданные.Справочники.ПользовательскиеНастройкиОтчетов);
	Объекты.Добавить(Метаданные.Справочники.ПоставляемыеДанные);
	Объекты.Добавить(Метаданные.Справочники.ПоставляемыеДополнительныеОтчетыИОбработки);
	Объекты.Добавить(Метаданные.Справочники.ПоставляемыеРасширения);
	Объекты.Добавить(Метаданные.Справочники.ПоставщикиУслугСервиса);
	Объекты.Добавить(Метаданные.Справочники.ПравилаОтправкиСообщенийСВД);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиВебСервиса1СДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиВебСервиса1СДокументооборота2013);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиВебСервиса1СДокументооборотаЭП);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиПочты1СДокументооборота);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиПочты1СДокументооборота2013);
	Объекты.Добавить(Метаданные.Справочники.СВДНастройкаПриемаОтправкиПочты1СДокументооборотаЭП);
	Объекты.Добавить(Метаданные.Справочники.СерверныеСообщенияСВД);
	Объекты.Добавить(Метаданные.Справочники.СообщенияИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.Справочники.СообщенияОбластейДанных);
	Объекты.Добавить(Метаданные.Справочники.СообщенияСистемы);
	Объекты.Добавить(Метаданные.Справочники.СценарииОбменовДанными);
	Объекты.Добавить(Метаданные.Справочники.СправочникДляОткрытияСпискаПисем);
	Объекты.Добавить(Метаданные.Справочники.ТипыИнформацииИнформационногоЦентра);
	Объекты.Добавить(Метаданные.Справочники.ТранспортыОтправкиСообщенийСВД);
	Объекты.Добавить(Метаданные.Справочники.ТранспортыПриемаСообщенийСВД);
	Объекты.Добавить(Метаданные.Справочники.ТранспортыСВД);
	Объекты.Добавить(Метаданные.Справочники.УдалитьДескрипторыДоступаФайлов);
	Объекты.Добавить(Метаданные.Справочники.УдалитьОчередьЗаданий);
	Объекты.Добавить(Метаданные.Справочники.УдалитьПомещения);
	Объекты.Добавить(Метаданные.Справочники.УдалитьПроизошедшиеБизнесСобытия);
	Объекты.Добавить(Метаданные.Справочники.УдалитьШаблоныТекстовПисем);
	Объекты.Добавить(Метаданные.Справочники.УслугиСервиса);
	Объекты.Добавить(Метаданные.Справочники.ФорматыСообщенийСВД);
	Объекты.Добавить(Метаданные.Справочники.ШаблоныЗаданийОчереди);
	Объекты.Добавить(Метаданные.Справочники.ШаблоныСообщений);
	Объекты.Добавить(Метаданные.Справочники.ШаблоныСообщенийПрисоединенныеФайлы);
	Объекты.Добавить(Метаданные.Справочники.ЭтапыОбработкиДокументов);
	
	Объекты.Добавить(Метаданные.Справочники.ПользователиМобильногоПриложения);
	
КонецПроцедуры

Процедура ДобавитьЛишниеРегистрыСведений(Объекты)
	
	Объекты.Добавить(Метаданные.РегистрыСведений.ЖурналСобытийМЭДО);
	//Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеБизнесПроцессов);
	Объекты.Добавить(Метаданные.РегистрыСведений.АдминистративнаяИерархия);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияАдминистративнойИерархии);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияМуниципальнойИерархии);
	Объекты.Добавить(Метаданные.РегистрыСведений.МуниципальнаяИерархия);
	Объекты.Добавить(Метаданные.РегистрыСведений.СубъектыДляРасчетаСроковХранения);
	Объекты.Добавить(Метаданные.РегистрыСведений.УничтоженныеПерсональныеДанные);
	Объекты.Добавить(Метаданные.РегистрыСведений.HTMLПредставленияСодержанияПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.БлокировкиСеансовОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.БуферОперацийСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВерсииОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВерсииПодсистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВерсииПодсистемОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВременныеИдентификаторыЗапросов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДампыПлатформы);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеВнутреннихДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеВходящихДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеИсходящихДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеМероприятий);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеОбработанныеВЦентральномУзлеРИБ);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДанныеОбъектовДляРегистрацииВОбменах);	
	Объекты.Добавить(Метаданные.РегистрыСведений.ДатыЗакрытияКарточекПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДескрипторыДляОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДлительныеОперации);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДокументооборотПользователиГруппДоступа);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДокументыСОшибкамиПроверкиКонтрагентов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДоступныеЛицензии);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗадачиДляВыполнения);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыВремени);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыВремениТехнологические);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыКомментарииСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыМетрик);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыОбластиСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыОперацииСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗамерыСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗанятыеЛицензии);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗаписиСинхронизацииКалендарей);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗапросыРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗапущенныеОбработчикиОчередиЗаданий);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗначенияПоказателейРаботыПользователя);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИдентификаторыЗапросовНаПодключение);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИдентификаторыОбъектовВерсийРасширений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИзмененныеНастройкиСинхронизацииСМобильнымКлиентом);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИзмененияОбщихДанныхУзлов);	
	Объекты.Добавить(Метаданные.РегистрыСведений.ИнцидентыОткрытые);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИнцидентыОтложенныеПроверки);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсполнителиРолейИДелегаты);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИспользованиеАдресатовПользователями);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИспользованиеПоставляемыхДополнительныхОтчетовИОбработокВОбластяхДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИспользованиеПоставляемыхРасширенийВОбластяхДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияБеседСЧатБотом);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияЗапускаЗаданийОчереди);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияСостоянийДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КешИнформацииОбОбъектах);
	Объекты.Добавить(Метаданные.РегистрыСведений.КоличествоНастроекШаблоновПроцессов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КоличествоПисемВПапках);
	Объекты.Добавить(Метаданные.РегистрыСведений.КомментарииОперацииСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.КомментарииСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.КурсыВалют);
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшДанныхКлассификаторов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшПереводов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшПрограммныхИнтерфейсов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшСостоянийКонтрагентовФНС);
	Объекты.Добавить(Метаданные.РегистрыСведений.МиграцияПриложенийОчередьЗагрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.МиграцияПриложенийСостояниеВыгрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.МиграцияПриложенийСостояниеЗагрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.МП_ИзмененныеСостоянияПриглашенийНаМероприятия);
	Объекты.Добавить(Метаданные.РегистрыСведений.МП_ИзмененныеТрудозатраты);
	Объекты.Добавить(Метаданные.РегистрыСведений.МП_ОтправленныеСсылочныеДанные);
	Объекты.Добавить(Метаданные.РегистрыСведений.МП_СинхронизацияПроектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.МП_Сканы);
	Объекты.Добавить(Метаданные.РегистрыСведений.НазначениеДополнительныхОбработок);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиКомандПечати);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОтправителя);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиСинхронизацииDAV);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиСинхронизацииGoogle);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиТекущихДел);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиТранспортаОбменаСообщениями);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиОбменаДаннымиXDTO);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиТранспортаОбменаДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиТранспортаОбменаОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиТранспортаОбменаОбластиДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиУчетныхСистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиЭтаповОбработкиДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.НеразделенныеПользователи);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбластиДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбластиСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбменСМобильнымиНастройкиПользователей);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбработанныеУчетныеЗаписи);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбработкаНовыхПисемДляОтправкиPushУведомлений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбработчикиОбновления);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбработчикиОбновленияОбщихДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбработчикиСобытийСинхронизацииДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбщиеПоставляемыеМакетыПечати);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбщиеРеквизитыДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбъектыКОтправке);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОграничениеСкоростиОтсылкиИнцидентов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОператорыЭДО);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОперацииСтатистики);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОповещенияОПисьмах);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОтметкиВыполненияЗаданийВМоделиСервиса);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередиСообщенийОбменаСИнтегрированнымиСистемами);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьВерсийФайловДляРазмещенийВТомах);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьИзвлеченияТекста);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьИнсталляцииПоставляемыхДополнительныхОтчетовИОбработокВОбластиДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьИнсталляцииПоставляемыхРасширенийВОбластиДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьМаршрутизацииКомплексныхПроцессов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьОбновленияОбсуждений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьОбновленияПравДоступа);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьОбновляемыхПоставляемыхРасширенийВОбластяхДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьПересчетаПоказателейПроцессов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьРасширенийДляОповещений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОчередьУведомлений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПакетыДляОтправки);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПапкиХраненияФайловОбъектовИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПараметрыОграниченияДоступа);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПараметрыРаботыВерсийРасширений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПараметрыРаботыПрограммы);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПереходыВВебВерсиюСПАРК);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПисьмаВПроцессеОтправкиПоВнутреннейМаршрутизации);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПодготовленныеКОтправкеПисьма);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПодпискиПолучателей);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПодчиненностьПодразделений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПодчиненностьСотрудников);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПользователиВКонтейнерах);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПользовательскиеМакетыПечати);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПользовательскиеНастройкиДоступаКОбработкам);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПороговыеЗначенияПоказателейВиджетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеТребующиеОбработки);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПоставляемыеДанныеТребующиеОбработкиВОбластях);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПоставляемыеМакетыПечати);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПотокиОбновления);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПраваПоДескрипторамДоступаОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПраваПоДескрипторамДоступаРегистров);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПраваРолей);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаДляОбменаДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаЗаполненияПолейДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаПересылкиСообщений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПравилаПреобразованияФорматов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПредельныеЗначенияОКВЭД2);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовВМоделиСервиса);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПрименениеРазрешенийНаИспользованиеВнешнихРесурсовОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПричиныИзмененияАдресныхСведений);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПроверкаПоступленияНовыхПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПроизошедшиеБизнесСобытия);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПрогрессОбновления);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПромежуточныеРезультатыПоискаПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПросмотренныеДанныеИнформационногоЦентра);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПротоколВыполненияЗадачПоПочте);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПротоколДоставкиПочты);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПротоколРаботыПользователей);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПротоколРаботыСМобильнымиКлиентами);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПротоколРаботыССервисомРаспознавания);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПроцессыДляЗапуска);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПсевдонимыПредопределенныхУзлов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.РабочиеГруппы);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазмерОбъектовМетаданныхПриложений);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазмерПриложений);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазмерыФайловТомов);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенныеМобильныеПользователи);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенияДоступаИсключительные);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенияДоступаОбщие);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенияНаИспользованиеВнешнихРесурсов);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенияНаИспользованиеВнешнихРесурсовВМоделиСервиса);
	Объекты.Добавить(Метаданные.РегистрыСведений.РазрешенияНаИспользованиеВнешнихРесурсовОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.РежимыПодключенияВнешнихМодулей);
	Объекты.Добавить(Метаданные.РегистрыСведений.РежимыПодключенияВнешнихМодулейВМоделиСервиса);
	Объекты.Добавить(Метаданные.РегистрыСведений.РежимыПодключенияВнешнихМодулейОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.РезультатыОбменаДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.РейтингАктивностиОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОМобильныхКлиентах);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОМобильныхОнлайнКлиентах);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОПросмотреПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОСообщенияхОбменаСМобильнымиКлиентами);
	Объекты.Добавить(Метаданные.РегистрыСведений.СведенияОСообщенияхОбменаСИнтегрированнымиСистемами);
	Объекты.Добавить(Метаданные.РегистрыСведений.СводныеПриложенияОчередьЗагрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.СводныеПриложенияСостояниеВыгрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.СводныеПриложенияСостояниеЗагрузки);
	Объекты.Добавить(Метаданные.РегистрыСведений.СвойстваЗаданий);
	Объекты.Добавить(Метаданные.РегистрыСведений.СвязьВидовИФорматовДокументовЭДО);
	Объекты.Добавить(Метаданные.РегистрыСведений.СвязиЗначенийСвойствИОбъектовИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.СвязиОбъектовИСообщенийИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.СессииОбменаСообщениямиСистемы);
	Объекты.Добавить(Метаданные.РегистрыСведений.СинхронизацияПапокПисемСМобильнымКлиентом);
	Объекты.Добавить(Метаданные.РегистрыСведений.СловаПисем);
	Объекты.Добавить(Метаданные.РегистрыСведений.СобытияМониторингаСПАРКРиски);
	Объекты.Добавить(Метаданные.РегистрыСведений.СовместимостьОператоровЭДО);
	Объекты.Добавить(Метаданные.РегистрыСведений.СообщенияPushУведомлений);
	Объекты.Добавить(Метаданные.РегистрыСведений.СоставСубъектовПравДоступа);
	Объекты.Добавить(Метаданные.РегистрыСведений.СоставыГруппПользователей);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияИнтеграцииОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияКонтрагентов);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияОбменовДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияРассылокОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияУчетныхЗаписей);
	Объекты.Добавить(Метаданные.РегистрыСведений.СообщенияОбменаДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.СообщенияОбменаДаннымиОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.СоответствияОбъектовИнформационныхБаз);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияОбменовДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияОбменовДаннымиОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияУспешныхОбменовДанными);
	Объекты.Добавить(Метаданные.РегистрыСведений.СостоянияУспешныхОбменовДаннымиОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.СклоненияПредставленийОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.СтатистикаКонфигурации);
	Объекты.Добавить(Метаданные.РегистрыСведений.СтатистикаОтправкаPushУведомлений);
	Объекты.Добавить(Метаданные.РегистрыСведений.СтатусыСинхронизацииФайловСОблачнымСервисом);
	Объекты.Добавить(Метаданные.РегистрыСведений.СтепеньГотовностиСообщенийИнтегрированныхСистем);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьАдресныйКлассификатор);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьВерсииКлассификаторовОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьВизыСогласования);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьДелегированиеПравПользователям);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьДескрипторыДоступаДляОбъектов);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьИсторияСостоянийДокументовВСВД);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиУведомленийПоУмолчанию);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиУведомленияОЗадачах);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиУведомленияОКонтроле);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьНастройкиУведомленияОкончанияСрокаДействия);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьОбластиПерсональныхДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьПараметрыИнтернетПоддержкиПользователей);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьПодпискиНаУведомления);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьПраваПоДескрипторамДоступа);
	Объекты.Добавить(Метаданные.РегистрыСведений.УдалитьСвязанныеЗаписиКалендаря);
	Объекты.Добавить(Метаданные.РегистрыСведений.УчастникиСВД);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыДокументовГотовыхКОтправкеПоСВД);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыКУдалению);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыНаРаспознавании);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФайлыОбластейДанных);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФорматыДляПреобразования);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФорматыЭлектронныхДокументов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЭтапыОбработкиДокументов);
	
	Объекты.Добавить(Метаданные.РегистрыСведений.АрхивСообщенийОбменов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ВерсииРегламентированныхОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ДатаОбновленияСостоянийКонтрагентов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ЗадачиОбменаДаннымиВнутренняяПубликация);
	Объекты.Добавить(Метаданные.РегистрыСведений.ИсторияРассылкиОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.КлассификаторФИО);
	Объекты.Добавить(Метаданные.РегистрыСведений.КонтурСинхронизации);
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшДанныхВнешнихКомпонент);
	Объекты.Добавить(Метаданные.РегистрыСведений.НастройкиАрхиваСообщенийОбменов);
	Объекты.Добавить(Метаданные.РегистрыСведений.ОбъектыНезарегистрированныеПриЗацикливании);
	Объекты.Добавить(Метаданные.РегистрыСведений.СертификатыПолучателейРассылкиОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.СнимкиОтчетов);
	Объекты.Добавить(Метаданные.РегистрыСведений.УведомленияМонитораПортала);
	Объекты.Добавить(Метаданные.РегистрыСведений.ФиксацияОбработкиДанныхОбработчиками);
	
КонецПроцедуры

Процедура ДобавитьЛишниеПланыОбмена(Объекты)
	
	Объекты.Добавить(Метаданные.ПланыОбмена.Полный);
	Объекты.Добавить(Метаданные.ПланыОбмена.ПоискПисемРегистрацияВсехПисем);
	Объекты.Добавить(Метаданные.ПланыОбмена.ОбновлениеИнформационнойБазы);
	Объекты.Добавить(Метаданные.ПланыОбмена.СинхронизацияКалендарей);
	Объекты.Добавить(Метаданные.ПланыОбмена.Мобильный);
	Объекты.Добавить(Метаданные.ПланыОбмена.МобильныйРегистрацияВсехДанных);

	Для Каждого Объект Из Метаданные.ПланыОбмена Цикл
		
		Если Объект <> Метаданные.ПланыОбмена.ИнтегрированныеСистемы Тогда
			Объекты.Добавить(Объект);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
